Namespaces
  Autodesk.Revit Namespace
  BrowserOrganizationType Enumeration
  Autodesk.Revit.ApplicationServices Namespace
  Application Class
  Application Members
  Application Constructor
  Application Methods
  CopyModel Method
  Dispose Method
  ExtractPartAtomFromFamilyFile Method
  GetFailureDefinitionRegistry Method
  GetLibraryPaths Method
  GetRevitServerNetworkHosts Method
  GetWorksharingCentralGUID Method
  IsValidThickness Method
  NewFamilyDocument Method
  NewProjectDocument Method
  NewProjectTemplateDocument Method
  OpenBuildingComponentDocument Method
  OpenDocumentFile Method
  OpenDocumentFile Method (String)
  OpenDocumentFile Method (ModelPath, OpenOptions)
  OpenIFCDocument Method
  OpenIFCDocument Method (String)
  OpenIFCDocument Method (String, IFCImportOptions)
  OpenSharedParameterFile Method
  PurgeReleasedAPIObjects Method
  RegisterFailuresProcessor Method
  SetLibraryPaths Method
  UpdateRenderAppearanceLibrary Method
  WriteJournalComment Method
  Application Properties
  ActiveAddInId Property
  AllUsersAddinsLocation Property
  AngleTolerance Property
  Assets Property
  Cities Property
  Create Property
  CurrentRevitServerAccelerator Property
  CurrentUserAddinsLocation Property
  DefaultIFCProjectTemplate Property
  DefaultProjectTemplate Property
  DefaultViewDiscipline Property
  Documents Property
  ExportIFCCategoryTable Property
  FamilyTemplatePath Property
  ImportIFCCategoryTable Property
  IsArchitectureEnabled Property
  IsElectricalAnalysisEnabled Property
  IsElectricalEnabled Property
  IsEnergyAnalysisEnabled Property
  IsMassingEnabled Property
  IsMechanicalAnalysisEnabled Property
  IsMechanicalEnabled Property
  IsPipingAnalysisEnabled Property
  IsPipingEnabled Property
  IsQuiescent Property
  IsStructuralAnalysisEnabled Property
  IsStructureEnabled Property
  IsSystemsEnabled Property
  IsValidObject Property
  Language Property
  MinimumThickness Property
  ObjectFactory Property
  Product Property
  RecordingJournalFilename Property
  SharedParametersFilename Property
  ShortCurveTolerance Property
  ShowGraphicalWarningCableTrayConduitDisconnects Property
  ShowGraphicalWarningDuctDisconnects Property
  ShowGraphicalWarningElectricalDisconnects Property
  ShowGraphicalWarningPipeDisconnects Property
  Username Property
  VersionBuild Property
  VersionName Property
  VersionNumber Property
  VertexTolerance Property
  Application Events
  ApplicationInitialized Event
  DocumentChanged Event
  DocumentClosed Event
  DocumentClosing Event
  DocumentCreated Event
  DocumentCreating Event
  DocumentOpened Event
  DocumentOpening Event
  DocumentPrinted Event
  DocumentPrinting Event
  DocumentSaved Event
  DocumentSavedAs Event
  DocumentSaving Event
  DocumentSavingAs Event
  DocumentSynchronizedWithCentral Event
  DocumentSynchronizingWithCentral Event
  DocumentWorksharingEnabled Event
  ElementTypeDuplicated Event
  ElementTypeDuplicating Event
  FailuresProcessing Event
  FamilyLoadedIntoDocument Event
  FamilyLoadingIntoDocument Event
  FileExported Event
  FileExporting Event
  FileImported Event
  FileImporting Event
  ProgressChanged Event
  ViewPrinted Event
  ViewPrinting Event
  ControlledApplication Class
  ControlledApplication Members
  ControlledApplication Methods
  GetFailureDefinitionRegistry Method
  GetLibraryPaths Method
  OpenSharedParameterFile Method
  RegisterFailuresProcessor Method
  SetLibraryPaths Method
  WriteJournalComment Method
  ControlledApplication Properties
  ActiveAddInId Property
  AllUsersAddinsLocation Property
  Cities Property
  Create Property
  CurrentUserAddinsLocation Property
  IsLateAddinLoading Property
  IsQuiescent Property
  Language Property
  Product Property
  RecordingJournalFilename Property
  SharedParametersFilename Property
  VersionBuild Property
  VersionName Property
  VersionNumber Property
  ControlledApplication Events
  ApplicationInitialized Event
  DocumentChanged Event
  DocumentClosed Event
  DocumentClosing Event
  DocumentCreated Event
  DocumentCreating Event
  DocumentOpened Event
  DocumentOpening Event
  DocumentPrinted Event
  DocumentPrinting Event
  DocumentSaved Event
  DocumentSavedAs Event
  DocumentSaving Event
  DocumentSavingAs Event
  DocumentSynchronizedWithCentral Event
  DocumentSynchronizingWithCentral Event
  ElementTypeDuplicated Event
  ElementTypeDuplicating Event
  FailuresProcessing Event
  FamilyLoadedIntoDocument Event
  FamilyLoadingIntoDocument Event
  FileExported Event
  FileExporting Event
  FileImported Event
  FileImporting Event
  ProgressChanged Event
  ViewPrinted Event
  ViewPrinting Event
  LanguageType Enumeration
  ProductType Enumeration
  Autodesk.Revit.Attributes Namespace
  JournalingAttribute Class
  JournalingAttribute Members
  JournalingAttribute Constructor
  JournalingAttribute Methods
  JournalingAttribute Properties
  Mode Property
  JournalingMode Enumeration
  RegenerationAttribute Class
  RegenerationAttribute Members
  RegenerationAttribute Constructor
  RegenerationAttribute Methods
  RegenerationAttribute Properties
  Option Property
  RegenerationOption Enumeration
  TransactionAttribute Class
  TransactionAttribute Members
  TransactionAttribute Constructor
  TransactionAttribute Methods
  TransactionAttribute Properties
  Mode Property
  TransactionMode Enumeration
  Autodesk.Revit.Creation Namespace
  Application Class
  Application Members
  Application Methods
  NewAreaCreationData Method
  NewBoundingBoxUV Method
  NewBoundingBoxUV Method
  NewBoundingBoxUV Method (Double, Double, Double, Double)
  NewBoundingBoxXYZ Method
  NewBuildingSiteExportOptions Method
  NewCategorySet Method
  NewColor Method
  NewCombinableElementArray Method
  NewCurveArrArray Method
  NewCurveArray Method
  NewCurveLoopsProfile Method
  NewDoubleArray Method
  NewDWFExportOptions Method
  NewDWFXExportOptions Method
  NewElementId Method
  NewElementSet Method
  NewFaceArray Method
  NewFamilyInstanceCreationData Method
  NewFamilyInstanceCreationData Method (Face, Line, FamilySymbol)
  NewFamilyInstanceCreationData Method (XYZ, FamilySymbol, StructuralType)
  NewFamilyInstanceCreationData Method (Curve, FamilySymbol, Level, StructuralType)
  NewFamilyInstanceCreationData Method (Face, XYZ, XYZ, FamilySymbol)
  NewFamilyInstanceCreationData Method (XYZ, FamilySymbol, Element, StructuralType)
  NewFamilyInstanceCreationData Method (XYZ, FamilySymbol, Level, StructuralType)
  NewFamilyInstanceCreationData Method (XYZ, FamilySymbol, Element, Level, StructuralType)
  NewFamilyInstanceCreationData Method (XYZ, FamilySymbol, XYZ, Element, StructuralType)
  NewFamilySymbolProfile Method
  NewFBXExportOptions Method
  NewGBXMLImportOptions Method
  NewGeometryOptions Method
  NewImageImportOptions Method
  NewInstanceBinding Method
  NewInstanceBinding Method
  NewInstanceBinding Method (CategorySet)
  NewIntersectionResultArray Method
  NewLoadCaseArray Method
  NewLoadCombinationArray Method
  NewLoadUsageArray Method
  NewPlane Method
  NewPlane Method (CurveArray)
  NewPlane Method (XYZ, XYZ)
  NewPlane Method (XYZ, XYZ, XYZ)
  NewPoint Method
  NewPointOnEdge Method
  NewPointOnEdgeEdgeIntersection Method
  NewPointOnEdgeFaceIntersection Method
  NewPointOnFace Method
  NewPointOnPlane Method
  NewPointRelativeToPoint Method
  NewProjectPosition Method
  NewReferenceArray Method
  NewReferencePointArray Method
  NewSpaceSet Method
  NewTypeBinding Method
  NewTypeBinding Method
  NewTypeBinding Method (CategorySet)
  NewUV Method
  NewUV Method
  NewUV Method (UV)
  NewUV Method (Double, Double)
  NewVertexIndexPair Method
  NewVertexIndexPairArray Method
  NewViewSet Method
  NewXYZ Method
  NewXYZ Method
  NewXYZ Method (XYZ)
  NewXYZ Method (Double, Double, Double)
  Application Properties
  AreaCreationData Class
  AreaCreationData Members
  AreaCreationData Constructor
  AreaCreationData Methods
  AreaCreationData Properties
  TagPoint Property
  Document Class
  Document Members
  Document Methods
  NewArea Method
  NewAreaBoundaryConditions Method
  NewAreaBoundaryConditions Method (Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
  NewAreaBoundaryConditions Method (Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
  NewAreaBoundaryLine Method
  NewAreaLoad Method
  NewAreaLoad Method (Element, XYZ, Boolean, AreaLoadType)
  NewAreaLoad Method (IList(XYZ), XYZ, Boolean, AreaLoadType)
  NewAreaLoad Method (CurveArray, Int32[], Int32[], IList(XYZ), Boolean, AreaLoadType)
  NewAreaLoad Method (CurveArray, Int32[], Int32[], XYZ, XYZ, XYZ, Boolean, AreaLoadType)
  NewAreas Method
  NewAreaTag Method
  NewCrossFitting Method
  NewCurtainSystem Method
  NewCurtainSystem2 Method
  NewDimension Method
  NewDuct Method
  NewDuct Method (Connector, Connector, DuctType)
  NewDuct Method (XYZ, Connector, DuctType)
  NewDuct Method (XYZ, XYZ, DuctType)
  NewElbowFitting Method
  NewElectricalSystem Method
  NewElectricalSystem Method (Connector, ElectricalSystemType)
  NewElectricalSystem Method (ICollection(ElementId), ElectricalSystemType)
  NewExtrusionRoof Method
  NewFamilyInstance Method
  NewFamilyInstance Method (Curve, FamilySymbol, Level, StructuralType)
  NewFamilyInstance Method (XYZ, FamilySymbol, Level, StructuralType)
  NewFamilyInstance Method (XYZ, FamilySymbol, Element, Level, StructuralType)
  NewFascia Method
  NewFascia Method (FasciaType, Reference)
  NewFascia Method (FasciaType, ReferenceArray)
  NewFlexDuct Method
  NewFlexDuct Method (IList(XYZ), FlexDuctType)
  NewFlexDuct Method (Connector, Connector, FlexDuctType)
  NewFlexDuct Method (Connector, IList(XYZ), FlexDuctType)
  NewFlexPipe Method
  NewFlexPipe Method (IList(XYZ), FlexPipeType)
  NewFlexPipe Method (Connector, Connector, FlexPipeType)
  NewFlexPipe Method (Connector, IList(XYZ), FlexPipeType)
  NewFloor Method
  NewFloor Method (CurveArray, Boolean)
  NewFloor Method (CurveArray, FloorType, Level, Boolean)
  NewFloor Method (CurveArray, FloorType, Level, Boolean, XYZ)
  NewFootPrintRoof Method
  NewFoundationSlab Method
  NewFoundationWall Method
  NewGrid Method
  NewGrid Method (Arc)
  NewGrid Method (Line)
  NewGrids Method
  NewGutter Method
  NewGutter Method (GutterType, Reference)
  NewGutter Method (GutterType, ReferenceArray)
  NewLineBoundaryConditions Method
  NewLineBoundaryConditions Method (Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
  NewLineBoundaryConditions Method (Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
  NewLineLoad Method
  NewLineLoad Method (Element, IList(XYZ), IList(XYZ), Boolean, Boolean, Boolean, LineLoadType, SketchPlane)
  NewLineLoad Method (Reference, IList(XYZ), IList(XYZ), Boolean, Boolean, Boolean, LineLoadType, SketchPlane)
  NewLineLoad Method (IList(XYZ), IList(XYZ), IList(XYZ), Boolean, Boolean, Boolean, LineLoadType, SketchPlane)
  NewLineLoad Method (XYZ, XYZ, XYZ, XYZ, XYZ, XYZ, Boolean, Boolean, Boolean, LineLoadType, SketchPlane)
  NewLoadCase Method
  NewLoadCombination Method
  NewLoadNature Method
  NewLoadUsage Method
  NewMechanicalSystem Method
  NewOpening Method
  NewOpening Method (Element, CurveArray, eRefFace)
  NewOpening Method (Element, CurveArray, Boolean)
  NewOpening Method (Level, Level, CurveArray)
  NewOpening Method (Wall, XYZ, XYZ)
  NewPipe Method
  NewPipe Method (Connector, Connector, PipeType)
  NewPipe Method (XYZ, Connector, PipeType)
  NewPipe Method (XYZ, XYZ, PipeType)
  NewPipingSystem Method
  NewPointBoundaryConditions Method
  NewPointLoad Method
  NewPointLoad Method (Reference, XYZ, XYZ, Boolean, PointLoadType, SketchPlane)
  NewPointLoad Method (XYZ, XYZ, XYZ, Boolean, PointLoadType, SketchPlane)
  NewRoom Method
  NewRoom Method (Phase)
  NewRoom Method (Level, UV)
  NewRoom Method (Room, PlanCircuit)
  NewRoomBoundaryLines Method
  NewRooms2 Method
  NewRooms2 Method (Level)
  NewRooms2 Method (Level, Phase)
  NewRooms2 Method (Phase, Int32)
  NewRoomTag Method
  NewSlab Method
  NewSlabEdge Method
  NewSlabEdge Method (SlabEdgeType, Reference)
  NewSlabEdge Method (SlabEdgeType, ReferenceArray)
  NewSpace Method
  NewSpace Method (Phase)
  NewSpace Method (Level, UV)
  NewSpace Method (Level, Phase, UV)
  NewSpaceBoundaryLines Method
  NewSpaces2 Method
  NewSpaces2 Method (Phase, Int32)
  NewSpaces2 Method (Level, Phase, View)
  NewSpaceTag Method
  NewSpotCoordinate Method
  NewSpotElevation Method
  NewTag Method
  NewTakeoffFitting Method
  NewTeeFitting Method
  NewTextNote Method
  NewTransitionFitting Method
  NewUnionFitting Method
  NewViewDrafting Method
  NewWire Method
  NewZone Method
  Document Properties
  eRefFace Enumeration
  FamilyInstanceCreationData Class
  FamilyInstanceCreationData Members
  FamilyInstanceCreationData Constructor
  FamilyInstanceCreationData Constructor (Face, Line, FamilySymbol)
  FamilyInstanceCreationData Constructor (XYZ, FamilySymbol, StructuralType)
  FamilyInstanceCreationData Constructor (Curve, FamilySymbol, Level, StructuralType)
  FamilyInstanceCreationData Constructor (Face, XYZ, XYZ, FamilySymbol)
  FamilyInstanceCreationData Constructor (XYZ, FamilySymbol, Element, StructuralType)
  FamilyInstanceCreationData Constructor (XYZ, FamilySymbol, Level, StructuralType)
  FamilyInstanceCreationData Constructor (XYZ, FamilySymbol, Element, Level, StructuralType)
  FamilyInstanceCreationData Constructor (XYZ, FamilySymbol, XYZ, Element, StructuralType)
  FamilyInstanceCreationData Methods
  FamilyInstanceCreationData Properties
  Axis Property
  RotateAngle Property
  FamilyItemFactory Class
  FamilyItemFactory Members
  FamilyItemFactory Methods
  NewAngularDimension Method
  NewAngularDimension Method (View, Arc, Reference, Reference)
  NewAngularDimension Method (View, Arc, Reference, Reference, DimensionType)
  NewArcLengthDimension Method
  NewArcLengthDimension Method (View, Arc, Reference, Reference, Reference)
  NewArcLengthDimension Method (View, Arc, Reference, Reference, Reference, DimensionType)
  NewBlend Method
  NewControl Method
  NewCurveByPoints Method
  NewDiameterDimension Method
  NewDimension Method
  NewExtrusion Method
  NewExtrusionForm Method
  NewFamilyInstance Method
  NewFormByCap Method
  NewFormByThickenSingleSurface Method
  NewLinearDimension Method
  NewLinearDimension Method (View, Line, ReferenceArray)
  NewLinearDimension Method (View, Line, ReferenceArray, DimensionType)
  NewLoftForm Method
  NewModelText Method
  NewOpening Method
  NewRadialDimension Method
  NewRadialDimension Method (View, Reference, XYZ)
  NewRadialDimension Method (View, Reference, XYZ, DimensionType)
  NewReferencePoint Method
  NewReferencePoint Method (PointElementReference)
  NewReferencePoint Method (Transform)
  NewReferencePoint Method (XYZ)
  NewRevolution Method
  NewRevolveForms Method
  NewSweep Method
  NewSweep Method (Boolean, ReferenceArray, SweepProfile, Int32, ProfilePlaneLocation)
  NewSweep Method (Boolean, CurveArray, SketchPlane, SweepProfile, Int32, ProfilePlaneLocation)
  NewSweptBlend Method
  NewSweptBlend Method (Boolean, Reference, SweepProfile, SweepProfile)
  NewSweptBlend Method (Boolean, Curve, SketchPlane, SweepProfile, SweepProfile)
  NewSweptBlendForm Method
  NewSymbolicCurve Method
  NewTextNote Method
  FamilyItemFactory Properties
  ItemFactoryBase Class
  ItemFactoryBase Members
  ItemFactoryBase Methods
  NewAlignment Method
  NewDetailCurve Method
  NewDetailCurveArray Method
  NewDimension Method
  NewDimension Method (View, Line, ReferenceArray)
  NewDimension Method (View, Line, ReferenceArray, DimensionType)
  NewFamilyInstance Method
  NewFamilyInstance Method (Face, Line, FamilySymbol)
  NewFamilyInstance Method (Line, FamilySymbol, View)
  NewFamilyInstance Method (Reference, Line, FamilySymbol)
  NewFamilyInstance Method (XYZ, FamilySymbol, StructuralType)
  NewFamilyInstance Method (XYZ, FamilySymbol, View)
  NewFamilyInstance Method (Face, XYZ, XYZ, FamilySymbol)
  NewFamilyInstance Method (Reference, XYZ, XYZ, FamilySymbol)
  NewFamilyInstance Method (XYZ, FamilySymbol, Element, StructuralType)
  NewFamilyInstance Method (XYZ, FamilySymbol, XYZ, Element, StructuralType)
  NewFamilyInstances2 Method
  NewGroup Method
  NewLevel Method
  NewModelCurve Method
  NewModelCurveArray Method
  NewReferencePlane Method
  NewReferencePlane2 Method
  NewTextNote Method
  NewTextNote Method (View, XYZ, XYZ, XYZ, Double, TextAlignFlags, String)
  NewTextNote Method (View, XYZ, XYZ, XYZ, Double, TextAlignFlags, TextNoteLeaderTypes, TextNoteLeaderStyles, XYZ, XYZ, String)
  PlaceGroup Method
  ItemFactoryBase Properties
  Autodesk.Revit.DB Namespace
  ACADExportOptions Class
  ACADExportOptions Members
  ACADExportOptions Methods
  ACADExportOptions Properties
  ACAPreference Property
  ExportingAreas Property
  ExportOfSolids Property
  FileVersion Property
  LineScaling Property
  LinetypesFileName Property
  MarkNonplotLayers Property
  NonplotSuffix Property
  SharedCoords Property
  TargetUnit Property
  TextTreatment Property
  ACADVersion Enumeration
  ACAObjectPreference Enumeration
  AdaptiveComponentFamilyUtils Class
  AdaptiveComponentFamilyUtils Members
  AdaptiveComponentFamilyUtils Methods
  GetNumberOfAdaptivePoints Method
  GetNumberOfPlacementPoints Method
  GetNumberOfShapeHandlePoints Method
  GetPlacementNumber Method
  GetPointConstraintType Method
  GetPointOrientationType Method
  IsAdaptiveComponentFamily Method
  IsAdaptivePlacementPoint Method
  IsAdaptivePoint Method
  IsAdaptiveShapeHandlePoint Method
  MakeAdaptivePoint Method
  SetPlacementNumber Method
  SetPointConstraintType Method
  SetPointOrientationType Method
  AdaptiveComponentInstanceUtils Class
  AdaptiveComponentInstanceUtils Members
  AdaptiveComponentInstanceUtils Methods
  CreateAdaptiveComponentInstance Method
  GetInstancePlacementPointElementRefIds Method
  GetInstancePointElementRefIds Method
  GetInstanceShapeHandlePointElementRefIds Method
  HasAdaptiveFamilySymbol Method
  IsAdaptiveComponentInstance Method
  IsAdaptiveFamilySymbol Method
  IsInstanceFlipped Method
  MoveAdaptiveComponentInstance Method
  SetInstanceFlipped Method
  AdaptivePointConstraintType Enumeration
  AdaptivePointOrientationType Enumeration
  AdaptivePointType Enumeration
  AddInId Class
  AddInId Members
  AddInId Constructor
  AddInId Methods
  Dispose Method
  GetAddInName Method
  GetAddInNameFromDocument Method
  GetGUID Method
  AddInId Properties
  IsValidObject Property
  AllowedValues Enumeration
  AlternateUnits Enumeration
  AnalyzesAsType Enumeration
  AnnotationSymbol Class
  AnnotationSymbol Members
  AnnotationSymbol Methods
  addLeader Method
  duplicate Method
  removeLeader Method
  AnnotationSymbol Properties
  AnnotationSymbolType Property
  FromRoom Property
  Leaders Property
  Parameter Property
  Room Property
  Space Property
  ToRoom Property
  AnnotationSymbolType Class
  AnnotationSymbolType Members
  AnnotationSymbolType Methods
  AnnotationSymbolType Properties
  Parameter Property
  AnnotationSymbolTypeSet Class
  AnnotationSymbolTypeSet Members
  AnnotationSymbolTypeSet Constructor
  AnnotationSymbolTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  AnnotationSymbolTypeSet Properties
  IsEmpty Property
  Size Property
  AnnotationSymbolTypeSetIterator Class
  AnnotationSymbolTypeSetIterator Members
  AnnotationSymbolTypeSetIterator Constructor
  AnnotationSymbolTypeSetIterator Methods
  MoveNext Method
  Reset Method
  AnnotationSymbolTypeSetIterator Properties
  Current Property
  APIObject Class
  APIObject Members
  APIObject Methods
  Dispose Method
  APIObject Properties
  IsReadOnly Property
  AppearanceAssetElement Class
  AppearanceAssetElement Members
  AppearanceAssetElement Methods
  Create Method
  GetAppearanceAssetElementByName Method
  GetRenderingAsset Method
  SetRenderingAsset Method
  AppearanceAssetElement Properties
  Parameter Property
  Arc Class
  Arc Members
  Arc Methods
  Create Method
  Create Method (XYZ, XYZ, XYZ)
  Create Method (Plane, Double, Double, Double)
  Create Method (XYZ, Double, Double, Double, XYZ, XYZ)
  Intersect Method
  IsInside Method
  Arc Properties
  Center Property
  Normal Property
  Radius Property
  XDirection Property
  YDirection Property
  Area Class
  Area Members
  Area Methods
  Area Properties
  AreaScheme Property
  IsGrossInterior Property
  Parameter Property
  AreaElemType Enumeration
  AreaFilter Class
  AreaFilter Members
  AreaFilter Constructor
  AreaFilter Methods
  PassesFilter Method
  AreaFilter Properties
  AreaScheme Class
  AreaScheme Members
  AreaScheme Methods
  AreaScheme Properties
  IsGrossBuildingArea Property
  Parameter Property
  AreaTag Class
  AreaTag Members
  AreaTag Methods
  AreaTag Properties
  Area Property
  AreaTagType Property
  Parameter Property
  AreaTagFilter Class
  AreaTagFilter Members
  AreaTagFilter Constructor
  AreaTagFilter Methods
  PassesFilter Method
  AreaTagFilter Properties
  AreaTagType Class
  AreaTagType Members
  AreaTagType Methods
  AreaTagType Properties
  Parameter Property
  AreaTagTypeSet Class
  AreaTagTypeSet Members
  AreaTagTypeSet Constructor
  AreaTagTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  AreaTagTypeSet Properties
  IsEmpty Property
  Size Property
  AreaTagTypeSetIterator Class
  AreaTagTypeSetIterator Members
  AreaTagTypeSetIterator Constructor
  AreaTagTypeSetIterator Methods
  MoveNext Method
  Reset Method
  AreaTagTypeSetIterator Properties
  Current Property
  AreaVolumeSettings Class
  AreaVolumeSettings Members
  AreaVolumeSettings Methods
  GetAreaVolumeSettings Method
  GetSpatialElementBoundaryLocation Method
  SetSpatialElementBoundaryLocation Method
  AreaVolumeSettings Properties
  ComputeVolumes Property
  Parameter Property
  ArrayAnchorMember Enumeration
  AssemblyCodeTable Class
  AssemblyCodeTable Members
  AssemblyCodeTable Methods
  GetAssemblyCodeTable Method
  AssemblyCodeTable Properties
  Parameter Property
  AssemblyDetailViewOrientation Enumeration
  AssemblyDifference Class
  AssemblyDifference Members
  AssemblyDifference Methods
  Dispose Method
  AssemblyDifference Properties
  IsValidObject Property
  AssemblyDifferenceConfiguration Class
  AssemblyDifferenceConfiguration Members
  AssemblyDifferenceConfiguration Methods
  AssemblyDifferenceConfiguration Properties
  AssemblyDifferenceMemberCount Class
  AssemblyDifferenceMemberCount Members
  AssemblyDifferenceMemberCount Methods
  AssemblyDifferenceMemberCount Properties
  Count1 Property
  Count2 Property
  AssemblyDifferenceMemberDifference Class
  AssemblyDifferenceMemberDifference Members
  AssemblyDifferenceMemberDifference Methods
  AssemblyDifferenceMemberDifference Properties
  MemberDifference Property
  MemberId1 Property
  MemberId2 Property
  AssemblyDifferenceNamingCategory Class
  AssemblyDifferenceNamingCategory Members
  AssemblyDifferenceNamingCategory Methods
  AssemblyDifferenceNamingCategory Properties
  NamingCategoryId1 Property
  NamingCategoryId2 Property
  AssemblyDifferenceNone Class
  AssemblyDifferenceNone Members
  AssemblyDifferenceNone Methods
  AssemblyDifferenceNone Properties
  AssemblyInstance Class
  AssemblyInstance Members
  AssemblyInstance Methods
  AddMemberIds Method
  AllowsAssemblyViewCreation Method
  AreElementsValidForAssembly Method
  CanRemoveElementsFromAssembly Method
  CompareAssemblyInstances Method
  Create Method
  Disassemble Method
  GetCenter Method
  GetMemberIds Method
  GetTransform Method
  IsValidNamingCategory Method
  PlaceInstance Method
  RemoveMemberIds Method
  SetMemberIds Method
  SetTransform Method
  AssemblyInstance Properties
  AssemblyTypeName Property
  Location Property
  NamingCategoryId Property
  Parameter Property
  AssemblyMemberDifference Class
  AssemblyMemberDifference Members
  AssemblyMemberDifference Methods
  Dispose Method
  AssemblyMemberDifference Properties
  IsValidObject Property
  AssemblyMemberDifferentCategory Class
  AssemblyMemberDifferentCategory Members
  AssemblyMemberDifferentCategory Methods
  AssemblyMemberDifferentCategory Properties
  CategoryId1 Property
  CategoryId2 Property
  AssemblyMemberDifferentGeometry Class
  AssemblyMemberDifferentGeometry Members
  AssemblyMemberDifferentGeometry Methods
  AssemblyMemberDifferentGeometry Properties
  AssemblyMemberDifferentParameters Class
  AssemblyMemberDifferentParameters Members
  AssemblyMemberDifferentParameters Methods
  AssemblyMemberDifferentParameters Properties
  AssemblyMemberDifferentType Class
  AssemblyMemberDifferentType Members
  AssemblyMemberDifferentType Methods
  AssemblyMemberDifferentType Properties
  TypeId1 Property
  TypeId2 Property
  AssemblyType Class
  AssemblyType Members
  AssemblyType Methods
  AssemblyType Properties
  Parameter Property
  AssemblyViewUtils Class
  AssemblyViewUtils Members
  AssemblyViewUtils Methods
  AcquireAssemblyViews Method
  Create3DOrthographic Method
  CreateDetailSection Method
  CreateMaterialTakeoff Method
  CreatePartList Method
  CreateSheet Method
  CreateSingleCategorySchedule Method
  AttachmentType Enumeration
  AutomaticConnectionBehaviorType Enumeration
  BackgroundImageFit Enumeration
  BackgroundSettings Class
  BackgroundSettings Members
  BackgroundSettings Methods
  Dispose Method
  BackgroundSettings Properties
  IsValidObject Property
  BackgroundStyle Enumeration
  BaseArray Class
  BaseArray Members
  BaseArray Methods
  GetCopiedMemberIds Method
  GetOriginalMemberIds Method
  BaseArray Properties
  Label Property
  Name Property
  NumMembers Property
  Parameter Property
  BaseExportOptions Class
  BaseExportOptions Members
  BaseExportOptions Methods
  Dispose Method
  GetExportFontTable Method
  GetExportLayerTable Method
  GetExportLinetypeTable Method
  GetExportPatternTable Method
  GetPredefinedSetupNames Method
  SetExportFontTable Method
  SetExportLayerTable Method
  SetExportLinetypeTable Method
  SetExportPatternTable Method
  BaseExportOptions Properties
  Colors Property
  HatchPatternsFileName Property
  HideReferencePlane Property
  HideScopeBox Property
  HideUnreferenceViewTags Property
  IsValidObject Property
  LayerMapping Property
  PropOverrides Property
  BaseImportOptions Class
  BaseImportOptions Members
  BaseImportOptions Methods
  Dispose Method
  GetLayerSelection Method
  GetRefPoint Method
  SetLayerSelection Method
  SetRefPoint Method
  BaseImportOptions Properties
  AutoCorrectAlmostVHLines Property
  ColorMode Property
  CustomScale Property
  IsValidObject Property
  OrientToView Property
  Placement Property
  ThisViewOnly Property
  Unit Property
  VisibleLayersOnly Property
  BaseLoadOn Enumeration
  BasePoint Class
  BasePoint Members
  BasePoint Methods
  BasePoint Properties
  IsShared Property
  Parameter Property
  BasicFileInfo Class
  BasicFileInfo Members
  BasicFileInfo Methods
  Dispose Method
  Extract Method
  GetDocumentVersion Method
  BasicFileInfo Properties
  AllLocalChangesSavedToCentral Property
  CentralPath Property
  IsCentral Property
  IsCreatedLocal Property
  IsInProgress Property
  IsLocal Property
  IsSavedInCurrentVersion Property
  IsValidObject Property
  IsWorkshared Property
  LanguageWhenSaved Property
  LatestCentralEpisodeGUID Property
  LatestCentralVersion Property
  SavedInVersion Property
  Username Property
  BeamSystem Class
  BeamSystem Members
  BeamSystem Methods
  BeamBelongsTo Method
  Create Method
  Create Method (Document, IList(Curve), SketchPlane, Int32)
  Create Method (Document, IList(Curve), Level, XYZ, Boolean)
  Create Method (Document, IList(Curve), Level, Int32, Boolean)
  Create Method (Document, IList(Curve), SketchPlane, XYZ, Boolean)
  DropBeamSystem Method
  GetBeamIds Method
  BeamSystem Properties
  BeamSystemType Property
  BeamType Property
  Direction Property
  Elevation Property
  LayoutRule Property
  Level Property
  Parameter Property
  Profile Property
  BeamSystemJustifyType Enumeration
  BeamSystemType Class
  BeamSystemType Members
  BeamSystemType Methods
  BeamSystemType Properties
  Parameter Property
  BeamSystemTypeSet Class
  BeamSystemTypeSet Members
  BeamSystemTypeSet Constructor
  BeamSystemTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  BeamSystemTypeSet Properties
  IsEmpty Property
  Size Property
  BeamSystemTypeSetIterator Class
  BeamSystemTypeSetIterator Members
  BeamSystemTypeSetIterator Constructor
  BeamSystemTypeSetIterator Methods
  MoveNext Method
  Reset Method
  BeamSystemTypeSetIterator Properties
  Current Property
  BehaviorType Enumeration
  Binding Class
  Binding Members
  Binding Methods
  Binding Properties
  BindingMap Class
  BindingMap Members
  BindingMap Methods
  Clear Method
  Contains Method
  Erase Method
  Insert Method
  Insert Method (Definition, Binding)
  Insert Method (Definition, Binding, BuiltInParameterGroup)
  ReInsert Method
  ReInsert Method (Definition, Binding)
  ReInsert Method (Definition, Binding, BuiltInParameterGroup)
  Remove Method
  BindingMap Properties
  Item Property
  Blend Class
  Blend Members
  Blend Methods
  GetVertexConnectionMap Method
  SetVertexConnectionMap Method
  Blend Properties
  BottomOffset Property
  BottomProfile Property
  BottomSketch Property
  Parameter Property
  TopOffset Property
  TopProfile Property
  TopSketch Property
  BooleanOperationsType Enumeration
  BooleanOperationsUtils Class
  BooleanOperationsUtils Members
  BooleanOperationsUtils Methods
  Dispose Method
  ExecuteBooleanOperation Method
  ExecuteBooleanOperationModifyingOriginalSolid Method
  BooleanOperationsUtils Properties
  IsValidObject Property
  BorderTile Enumeration
  BoundarySegment Class
  BoundarySegment Members
  BoundarySegment Methods
  BoundarySegment Properties
  Curve Property
  Document Property
  Element Property
  BoundarySegmentArray Class
  BoundarySegmentArray Members
  BoundarySegmentArray Constructor
  BoundarySegmentArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  BoundarySegmentArray Properties
  IsEmpty Property
  Item Property
  Size Property
  BoundarySegmentArrayArray Class
  BoundarySegmentArrayArray Members
  BoundarySegmentArrayArray Constructor
  BoundarySegmentArrayArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  BoundarySegmentArrayArray Properties
  IsEmpty Property
  Item Property
  Size Property
  BoundarySegmentArrayArrayIterator Class
  BoundarySegmentArrayArrayIterator Members
  BoundarySegmentArrayArrayIterator Constructor
  BoundarySegmentArrayArrayIterator Methods
  MoveNext Method
  Reset Method
  BoundarySegmentArrayArrayIterator Properties
  Current Property
  BoundarySegmentArrayIterator Class
  BoundarySegmentArrayIterator Members
  BoundarySegmentArrayIterator Constructor
  BoundarySegmentArrayIterator Methods
  MoveNext Method
  Reset Method
  BoundarySegmentArrayIterator Properties
  Current Property
  BoundingBoxContainsPointFilter Class
  BoundingBoxContainsPointFilter Members
  BoundingBoxContainsPointFilter Constructor
  BoundingBoxContainsPointFilter Constructor (XYZ)
  BoundingBoxContainsPointFilter Constructor (XYZ, Boolean)
  BoundingBoxContainsPointFilter Constructor (XYZ, Double)
  BoundingBoxContainsPointFilter Constructor (XYZ, Double, Boolean)
  BoundingBoxContainsPointFilter Methods
  PassesFilter Method
  BoundingBoxContainsPointFilter Properties
  Point Property
  Tolerance Property
  BoundingBoxIntersectsFilter Class
  BoundingBoxIntersectsFilter Members
  BoundingBoxIntersectsFilter Constructor
  BoundingBoxIntersectsFilter Constructor (Outline)
  BoundingBoxIntersectsFilter Constructor (Outline, Boolean)
  BoundingBoxIntersectsFilter Constructor (Outline, Double)
  BoundingBoxIntersectsFilter Constructor (Outline, Double, Boolean)
  BoundingBoxIntersectsFilter Methods
  GetBoundingBox Method
  PassesFilter Method
  BoundingBoxIntersectsFilter Properties
  Tolerance Property
  BoundingBoxIsInsideFilter Class
  BoundingBoxIsInsideFilter Members
  BoundingBoxIsInsideFilter Constructor
  BoundingBoxIsInsideFilter Constructor (Outline)
  BoundingBoxIsInsideFilter Constructor (Outline, Boolean)
  BoundingBoxIsInsideFilter Constructor (Outline, Double)
  BoundingBoxIsInsideFilter Constructor (Outline, Double, Boolean)
  BoundingBoxIsInsideFilter Methods
  GetBoundingBox Method
  PassesFilter Method
  BoundingBoxIsInsideFilter Properties
  Tolerance Property
  BoundingBoxUV Class
  BoundingBoxUV Members
  BoundingBoxUV Constructor
  BoundingBoxUV Constructor
  BoundingBoxUV Constructor (Double, Double, Double, Double)
  BoundingBoxUV Methods
  Dispose Method
  BoundingBoxUV Properties
  Bounds Property
  Max Property
  Min Property
  BoundingBoxXYZ Class
  BoundingBoxXYZ Members
  BoundingBoxXYZ Constructor
  BoundingBoxXYZ Methods
  BoundingBoxXYZ Properties
  BoundEnabled Property
  Bounds Property
  Enabled Property
  Max Property
  MaxEnabled Property
  Min Property
  MinEnabled Property
  Transform Property
  BoxPlacement Enumeration
  BrowserOrganization Class
  BrowserOrganization Members
  BrowserOrganization Methods
  AreFiltersSatisfied Method
  GetCurrentBrowserOrganizationForSheets Method
  GetCurrentBrowserOrganizationForViews Method
  GetFolderItems Method
  BrowserOrganization Properties
  Parameter Property
  SortingOrder Property
  SortingParameterId Property
  BuildingPadType Class
  BuildingPadType Members
  BuildingPadType Methods
  CreateDefault Method
  BuildingPadType Properties
  Parameter Property
  ThermalProperties Property
  BuildingSiteExportOptions Class
  BuildingSiteExportOptions Members
  BuildingSiteExportOptions Constructor
  BuildingSiteExportOptions Methods
  BuildingSiteExportOptions Properties
  AreaPerPerson Property
  PropertyLine Property
  PropertyLineOffset Property
  TotalGrossArea Property
  TotalOccupancy Property
  BuildingType Enumeration
  BuiltInCategory Enumeration
  BuiltInFailures Class
  BuiltInFailures.AnalyticalModelFailures Class
  BuiltInFailures.AnalyticalModelFailures Members
  BuiltInFailures.AnalyticalModelFailures Properties
  AdjustCurveTooShort Property
  AdjustEdgeTooShort Property
  AdjustEdgeTooShortErr Property
  AnalyticalBeamSlabWarning Property
  AnalyticalDiscrepancyWarning Property
  AnalyticalGapWarning Property
  AnalyticalLinkJoinedNodes Property
  AnalyticalLinkNotConnected Property
  AnalyticalMemberInstability Property
  AnalyticalModelInstability Property
  AnalyticalPhysicalCheckDone Property
  AnalyticalSupportCycleWarning Property
  AnalyticalTopBottomPlanesReversed Property
  AutoDetectIgnoreLeaderWarning Property
  BoundaryLinesIntersect Property
  CannotCreateAnalyticalGeometry Property
  CannotKeepAnalyticalAdjustment Property
  CannotMakeAnalyticalGeometry Property
  LoadsMayBeNotUpToDate Property
  ProjectionPlaneInvalidWall Property
  ProjectionPlanesNotIntersect Property
  ProjectionPlanesParallel Property
  StructAnalyticalErrorProjection Property
  StructuralElementMayNotBeSupported Property
  StructWallAnalyticalErrorAlign Property
  StructWallAnalyticalErrorConversion Property
  SupportCheckDone Property
  WallAMLostAdjustmentReference Property
  BuiltInFailures.ArrayFailures Class
  BuiltInFailures.ArrayFailures Members
  BuiltInFailures.ArrayFailures Properties
  ArrayingNotSupportedForElements Property
  ArrayMixedModAndViewSpecElemsCorruption Property
  ArrayMixedModAndViewSpecElemsWarning Property
  CannotCreateArraySelectionIsGrouped Property
  ConstraintsNotSatisfied Property
  CouldntFindNewHostsForElements Property
  IdenticalGeometryCopiesInArray Property
  InvalidPath3dIsAssignedToArray Property
  OnlyGroupsAndInstancesShouldBePlaced Property
  RadiusTooSmall Property
  BuiltInFailures.AssemblyFailures Class
  BuiltInFailures.AssemblyFailures Members
  BuiltInFailures.AssemblyFailures Properties
  AddedElementsNotSamePhaseAsAssembly Property
  AssemblyDeleteTypeWarn Property
  AssemblyDidNotMatchRequestedTypeWarn Property
  AssemblyDisassembleInstanceWarn Property
  AssemblyInheritTypeWarn Property
  AssemblyInvalidMember Property
  AssemblyNewTypeWarn Property
  AssemblyRenameTypeWarn Property
  CouldNotAcquireAssemblyViews Property
  CouldNotChangeTypeOfAssembly Property
  DeleteAssemblyInstWithViewsWarn Property
  DeleteShopDrawingsWarn Property
  ElementsNotAllowedAreNotAddedToAssembly Property
  IneligibleElementsInAssembly Property
  MixedPhasesInAssembly Property
  NoElementsAddedtoNewAssembly Property
  NoElementsLeftInExistingAssembly Property
  NoEligibleElementsInAssembly Property
  SomeElementsPreventAssemblyTypeChange Property
  BuiltInFailures.AutoJoinFailures Class
  BuiltInFailures.AutoJoinFailures Members
  BuiltInFailures.AutoJoinFailures Properties
  DesignOptionAndWorksetViolation Property
  DesignOptionCannotReference Property
  OtherNonEditJoinFailure Property
  UnexpectedJoinFailure Property
  Unknown Property
  WorksetJoinWarn Property
  BuiltInFailures.AutoRouteFailures Class
  BuiltInFailures.AutoRouteFailures Members
  BuiltInFailures.AutoRouteFailures Properties
  AttemptToComnnectNonSlopingElementToSlopedPipeError Property
  AttemptToComnnectNonSlopingElementToSlopedPipeWarning Property
  DesignOptionConflictError Property
  DesignOptionConflictWarning Property
  DistributionTypeInvalid Property
  ElementHasFlowCalculation Property
  ElementHasOpenConnection Property
  FailedDowngradeCrossToElbow Property
  FailedDowngradeCrossToTee Property
  FailedDowngradeTeeToCross Property
  FailToDoCompatiblePhaseError Property
  FailToDoCompatiblePhaseWarning Property
  FailToIntersectParallelSegmentsError Property
  FailToIntersectParallelSegmentsWarning Property
  FittingParamsCauseGeometryToFailError Property
  FittingParamsCauseGeometryToFailWarning Property
  HighlightedElementDisconnected Property
  InappropriateSlopeForPipe Property
  MismatchedSystemClassificationHasSystemWarning Property
  MismatchedSystemClassificationNoSystemWarning Property
  MismatchedSystemTypeWarning Property
  NoAutoRouteSolutionFoundError Property
  NoAutoRouteSolutionFoundWarning Property
  NoFittingInProjectError Property
  NoFittingInProjectWarning Property
  NoFittingInRoutingError Property
  NoFittingLoadedInProjectError Property
  NoSolutionInView Property
  NotAllPartsWereConvertedCannotAddPlaceholderWarning Property
  NotAllPartsWereConvertedPlaceholdersWereAddedWarning Property
  NotEnoughRoomForFittingsError Property
  NotEnoughRoomForFittingsWarning Property
  NoValidSolutionAtSelectedPoint Property
  OverrideFabricationPartFailed Property
  SegmentDrawnFromWrongSideError Property
  SegmentDrawnFromWrongSideWarning Property
  SegmentsAngleTooGreatError Property
  SegmentsAngleTooGreatWarning Property
  SolutionIsOppositeToConnectionError Property
  SolutionIsOppositeToConnectionWarning Property
  SpecifiedAnglesNotCompatibleWithLayoutError Property
  SpecifiedAnglesNotCompatibleWithLayoutWarning Property
  UnableToMakeConnectionInDirection Property
  UtilizationCoefficientOutOfRange Property
  ZeroLengthSegmentError Property
  ZeroLengthSegmentWarning Property
  BuiltInFailures.BeamFailures Class
  BuiltInFailures.BeamFailures Members
  BuiltInFailures.BeamFailures Properties
  CannotBendBeamType Property
  BuiltInFailures.BeamSystemFailures Class
  BuiltInFailures.BeamSystemFailures Members
  BuiltInFailures.BeamSystemFailures Properties
  BeamSystemEdgeBeamTooWide Property
  BeamSystemHasTooManyBeams Property
  BeamSystemTagBadView Property
  BuiltInFailures.BendFailures Class
  BuiltInFailures.BendFailures Members
  BuiltInFailures.BendFailures Properties
  BendAngleIsUnacceptable Property
  DeleteMiddleBendNotAllowed Property
  DeleteSegmentInBankNotAllowed Property
  NotBentControl Property
  NotBentDetailComponent Property
  NotBentFilledRegion Property
  NotBentImage Property
  NotBentImport Property
  NotBentMaskingRegion Property
  NotBentModelLine Property
  NotBentOpening Property
  NotBentRefLine Property
  NotBentRefPlane Property
  NotBentSharedFamily Property
  NotBentSymbol Property
  NotBentSymbolicLine Property
  BuiltInFailures.BlendFailures Class
  BuiltInFailures.BlendFailures Members
  BuiltInFailures.BlendFailures Properties
  CannotDrawBlend Property
  BuiltInFailures.ColorFillFailures Class
  BuiltInFailures.ColorFillFailures Members
  BuiltInFailures.ColorFillFailures Properties
  OnlyOneColorFillNonPlan Property
  SymtemColorFillLegendNotAllowed Property
  BuiltInFailures.ColumnFailures Class
  BuiltInFailures.ColumnFailures Members
  BuiltInFailures.ColumnFailures Properties
  ColumnAndTargetAreConcrete Property
  ColumnBaseAboveTopError Property
  ColumnBaseAboveTopFailure Property
  ColumnJoinNonhitFailure Property
  ColumnTopBelowBaseError Property
  ColumnTopBelowBaseFailure Property
  ColumnZeroHeightError Property
  ColumnZeroHeightFailure Property
  BuiltInFailures.ColumnInsideWallFailures Class
  BuiltInFailures.ColumnInsideWallFailures Members
  BuiltInFailures.ColumnInsideWallFailures Properties
  ColumnInsideWall Property
  CopingWarningExtension Property
  CopingWarningIgnored Property
  CopingWarningMedium Property
  CopingWarningOffset Property
  StartCutShadowJoin Property
  StopCutShadowJoin Property
  BuiltInFailures.ComponentRepeaterFailures Class
  BuiltInFailures.ComponentRepeaterFailures Members
  BuiltInFailures.ComponentRepeaterFailures Properties
  ComponentRepeater_InvalidFamilyOnReload Property
  ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater Property
  BuiltInFailures.ComponentRepeaterSlotFailures Class
  BuiltInFailures.ComponentRepeaterSlotFailures Members
  BuiltInFailures.ComponentRepeaterSlotFailures Properties
  ComponentRepeaterSlot_InvalidFamilyOnReload Property
  BuiltInFailures.ConnectorFailures Class
  BuiltInFailures.ConnectorFailures Members
  BuiltInFailures.ConnectorFailures Properties
  AirTerminalCenterNotAligned Property
  AllElementsRemovedFromCircuitGroup Property
  DisconnectedElements Property
  DuctPipeOpositDirection Property
  ElementAssignedToDefaultSystem Property
  ElementsAreDisconnected Property
  ElementsConnectedToParent Property
  ElementsNeedToBeDisconnected Property
  ExistsForSelectedElement Property
  FittingMustBeOnDuct Property
  FittingMustBeOnDuctWarn Property
  FittingMustBeOnPipe Property
  FittingMustBeOnPipeWarn Property
  InvalidConnectionRef Property
  InvalidConnector Property
  InvalidLoadClassificationValue Property
  InvalidPowerFactorValue Property
  JointGenderMismatch Property
  JointShapeMismatch Property
  JointSizeMismatch Property
  JointTypeMismatch Property
  LayoutConnector Property
  MismatchNoAvailableConnector Property
  MultipleNetwork Property
  NetworkValidityError Property
  NetworkValidityErrorWasDisconnected Property
  NoLossDefined Property
  NoSupportKCoefficientTable Property
  NotAllowedToModifyGroupElementsError Property
  NotAllowedToModifyGroupElementsWarning Property
  OpenConnector Property
  RbsNetworkValidityError Property
  RemoveConnectorLinksWarn Property
  RemoveConnectorLinkWarn Property
  ShapesNotMatch Property
  SizingCalculationFlowOnlyWarn Property
  SizingCalculationNoneWarn Property
  SizingFailed Property
  UnconnectedCircuit Property
  UnconnectedDevice Property
  UndefinedConnector Property
  BuiltInFailures.ConstraintFailures Class
  BuiltInFailures.ConstraintFailures Members
  BuiltInFailures.ConstraintFailures Properties
  UndeletedConstraints Property
  UndeletedConstraintsInGroup Property
  BuiltInFailures.ConversionFailures Class
  BuiltInFailures.ConversionFailures Members
  BuiltInFailures.ConversionFailures Properties
  CannotConvertPercentToDouble Property
  CannotConvertTempToDouble Property
  CannotConvertToDouble Property
  UndefinedFluidUnit Property
  UndefinedTemperatureUnit Property
  BuiltInFailures.CopyMonitorFailures Class
  BuiltInFailures.CopyMonitorFailures Members
  BuiltInFailures.CopyMonitorFailures Properties
  AlreadyCopiedAndStopWatch Property
  AlreadyWatched Property
  CannotCopyCuttingInsert Property
  CannotMoveHostedFixtureViaCopyMonitor Property
  CopyWatchAlert Property
  GridDeletedSameName Property
  LevelDeletedSameName Property
  BuiltInFailures.CopyPasteFailures Class
  BuiltInFailures.CopyPasteFailures Members
  BuiltInFailures.CopyPasteFailures Properties
  CannotCopyAttachedType Property
  CannotCopyAttachedTypeWarn Property
  CannotCopyBetweenFamilyAndProjectCorruption Property
  CannotCopyBetweenFamilyAndProjectError Property
  CannotCopyCurtainWallGridLines Property
  CannotCopyDependentView Property
  CannotCopyDetails Property
  CannotCopyDuplicates Property
  CannotCopyElevationArrow Property
  CannotCopyElevationArrowWarn Property
  CannotCopyFaceHostedMonitoringElements Property
  CannotCopyFaceHostedMonitoringElementsWarn Property
  CannotCopyFamilyName Property
  CannotCopyFromProjectAndLink Property
  CannotCopyGridLines Property
  CannotCopyGridLinesWarn Property
  CannotCopyHostedLoad Property
  CannotCopyImportInstancesAcrossProjects Property
  CannotCopyIncompleteElement Property
  CannotCopyIncompleteElementWarn Property
  CannotCopyJoinedGeometry Property
  CannotCopyJoinedGeometryWarn Property
  CannotCopyLocked Property
  CannotCopyLockedWarn Property
  CannotCopyMassing Property
  CannotCopyMassingWarn Property
  CannotCopyMullions Property
  CannotCopyMullionsError Property
  CannotCopyMullionsWarn Property
  CannotCopyMultipleSketchParents Property
  CannotCopyMustBeUnique Property
  CannotCopyMustBeUniqueViewport Property
  CannotCopyMustBeUniqueViewportWarn Property
  CannotCopyMustBeUniqueWarn Property
  CannotCopyNestedLinks Property
  CannotCopyNoAttachedParent Property
  CannotCopyNoAttachedParentWarn Property
  CannotCopyNoParents Property
  CannotCopyNoReferences Property
  CannotCopyRevolveAxis Property
  CannotCopyRevolveAxisWarn Property
  CannotCopySelectedPick Property
  CannotCopySelection Property
  CannotCopySketchGrid Property
  CannotCopySketchGridWarn Property
  CannotCopySunAndShadowSettings Property
  CannotCopySunAndShadowSettingsWarn Property
  CannotCopyWallPanels Property
  CannotCopyWallPanelsWarn Property
  CannotCopyZone Property
  CannotCopyZoneWarn Property
  CannotDuplicate Property
  CannotDuplicateDesignOption Property
  CannotDuplicateInOption Property
  CannotDuplicateInOptionWarn Property
  CannotDuplicateType Property
  CannotDuplicateWarn Property
  CannotFinalizeClusterInconsistency Property
  CannotFinalizeOrphanSerf Property
  CannotPasteAlignedAny Property
  CannotPasteAlignedCorruption Property
  CannotPasteAlignedError Property
  CannotPasteAlignedSomeLevels Property
  CannotPasteAssemblyView Property
  CannotPasteCircularLinks Property
  CannotPasteCurtainGridLine Property
  CannotPasteDifferentViewSpecificElements Property
  CannotPasteInSketch Property
  CannotPasteInView Property
  CannotPasteInViewError Property
  CannotPasteModelPlusViewSpecificElementsIntoView Property
  CannotPasteNoLevelAbove Property
  CannotPasteNoLevelBelow Property
  CannotPasteNoWorkplane Property
  CannotPasteRoomsInNonPlanViews Property
  CannotPasteToSheet Property
  CannotPasteViewSpecElemsFromDiffViews Property
  CannotTransferProjectStandards Property
  CantCopyBetweenModelAndAnnotFam Property
  CantCopyElemsToInplaceFam Property
  CantCopyFrom2dTo3dFam Property
  CantCopyFrom3dTo2dFam Property
  CantCopyFromDetailToProfileFam Property
  CantCopyLevelsOrRefPlanesToNonMassFamily Property
  CopingColumnBeamFailure Property
  CopyImposterContentError Property
  CopyImposterContentWarn Property
  CopyImposterLightError Property
  CopyImposterLightWarn Property
  ElementRenamedOnPaste Property
  FinalizedElementsWillBeDeleted Property
  FinalizedElementsWillBeDeletedWarn Property
  FinalizedElementsWillBeModified Property
  FinalizedElementsWillBeModifiedWarn Property
  LostReference Property
  NoSketchPlane Property
  PasteInvisibleInView Property
  PasteInvisibleInViewWarn Property
  SomeElementsNotCopiedWarn Property
  BuiltInFailures.CreationFailures Class
  BuiltInFailures.CreationFailures Members
  BuiltInFailures.CreationFailures Properties
  CannotCreateCornice Property
  CannotCreateCorniceError Property
  CannotCreateCorniceIntegral Property
  CannotCreateCorniceIntegralError Property
  CannotCreateCorniceIntegralWarn Property
  CannotCreateCorniceWarn Property
  CannotCreateCurtainGrid Property
  CannotCreateCutout Property
  CannotCreateCutoutError Property
  CannotCreateCutoutWarn Property
  CannotCreateElementInFamily Property
  CannotCreateElementInView Property
  CannotCreateExplicitCrease Property
  CannotCreateFascia Property
  CannotCreateFasciaError Property
  CannotCreateFasciaWarn Property
  CannotCreateGutter Property
  CannotCreateGutterError Property
  CannotCreateGutterWarn Property
  CannotCreateMullion Property
  CannotCreateMullionError Property
  CannotCreateMullionReference Property
  CannotCreateMullionReferenceNoGeometry Property
  CannotCreateNewDesignOption Property
  CannotCreateOldCornerMullion Property
  CannotCreateOpening Property
  CannotCreateOpeningCutOut Property
  CannotCreateOpeningRectangularArcWall Property
  CannotCreateReveal Property
  CannotCreateRevealError Property
  CannotCreateRevealIntegral Property
  CannotCreateRevealIntegralError Property
  CannotCreateRevealIntegralWarn Property
  CannotCreateRevealWarn Property
  CannotCreateSlabEdge Property
  CannotCreateSlabEdgeError Property
  CannotCreateSlabEdgeWarn Property
  CannotCreateSystemPanel Property
  CannotCreateThis Property
  CannotDrawProfileRoof Property
  CannotDrawRoof Property
  CannotDrawRoofError Property
  CannotDrawRoofWall Property
  CannotDrawWalls Property
  CannotDrawWallsError Property
  CannotMakeRoofFromVerticalFace Property
  CannotMakeRoofFromVerticalFaceError Property
  CannotMakeSurface Property
  CannotMakeSurfaceError Property
  CannotMakeSurfaceWarn Property
  CannotMakeWall Property
  CannotUpdateWall Property
  SwitchFromLegendBeforeCreateSimilar Property
  BuiltInFailures.CurtainGridFamilyFailures Class
  BuiltInFailures.CurtainGridFamilyFailures Members
  BuiltInFailures.CurtainGridFamilyFailures Properties
  AllMullionsAreTooShort Property
  CannotCreateCornerMullionDueAngle Property
  CannotCreateCurtainPanelCorruption Property
  CannotCreateCurtainPanelError Property
  CannotCreateCurtainPanelInOpeningCorruption Property
  CannotCreateCurtainPanelInOpeningWarning Property
  CannotGenerateAllNecessaryElements Property
  CannotPlaceSystemMullionFamilyOnCurtainWall Property
  CannotPlaceSystemPanelsInOldArcedCurtainWalls Property
  CornerMullionOverlapsOtherOnePlacedOnNeighboringRegion Property
  CornerMullionsNeighborsMustBeTangent Property
  CurtainPanelNotBelongsToElement Property
  CurtainPanelsParamDefinedTypeDefinedCirculary Property
  CurtainSystemCouldnotReacquireFaces Property
  InvalidCurtainPanelInModel Property
  MullionProfileContainsMoreThanOneOrOpenLoop Property
  NonSystemPanelFamiliesCannotBeUsed Property
  PanelsSlightlyMalformedCorruption Property
  PanelsSlightlyMalformedWarning Property
  SomeMullionsAreTooShort Property
  BuiltInFailures.CurtainWallFailures Class
  BuiltInFailures.CurtainWallFailures Members
  BuiltInFailures.CurtainWallFailures Properties
  AdjustEndCurtainWallParameterNoCorners Property
  AllGridSegmentsRemoved Property
  CannotApplyGridSpecification Property
  CannotDivideCurtainGrid Property
  CannotGroupCurtainGridHost Property
  CannotHaveIndependentOverlappingGrids Property
  CannotPlaceSplitMullions Property
  CannotSplitOldMullions Property
  CannotSwitchToCurtainWall Property
  CannotUseCornerMullion Property
  CurtainGridFaceCannotBeReparamForGridRotation Property
  CurtainGridOffHost Property
  CurtainSystemHostInvisible Property
  DanglingCurtainWallCorner Property
  DeletingCurtainSystemFaceGridLines Property
  DependentGridlineMayBeDeleted Property
  ExceedMaxDrivenGridlines Property
  ExessiveBeltDistance Property
  GridlinesOutOfBounds Property
  GridlinesOutOfBoundsWarn Property
  GridlinesOutsideWillBeRedependent Property
  GridlinesOverlap Property
  GridlinesWerePushed Property
  GridOutOfOrder Property
  GridOutOfOrderError Property
  GridOutsideWall Property
  InvalidSkipSegments Property
  MullionLostRefReorder Property
  MullionsWillBeDeleted Property
  MultipleDominatingMullions Property
  MultipleIdsInCurtainSystem Property
  MustReplacePanels Property
  NegativeBeltDistance Property
  NonSupportedCurtainWall Property
  NoPanelsLoaded Property
  RequestOrphanMullionDeletion Property
  RuledCurtainElementLostCurves Property
  TypePanelsFronNonRectCellsUnlocked Property
  BuiltInFailures.CurveByPointFailures Class
  BuiltInFailures.CurveByPointFailures Members
  BuiltInFailures.CurveByPointFailures Properties
  UnableToGenerateCurve Property
  BuiltInFailures.CurveFailures Class
  BuiltInFailures.CurveFailures Members
  BuiltInFailures.CurveFailures Properties
  CannotFindAreaScheme Property
  CurveNotEditable Property
  CurveNotEditableWarn Property
  InvalidCurveForElement Property
  LineTooShortError Property
  LineTooShortWarning Property
  PeriodicCurveBadParams Property
  SelfIntersectingSpline Property
  TooShort Property
  BuiltInFailures.CutFailures Class
  BuiltInFailures.CutFailures Members
  BuiltInFailures.CutFailures Properties
  CannotCutGeometry Property
  CannotCutGeometryWarn Property
  CannotCutInstanceOut Property
  CannotCutInstanceOutError Property
  CannotCutInstanceOutGen Property
  CannotCutInstanceOutGenError Property
  CannotCutInstanceOutGenWarn Property
  CannotCutInstanceOutWarn Property
  CannotCutJoinedElement Property
  CannotCutRoof Property
  CannotCutRoofError Property
  CantCutHostWithInstance Property
  CutExactlyHalf Property
  CutoutNotCuttingAnything Property
  CutoutNotCuttingAnythingDeleteOpening Property
  DormerCutProblem Property
  DormerCutProblemWarn Property
  HostCutoutForInsertionFailure Property
  InstanceNotCuttingAnything Property
  BuiltInFailures.CutterFailures Class
  BuiltInFailures.CutterFailures Members
  BuiltInFailures.CutterFailures Properties
  MakeCutterForPlanRegionsGStepFailed Property
  MakeCutterForSectionGStepFailed Property
  BuiltInFailures.CuttingFailures Class
  BuiltInFailures.CuttingFailures Members
  BuiltInFailures.CuttingFailures Properties
  CannotCopyFromMultipleLinks Property
  ElementsWithNotCopiedParentsDeleted Property
  NoFileSaved Property
  NoSupported2DElementsToCopyFromView Property
  UnableToCopyElementsFromFile Property
  UnableToPasteToFile Property
  UnableToReplaceWithLink Property
  BuiltInFailures.DatumPlaneFailures Class
  BuiltInFailures.DatumPlaneFailures Members
  BuiltInFailures.DatumPlaneFailures Properties
  ScopeBoxWrongPosition Property
  BuiltInFailures.DebugTabBindingFailures Class
  BuiltInFailures.DebugTabBindingFailures Members
  BuiltInFailures.DebugTabBindingFailures Properties
  OptionValueOutOfRange Property
  BuiltInFailures.DecalFailures Class
  BuiltInFailures.DecalFailures Members
  BuiltInFailures.DecalFailures Properties
  CannotPaste Property
  LongerThanPossible Property
  OutsideHost Property
  BuiltInFailures.DesignOptionFailures Class
  BuiltInFailures.DesignOptionFailures Members
  BuiltInFailures.DesignOptionFailures Properties
  AreaTagLineCannotBeInDesignOption Property
  BadReferenceBetweenOptions Property
  BadReferenceBetweenOptionsWarn Property
  BadReferenceToSecondary Property
  BadReferenceToSecondaryWarn Property
  CannotAddToOptions Property
  CannotAddToOptionsWarn Property
  CannotPutSpaceInOption Property
  CannotPutZoneInOption Property
  ConfusingHostByElementsInAnotherDesignOption Property
  ConfusingHostByElementsInAnotherDesignOptionWarn Property
  ConfusingHostByElementsInDesignOption Property
  ConfusingHostByElementsInDesignOptionWarn Property
  ConfusingHostByElementsInMainModel Property
  ConfusingHostByElementsInMainModelWarn Property
  ConfusingPadByElementsInAnotherDesignOption Property
  ConfusingPadByElementsInAnotherDesignOptionWarn Property
  ConfusingPadByElementsInDesignOption Property
  ConfusingPadByElementsInDesignOptionWarn Property
  ConfusingPadByElementsInMainModel Property
  ConfusingPadByElementsInMainModelWarn Property
  ConfusingSweepByElementsInAnotherDesignOption Property
  ConfusingSweepByElementsInAnotherDesignOptionWarn Property
  ConfusingSweepByElementsInDesignOption Property
  ConfusingSweepByElementsInDesignOptionWarn Property
  ConfusingSweepByElementsInMainModel Property
  ConfusingSweepByElementsInMainModelWarn Property
  DebugLevelsInOptionsError Property
  DebugLevelsInOptionsWarn Property
  ElementsWillBeDeletedNoOption Property
  KingNeverInOption Property
  KingNeverInOptionWarn Property
  MustAddKing Property
  MustAddKingWarn Property
  MustBeInMainModel Property
  NeverInOption Property
  NeverInOptionWarn Property
  NoSelectedInOption Property
  OptionElementsDeleted Property
  SelectionIncludesOptionItems Property
  BuiltInFailures.DetailFailures Class
  BuiltInFailures.DetailFailures Members
  BuiltInFailures.DetailFailures Properties
  EavesAreAligned Property
  NeedsTwoToAlignEaves Property
  RepeatingDetailSpacingZeroError Property
  BuiltInFailures.DimensionFailures Class
  BuiltInFailures.DimensionFailures Members
  BuiltInFailures.DimensionFailures Properties
  AngularDimensionRegenFailed Property
  ArcAlignmentRegenFailed Property
  ArcLengthDimensionNoReferencesOnArc Property
  ArcLengthDimensionReferencesNotIntersect Property
  AssocpropNeedJog Property
  CannotConstrainBasePointAlignments Property
  CannotConstrainBasePointDimensions Property
  CannotCreateDimensionNotParallel Property
  CannotDragWitnessLine Property
  CannotLockThisDimension Property
  CannotToggleDimensionEquality Property
  ChangeDimensionSegmentFailed Property
  ChangeSpotElevationFailed Property
  DimensionOverconstrained Property
  DimensionOverconstrainedError Property
  DimensionOverrideNearByIsLost Property
  DimensionPerpendicularToView Property
  DimensionReferencesInvalid Property
  DimensionUnequaled Property
  DimensionUnlocked Property
  DimensionUnlockedAndUnequaled Property
  EqualityConstraintsUnsatisfied Property
  EqualityConstraintsUnsatisfiedWarn Property
  ForbiddenGroupConstraint Property
  LabelOverconstrained Property
  LinearConstraintBadDirection Property
  LinearConstraintNotParallel Property
  LinearDimensionReferenceNotOrthogonalToView Property
  LockOverconstrained Property
  LockOverconstrainedAlignment Property
  LooseLabeledDimensionRegenFailure Property
  MoreThanOneDimsLabelToOneReportingParameter Property
  NoConstraintsInProperSketch Property
  NoConstraintsToLinks Property
  RadialDimensionCannotProjectToArc Property
  RadialDimensionChangeRadiusFailed Property
  RegenConstraintUnsatisfied Property
  RegenConstraintUnsatisfiedWarn Property
  ReportingParamAlreadyLabelsToAnotherDim Property
  SomeDimensionsLostOnPaste Property
  SomeDimensionsLostWitnessLines Property
  SomeSpotDimensionsLostOnPaste Property
  SpotDimensionFloatingPointError Property
  SpotDimensionFormerSetMoribundCall Property
  SpotDimensionReferencesNoLongerHorizontal Property
  SpotElevationLostEdgeReferences Property
  SpotElevationMissesReference Property
  SpotSlopeReferenceIsVertical Property
  SpotSlopeReferencePointIsSingular Property
  WrongConstraintInGridChainSketch Property
  WrongConstraintInJoistSystemSketch Property
  WrongConstraintInSkeletonSketch Property
  WrongConstraintInTrussSketch Property
  BuiltInFailures.DisplacementElementFailures Class
  BuiltInFailures.DisplacementElementFailures Members
  BuiltInFailures.DisplacementElementFailures Properties
  CannotCopyDisplacementSetIntoOtherDocument Property
  CannotRemoveLastDisplacedElement Property
  DetectedCycleInDisplacedElementParents Property
  ElementsAlreadyDisplacedInView Property
  BuiltInFailures.DividedPathFailures Class
  BuiltInFailures.DividedPathFailures Members
  BuiltInFailures.DividedPathFailures Properties
  DividedPathCannotApplyDivideSettings Property
  DividedPathCannotBeMirroredWithoutItsCurves Property
  DividedPathDistanceTooSmall Property
  DividedPathIndentsOverlap Property
  DividedPathIntersectionPolycurveParamsStepFailed Property
  DividedPathInvalidNumberOfPoints Property
  DividedPathLayoutStepFailed Property
  DividedPathUpdateMergedPointKeysStepFailed Property
  BuiltInFailures.DividedSurfaceFailures Class
  BuiltInFailures.DividedSurfaceFailures Members
  BuiltInFailures.DividedSurfaceFailures Properties
  DividedSurfaceCannotApplyDivideSettings Property
  DividedSurfaceCoincidingSplittingWorkplanes Property
  DividedSurfaceCurveChainBelongsToMultipleBeltIntervals Property
  DividedSurfaceCurveChainBothUandV Property
  DividedSurfaceCurveChainDoesNotEngageUorV Property
  DividedSurfaceCurveChainGeneralProblem Property
  DividedSurfaceCurveChainIntersection Property
  DividedSurfaceCurveChainIsTooClosedToGridlines Property
  DividedSurfaceCurveChainMultipleSeqIntersWithDivLine Property
  DividedSurfaceCurveChainNonSeqIntersWithDivLines Property
  DividedSurfaceCurveChainUnsortableBucket Property
  DividedSurfaceCurveFromChainMultipleIntersWithDivLine Property
  DividedSurfaceCurveLoopChainIntersectedByExtensions Property
  DividedSurfaceCuttingSurfaceDoesNotCutMeshFace Property
  DividedSurfaceCuttingSurfaceGeneralProblem Property
  DividedSurfaceCuttingSurfaceMakesMultipleCuts Property
  DividedSurfaceDidNotRegenerateProperly Property
  DividedSurfaceDiscardedSplittersWarning Property
  DividedSurfaceIgnoresSplitters Property
  DividedSurfaceInvalidSpacing Property
  DividedSurfaceLoopsOfSplittingCurves Property
  DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids Property
  DividedSurfaceSelfIntersectingCurveLoopChain Property
  DividedSurfaceSingleCurveLoopsAsSplitters Property
  DividedSurfaceSingleCurveMultipleIntersBetweenOppositeVirtualGrids Property
  DividedSurfaceSplitManagerProblem1dNonWPCurve Property
  DividedSurfaceSplitManagerProblemClosedArcOrEllipse Property
  DividedSurfaceSplitRefInvisible Property
  DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors Property
  DividedSurfaceSplittingCurvesWithMultipleNeighbors Property
  DividedSurfaceZeroLengthSplittingCurve Property
  MeshTopologicalSortFailed Property
  BuiltInFailures.DocumentFailures Class
  BuiltInFailures.DocumentFailures Members
  BuiltInFailures.DocumentFailures Properties
  ApiDelayedUpdateFailed Property
  CannotAutoUpdate Property
  CannotLoadLink Property
  DUExcessiveRegeneration Property
  DUMisbehavingUpdater Property
  BuiltInFailures.DPartFailures Class
  BuiltInFailures.DPartFailures Members
  BuiltInFailures.DPartFailures Properties
  BindLinkWillDeleteAllPartsWarning Property
  DeletingDPartWillDeleteAllPartsWarning Property
  DeletingDPartWillDeleteMorePartsError Property
  DeletingOriginalWillDeleteParts Property
  DivideVolumesProfilesEdgeMatchForWidthAll Property
  DivideVolumesProfilesEdgeMatchForWidthSome Property
  DivideVolumesProfilesForWidthAll Property
  DivideVolumesProfilesForWidthSome Property
  DivideVolumesProfilesGapForWidthAll Property
  DivideVolumesProfilesGapForWidthSome Property
  DivideVolumesProfilesNonSlabSources Property
  DivideVolumesSketchesWithProfileUnfriendlyCurves Property
  DivisionContainsNoParts Property
  DivisionContainsNoReferences Property
  ElementsAlreadyHaveParts Property
  IneligibleElementsForParts Property
  NoPartMakerCreatedInEditMode Property
  PartPhaseParametersConflictWithOriginal Property
  RemovingInvalidDPartParents Property
  RemovingUndividedDPartParents Property
  SourceInUnloadedLink Property
  BuiltInFailures.DuctFailures Class
  BuiltInFailures.DuctFailures Members
  BuiltInFailures.DuctFailures Properties
  CannotCreateGeometryForDuct Property
  FlexDuctLengthOutOfLimits Property
  NoDuctFittingsInProject Property
  PartNotFoundDueToNoDuctConnectedError Property
  PartNotFoundDueToNoDuctConnectedWarning Property
  BuiltInFailures.EditingFailures Class
  BuiltInFailures.EditingFailures Members
  BuiltInFailures.EditingFailures Properties
  AllInvisibleInPlanViewWarn Property
  AllInvisibleInViewWarn Property
  BorrowElementsAtRisk Property
  CannotBorrowBusyContention Property
  CannotCheckoutWorksets Property
  CannotDeleteEditedElement Property
  CannotDeleteEditedElementError Property
  CannotDeletePredefinedFamilyElement Property
  CannotDrawInCurrentView Property
  CannotDuplicateType Property
  CannotEditDeletedElements Property
  CannotEditDeletedWorkset Property
  CannotEditEditingElements Property
  CannotEditElements Property
  CannotEditRenamedWorkset Property
  CannotMirrorInView Property
  CannotMoveElement Property
  CannotMoveElementWarn Property
  CannotMoveElementWithoutWorkplane Property
  CannotMoveInView Property
  CannotMoveInViewError Property
  CannotMoveLocked Property
  CannotMoveTogether Property
  CannotRotateLocked Property
  CannotScaleInView Property
  DeletedRequestedWarn Property
  DeleteElementsError Property
  DeleteElementsWarn Property
  DeletePreventedByElemArray Property
  DeletePreventedByGroup Property
  ElementNotEditable Property
  ElementReversed Property
  ElementsDeleted Property
  ElementsDeletedPastedToKeep Property
  ElementsNotInPlane Property
  ElementsWillBeDeleted Property
  ExtendToOtherCrash Property
  ExtendToOtherWarn Property
  GeneratedByMassing Property
  HaveNoPermissionToEdit Property
  HiddenBeamsEditingWarning Property
  InvalidArrayObject Property
  InvalidElemsInSelection Property
  LockedDeleted Property
  LockedDeletedWarn Property
  MirrorProjectSuccess Property
  NElementsDeleted Property
  NElementsWrongPosition Property
  NoRotateMirrorZ Property
  NoRotateMirrorZError Property
  OutOfDateElements Property
  OwnedByOther Property
  OwnElementsOutOfDate Property
  PinnedObjectHostDeleted Property
  PinnedObjectNotDeleted Property
  PinnedObjectSomeDeleted Property
  PressShowToSee Property
  ReloadBeforeMakeEditable Property
  ReloadNoGood Property
  SourceInEditMode Property
  TargetInEditMode Property
  TemporaryChangesOutOfDate Property
  TemporaryChangesTransparentPermissions Property
  UnableFilletSpecifiedRadius Property
  UnableToMakeSourceWorksetEditable Property
  UnableToTransformElement Property
  UnableToTransformElementError Property
  WorksetHasChangedInCentralFile Property
  BuiltInFailures.ElectricalFailures Class
  BuiltInFailures.ElectricalFailures Members
  BuiltInFailures.ElectricalFailures Properties
  AddingOtherConnectedMembersToCircuit Property
  AllSlotsOnPanelOccupied Property
  BankDistanceSmallerThanDiameter Property
  CableTrayModified Property
  CannotAssignSecondaryDistSysToCircuit Property
  CannotConnectDifferentDesignOptsObjects Property
  CannotRemoveMembersInCircuitHavingParent Property
  CircuitOverload Property
  ConduitModified Property
  ElementsBelongToOtherCircuit Property
  FamilyMismatchCircuit Property
  InvalidNumwiresSinglephase Property
  InvalidPathOfParallelConduits Property
  MismatchConnectorDistSysToCircuit Property
  MismatchNmbAssignedDistSysToCircuit Property
  MismatchNmbOfPolesToCircuit Property
  MismatchPoleBrakesSlotsNumbers Property
  MismatchVoltageLineToLine Property
  MismatchVoltageToCircuit Property
  MissingOrInvalidWireSizeTable Property
  NoAvailableMatchingConnector Property
  NotAllowedCableTrayConduitRotation Property
  NotEnoughAvailSlotsOnPanel Property
  NotEnoughRoomForParallelConduits Property
  NotEnoughRoomForParallelPipes Property
  NotPositiveBendRadius Property
  NotSupportConcentricBend Property
  ObjsDemolished Property
  PanelMismatchCircuitType Property
  SelectedElementsArePartOfOtherCircuit Property
  SmallBendRadius Property
  UnsignedCircuit Property
  VoltageIsOutOfRange Property
  BuiltInFailures.ElectricityFailures Class
  BuiltInFailures.ElectricityFailures Members
  BuiltInFailures.ElectricityFailures Properties
  FamilyMismatchCircuitDisconnected Property
  BuiltInFailures.ElementFailures Class
  BuiltInFailures.ElementFailures Members
  BuiltInFailures.ElementFailures Properties
  FailedToRemoveElement Property
  NotAllowedToRemoveAllElements Property
  SplitElementHasTagsWithoutLeaders Property
  BuiltInFailures.ElementTypeFailures Class
  BuiltInFailures.ElementTypeFailures Members
  BuiltInFailures.ElementTypeFailures Properties
  NoDefaultType Property
  WarnLastType1 Property
  BuiltInFailures.ElevationFailures Class
  BuiltInFailures.ElevationFailures Members
  BuiltInFailures.ElevationFailures Properties
  ElevationDetach Property
  IncompatibleElevationTagFamily Property
  WarnElevSheet Property
  BuiltInFailures.EnergyAnalysisFailures Class
  BuiltInFailures.EnergyAnalysisFailures Members
  BuiltInFailures.EnergyAnalysisFailures Properties
  ComputeRoomVolumeNotCheckedWarn Property
  ModelWithNoConditionedSpacesWarn Property
  ModelWithNoOccupiedSpacesWarn Property
  NoRoofsRoomBoundingWarn Property
  NoRoofsSpacesBoundingWarn Property
  NoRoomBoundingElements Property
  NoRoomBoundingElementsWarn Property
  NoRoomsWarn Property
  NoSpaceBoundingElements Property
  NoSpaceBoundingElementsWarn Property
  NoSpaces Property
  NoSpacesWarn Property
  PlenumWithNoCeilingWarn Property
  ProblemWithLightingLoadWarn Property
  ProblemWithPeopleLoadWarn Property
  ProblemWithPowerLoadWarn Property
  RoomGeometryCannotFindFreeFacesBoundingElement Property
  RoomGeometryCannotOverlapBoundingElement Property
  RoomGeometryCannotTrimBoundingElement Property
  RoomNotPlacedWarn Property
  RoomNotUpperBoundedByElement Property
  RoomVolumeNegativeWarn Property
  RoomVolumeNotComputedWarn Property
  SpaceResolutionOutOfRange Property
  SurfaceResolutionOutOfRange Property
  UndefinedRooms Property
  UndefinedSpaces Property
  ZoneWithoutSpacesWarn Property
  BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Class
  BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Members
  BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Properties
  AimErrEmptyName Property
  BuiltInFailures.ExportFailures Class
  BuiltInFailures.ExportFailures Members
  BuiltInFailures.ExportFailures Properties
  IFCFatalExportError Property
  IFCFatalToolkitExportError Property
  IFCGenericExportWarning Property
  BuiltInFailures.ExtrusionFailures Class
  BuiltInFailures.ExtrusionFailures Members
  BuiltInFailures.ExtrusionFailures Properties
  CannotDrawExtrusions Property
  CannotDrawExtrusionsError Property
  InvalidExtrusionCurveloop Property
  InvalidExtrusionCurveloopError Property
  BuiltInFailures.FabricAreaFailures Class
  BuiltInFailures.FabricAreaFailures Members
  BuiltInFailures.FabricAreaFailures Properties
  FabricAreaLapSplicesIncorrect Property
  FabricAreaOutSideOfHost Property
  BuiltInFailures.FabricFailures Class
  BuiltInFailures.FabricFailures Members
  BuiltInFailures.FabricFailures Properties
  CannotPlaceFabricArea Property
  CannotPlaceFabricAreaWarn Property
  CannotPlaceFabricSheet Property
  CannotPlaceFabricSheetWarn Property
  CoverOffsetTooLong Property
  CoverOffsetTooLongTemp Property
  FabricAreaWrongHost Property
  FabricAreaWrongLapSplice Property
  FabricAreaWrongSheetAlignment Property
  FabricSheetWrongHost Property
  MajorLapSpliceFailure Property
  MajorOverhangFailure Property
  MajorSpacingFailure Property
  MinorLapSpliceFailure Property
  MinorOverhangFailure Property
  MinorSpacingFailure Property
  NoSurfPatternOnWire Property
  NoWireMaterialDensity Property
  WireDiameterTooLarge Property
  WrongFabricSheetEndOverhang Property
  WrongFabricSheetLayoutPattern Property
  WrongFabricSheetNumberOfWires Property
  WrongFabricSheetOverallLength Property
  WrongFabricSheetSpacing Property
  WrongFabricSheetStartOverhang Property
  BuiltInFailures.FabricSheetFailures Class
  BuiltInFailures.FabricSheetFailures Members
  BuiltInFailures.FabricSheetFailures Properties
  FabricSheetOutSideOfHostError Property
  FabricSheetOutSideOfHostWarning Property
  BuiltInFailures.FaceSplitterFailures Class
  BuiltInFailures.FaceSplitterFailures Members
  BuiltInFailures.FaceSplitterFailures Properties
  CannotUseCurvesForFaceSplit Property
  EndsNotOnEdgeError Property
  InvalidClosedLoopsForFaceSplit Property
  InvalidOpenLoopsForFaceSplit Property
  LoopsDoNotSubdivideFace Property
  LoopsOutsideFaceSplitError Property
  NoFaceForSplit Property
  BuiltInFailures.FamilyFailures Class
  BuiltInFailures.FamilyFailures Members
  BuiltInFailures.FamilyFailures Properties
  CannotAddParameterToFamily Property
  CannotChangeCategory Property
  CannotChangeInstFam Property
  CannotConvertInstHostToWorkPlane Property
  CannotConvertInstWorkPlaneToHost Property
  CannotCopyByPatternFamilies Property
  CannotCopyInplaceFamily Property
  CannotCutRefPlane Property
  CannotFindHost Property
  CannotLoadImperialFamilyToMetricProject Property
  CannotLoadMetricFamilyToImperialProject Property
  CannotMakeType Property
  CannotMakeTypeCB Property
  CannotMakeTypeFamilySaved Property
  CannotPasteLabelsAcrossFamilies Property
  CannotPasteObject Property
  CannotRegenerateCorruptFamily Property
  CannotRotateElement Property
  CannotSetFamilyTypeToNone Property
  CannotUnlockFamilyTemplate Property
  CantCopySelectionToNonStory Property
  CantEditWhileGrouped Property
  CantMirrorInstWoHost Property
  CantMoveFrozenInstance Property
  CantPasteSelection Property
  CantPlaceATOnDuctError Property
  CantPlaceInsertsError Property
  CantPlaceInsertsWarning Property
  CantPlaceInstanceError Property
  CantPlaceInstanceWarning Property
  CantSetSlantedColumnEndPlane Property
  CantSolve Property
  ColumnAlreadyAttachedWillBeReattached Property
  ColumnAndTargetAlreadyJoined Property
  ColumnHeightZeroBecauseOfInvalidOffset Property
  ColumnTooLong Property
  ContainsSharedSameNameFamily Property
  CouldNotGenerateReferencesForFamilyInstance Property
  CouldNotPlaceAdaptiveFamInst Property
  CustomFittingCreated Property
  DeletingBadFamType Property
  DeletingBadFamTypeDumped Property
  DummyHostMustBePerpendicularToXY Property
  DuplicateFamilyParameterNameWithSharedParameter Property
  DuplicateParamName Property
  DuplicateTypeName Property
  ElementTypeParameterized Property
  FailedToBecomeNonParametric Property
  FailedToSetParameters Property
  FailedWhenLoadingFamily Property
  FamilyBadUnattachedVoids Property
  FamilyCannotBeUpgraded Property
  FamilyConnectorDeletedWarning Property
  FamilyDoesntMatchSystemPropertiesDisconnected Property
  FamilyMembersReferToOutsideFamily Property
  FamilyNoExternalParametersCorruption Property
  FamilyNoExternalParametersError Property
  FamilyNoExternalParametersWarning Property
  FamilyNotFitHostShape Property
  FamilyOverconstraint Property
  FamilyOverconstraintCB Property
  FamilyParameterNoExist Property
  FamilyValidationResult Property
  FormulaBasedParameterCannotBeChanged Property
  FormulasFailedForType Property
  FrozenBecauseFaceGone Property
  FrozenBecauseMonitorRelationshipGone Property
  HighlightedElementFamRefsInvalidError Property
  HighlightedElementFamRefsInvalidWarning Property
  InstMayCutMoreOrFewerHosts Property
  InstOutsideFaceBoundary Property
  InvalidContextForAdaptivePlacement Property
  InvalidFormularFoundInParameter Property
  InvalidParameterValue Property
  InvalidSlantedColumnOffsets Property
  NoInstparamFormulas Property
  NonGenericAnnotationsOutsideLegend Property
  NotFamilyFile Property
  ProfileContainsNoLoops Property
  ReferencePlanesOverconstrained Property
  SetbackTooLarge Property
  SharedParameterReplacedByBuiltInOne Property
  SizeLookupTableIsNotAvailableForType Property
  SketchCannotBeAutomaticallyDimensioned Property
  SlantedColumnEndCutPlaneIsParallelToGeometry Property
  SlantedColumnEndPlanesHaveFlipped Property
  StructuralColumnAttachedToNonStructuralTarget Property
  TitleblockBadViewType Property
  TryingToAttachWhenJoined Property
  TypeRecursiveElementIdParameter Property
  UnableGenerateTrussByFamilyAndOrientation Property
  UnexpectedFamilyChangeResultsError Property
  UnexpectedFamilyChangeResultsWarning Property
  ValueOutOfRange Property
  WhileLoadingFamily Property
  WhileLoadingFamilyShared Property
  WhileScanningParametersForType Property
  BuiltInFailures.FilledRegionFailures Class
  BuiltInFailures.FilledRegionFailures Members
  BuiltInFailures.FilledRegionFailures Properties
  BadViewType Property
  CannotDrawFilledRegion Property
  CannotDrawFilledRegionError Property
  BuiltInFailures.FloorFailures Class
  BuiltInFailures.FloorFailures Members
  BuiltInFailures.FloorFailures Properties
  FloorSlopeExceedsThreshold Property
  BuiltInFailures.FluidFailures Class
  BuiltInFailures.FluidFailures Members
  BuiltInFailures.FluidFailures Properties
  UndefinedFluidType Property
  UndefinedFluidUnit Property
  BuiltInFailures.FormFailures Class
  BuiltInFailures.FormFailures Members
  BuiltInFailures.FormFailures Properties
  AddProfileFailure Property
  DissolveNoValidInputs Property
  DissolveUnableToDissolveForm Property
  FormCreationInvalidGeomCombination Property
  FormElemRegenFailure Property
  FormElemRegenFailureError Property
  FormElemRegenSelfIntersection Property
  FormElemRegenSelfIntersectionReorderProfiles Property
  FormElemRegenSelfIntersectionResetConnections Property
  NoSoludGeometryForVoidFormsInMass Property
  OpenProfileMultiSegmentSweepsNotSupported Property
  VoidFormsNotUsed Property
  BuiltInFailures.GeneralFailures Class
  BuiltInFailures.GeneralFailures Members
  BuiltInFailures.GeneralFailures Properties
  CannotFixProblem Property
  CannotSetParameter Property
  CharactersNotAllowed Property
  ContentDocTreeCorruption Property
  ConvertingOldAxisToNormal Property
  CoreElemTestingError Property
  DuplicateValue Property
  EnterValidRealGreaterThan Property
  EnterValueBetween Property
  ErrorInFamilyResolved Property
  ErrorResolved Property
  FailedToOpenFile Property
  FailedToReadLine Property
  FamilySeparationTestingError Property
  GenericCorruption Property
  GenericError Property
  GenericErrorNone Property
  GenericFatalError Property
  GenericNonFatalError Property
  GenericWarning Property
  InaccuracyDetected Property
  InternalProblemsParameter Property
  InvalidInput Property
  InvalidInputWarn Property
  InvalidValue Property
  NameInUse Property
  NameIsEmpty Property
  NameNotUnique Property
  NewElementInvisibleInCurrentView Property
  NoRelatedWarnings Property
  ParameterValueNotInRange Property
  SeriousElementReferenceCorruption Property
  TransactionFailed Property
  TransactionFailedWarn Property
  UnresolvableErrorInFamily Property
  UnspecifiedError Property
  ValueOutOfRange Property
  WarningInFamilyDismissed Property
  BuiltInFailures.GenericFailures Class
  BuiltInFailures.GenericFailures Members
  BuiltInFailures.GenericFailures Properties
  ElementsInInvalidContext Property
  BuiltInFailures.GenericMEPFailures Class
  BuiltInFailures.GenericMEPFailures Members
  BuiltInFailures.GenericMEPFailures Properties
  CapsWereAddedWarning Property
  CapWasAddedWarning Property
  FailedToPlaceCapWarning Property
  FlowConfigMismatch Property
  FlowDirectionMismatch Property
  MaxWidthAndHeightReached Property
  SegmentIsTooShort Property
  SizingFailedZeroFlow Property
  ValidatePHSegmentConnWarning Property
  ValidatePHSegmentLengthWarning Property
  BuiltInFailures.GeometryFailures Class
  BuiltInFailures.GeometryFailures Members
  BuiltInFailures.GeometryFailures Properties
  CannotFindClosest Property
  ConvertFaceRegionsToFacesCrashed Property
  ConvertFaceRegionsToFacesFailed Property
  CurveAndSurfaceDoNotIntersect Property
  CurveDriverError Property
  CurveProjectTooShort Property
  ElementIsTooThin Property
  ElementTooSmall Property
  FailedReplaceCurveElemCurveDriver Property
  FailedUpdateCurveChain Property
  FailToConvertLine Property
  LineArcTangentFailure Property
  OffsetFaceFailed Property
  PolygonSegmentTooShort Property
  SuccessToConvertLine Property
  SymbolicLineInvalidPlane Property
  TooManyFacesEdges Property
  BuiltInFailures.GlobalParameterFailures Class
  BuiltInFailures.GlobalParameterFailures Members
  BuiltInFailures.GlobalParameterFailures Properties
  ElementPropLinkCircularChain Property
  ElementPropLinkCircularChainError Property
  GlobalParamFormulaCircularChain Property
  GlobalParamFormulaCircularChainError Property
  InvalidElementPropToGlobalParamLink Property
  BuiltInFailures.GridChainSketchFailures Class
  BuiltInFailures.GridChainSketchFailures Members
  BuiltInFailures.GridChainSketchFailures Properties
  ClosedLoop Property
  InvalidSketch Property
  MoreThanOneLoop Property
  OverlappingLines Property
  BuiltInFailures.GridFailures Class
  BuiltInFailures.GridFailures Members
  BuiltInFailures.GridFailures Properties
  GridEndSegmentsLengthTooShort Property
  GridInGridChainCannotMirror Property
  GridlineAxisTooClose Property
  GridlineAxisTooFar Property
  BuiltInFailures.GroupFailures Class
  BuiltInFailures.GroupFailures Members
  BuiltInFailures.GroupFailures Properties
  AdditionalElementsRequired Property
  AdditionalElementsRequiredRemove Property
  AllElementsRemovedFromGroup Property
  AtomTouchedNotAllowed Property
  AtomTouchedNotAllowedDelete Property
  AtomViolationWhenMultiPlacedInstances Property
  AtomViolationWhenOnePlaceInstance Property
  AttachedGroupNoMirror Property
  AttachedGroupNoPasteToView Property
  BadProblemWithGroup Property
  BadViewForAttachedGroup Property
  BadViewForAttachedGroupWarn Property
  CannotAddAlreadyMemberToDiffGroup Property
  CannotAddToGroupFormat Property
  CannotAddToGroupFormatWarn Property
  CannotCopyGroup Property
  CannotCreateGroup Property
  CannotCreateGroupWithInvalidReferences Property
  CannotFinishGroupInSketchMode Property
  CannotLinkAnnotationsForSomeViews Property
  CannotPlaceGroup Property
  CannotReloadWithFile Property
  CannotRemoveGroupMemberConstraint Property
  CannotRemoveGroupMemberConstraintWarn Property
  CannotRemoveSubordFromGroup Property
  CannotRemoveSubordFromGroupWarn Property
  CannotSaveGroup Property
  CannotSwapNestedGroups Property
  ChildrenDeletedOnGroupSwap Property
  ChildrenLostOnGroupSwap Property
  DetailsOfNestedGroupsLost Property
  DimensionsOrTagsReferecedRemoved Property
  DimRefsGroupMemberSketch Property
  DontEditNestedGroup Property
  ElementChangedMoreThanAllowed Property
  ExcludedElementsRestoredInLink Property
  FailedToChangeGroupLevelRef Property
  FailedToSetMasterGroupId Property
  FailedToTransformAttachedGroup Property
  GroupAmongstLoadedRenamed Property
  GroupCannotMixBackAndForegroundDetail Property
  GroupCannotSave Property
  GroupCannotSaveWarn Property
  GroupChangeNoPlaceElements Property
  GroupEditModeNoDuplicates Property
  GroupedModelElemHasViewSpecificSubordinates Property
  GroupHadFailedElementsWhileUpdating Property
  GroupPropagationFailedSketch Property
  GroupPropagationFailedUngroup Property
  GroupPropagationUserCancelled Property
  GroupsHasCycle Property
  GroupsHaveDifferentMembers Property
  GroupsNotCompatibleForTypeChange Property
  GroupViewSpecificDiffViews Property
  InvalidGroup Property
  LastCopyOfGroupDeleted Property
  LastGroupMemberExcluded Property
  LinkVisibilityLost Property
  LoadOfGroupAbortedByUser Property
  MembersAlignWarn Property
  MembersExcluded Property
  MembersExcludedWarn Property
  MembersMovedToProjectToMakeConsistent Property
  ModifyingMultiGroups Property
  MoveElemFailed Property
  NoAppropriateGroup Property
  NoDetailGroups Property
  NoModelGroups Property
  NoneOfSelElemsGroupable Property
  NoSwapGroupBeingEdited Property
  NotAGroupFile Property
  NotAllGroupsFullyRestored Property
  PlaceGroupFailed Property
  ProblemRegeneratingInGroupUpdate Property
  ReferencesOutsideGroupAreNotAllowed Property
  RemoveGroupSketchConstraintParent Property
  RemovingElemCannotBeGrouped Property
  RemovingReferencesFromGroupedCurve Property
  RevitUnableToUpadateGroups Property
  SomeGroupInstsBecameEmpty Property
  SomeMembersNotRestored Property
  UnableToBindLink Property
  UnableToBindLinkInstances Property
  UnableToConvertGroupsToLinks Property
  UnableToCreateAttachedGroup Property
  UnableToDetachGroup Property
  UnableToExcludeElems Property
  UnableToGroupElems Property
  UnableToLoadAttachedGroup Property
  UnableToLoadDetailGroup Property
  UnableToLoadGroup Property
  UnableToMaintainExclusions Property
  UnableToMaintainExclusionsWarn Property
  UnableToMoveElemsToProject Property
  UnableToRemapDetails Property
  UnableToReplaceSelectedGroups Property
  UnableToRestoreAllMembersOfGroups Property
  UnableToSaveGroupType Property
  UnableToTransferAttachedGroup Property
  BuiltInFailures.HostObjFailures Class
  BuiltInFailures.HostObjFailures Members
  BuiltInFailures.HostObjFailures Properties
  HostMismatch Property
  ReferencesNulled Property
  BuiltInFailures.HvacFailures Class
  BuiltInFailures.HvacFailures Members
  BuiltInFailures.HvacFailures Properties
  PanelDoesntMatchCircuitPropertiesDisconnected Property
  BuiltInFailures.IlluminationFailures Class
  BuiltInFailures.IlluminationFailures Members
  BuiltInFailures.IlluminationFailures Properties
  IESFileNotFoundWarning Property
  LightingFixtureLumensWarning Property
  RoomCoefficientUtilizationWarning Property
  RoomLightLossFactorWarning Property
  BuiltInFailures.ImageFailures Class
  BuiltInFailures.ImageFailures Members
  BuiltInFailures.ImageFailures Properties
  BadViewType Property
  BuiltInFailures.ImportFailures Class
  BuiltInFailures.ImportFailures Members
  BuiltInFailures.ImportFailures Properties
  BadFaceFoundInDwg Property
  CannotChangeImportSymbol Property
  CannotExplodeElement Property
  CannotImportFile Property
  CannotRelinkWrapper Property
  FailedToSetWorkplane Property
  IFCCantUpdateLinkedFile Property
  IFCGenericImportWarning Property
  IFCGenericRevitImportWarning Property
  ImportModelOutOfRange Property
  ImportModelTooLarge Property
  ImportTooFarAway Property
  ImportTooManyElmentsToExplode Property
  LostAcisObjectsOnImport Property
  SomeObjectsNotExploded Property
  TextNotImported Property
  TooManyPickFaces Property
  WorksetCreatedForLinkWarning Property
  BuiltInFailures.InaccurateFailures Class
  BuiltInFailures.InaccurateFailures Members
  BuiltInFailures.InaccurateFailures Properties
  InaccurateAreaLine Property
  InaccurateBeamOrBrace Property
  InaccurateCurveBasedFamily Property
  InaccurateDriveCurve Property
  InaccurateGrid Property
  InaccurateLevel Property
  InaccurateLine Property
  InaccurateMassingSketchLine Property
  InaccurateRefPlane Property
  InaccurateRoomSeparation Property
  InaccurateSketchLine Property
  InaccurateSpaceSeparation Property
  InaccurateWall Property
  BuiltInFailures.InfillFailures Class
  BuiltInFailures.InfillFailures Members
  BuiltInFailures.InfillFailures Properties
  CannotDeleteInfill Property
  FamilyInstanceIsNotCuttingHost Property
  InfillCannotChangeType Property
  InfillCannotHaveDiffThickness Property
  InfillDifferentPhase Property
  InfillLost Property
  InfillNoSlopeGlazing Property
  InfillNoThicknessCeiling Property
  InfillNoThicknessMultiface Property
  InPlaceFamilyNotCuttingHost Property
  InsertJoinedWall Property
  InsertOverlapsOrOut Property
  MovedInfillToHost Property
  BuiltInFailures.InterferenceFailures Class
  BuiltInFailures.InterferenceFailures Members
  BuiltInFailures.InterferenceFailures Properties
  GeometryWarning Property
  BuiltInFailures.JoinElementsFailures Class
  BuiltInFailures.JoinElementsFailures Members
  BuiltInFailures.JoinElementsFailures Properties
  CannotCope Property
  CannotCutJoinedGeometry Property
  CannotJoinDesignOptions Property
  CannotJoinElements Property
  CannotJoinElementsError Property
  CannotJoinElementsMultiPlaneError Property
  CannotJoinElementsStructural Property
  CannotJoinElementsStructuralError Property
  CannotJoinElementsWarn Property
  CannotJoinRoof Property
  CannotJoinRoofError Property
  CannotKeepJoined Property
  CannotKeepReferenceOfJoinedElement Property
  CannotKeepTrussJoined Property
  CannotKeepWallJoinToRoof Property
  CannotKeepWallJoinToRoofError Property
  ElementWillBeDetachedFromPlane Property
  FootingWillMoveToBottom Property
  JoiningDisjoint Property
  JoiningDisjointWarn Property
  StructGroupMemberWillDetachFromGrid Property
  BuiltInFailures.KeyBasedTreeEntryFailures Class
  BuiltInFailures.KeyBasedTreeEntryFailures Members
  BuiltInFailures.KeyBasedTreeEntryFailures Properties
  BadClassificationCategoryId Property
  BadClassificationLevel Property
  CircularParentage Property
  DuplicateEntry Property
  InvalidClassificationCode Property
  MissingParent Property
  BuiltInFailures.KeyBasedTreeFileFailures Class
  BuiltInFailures.KeyBasedTreeFileFailures Members
  BuiltInFailures.KeyBasedTreeFileFailures Properties
  CannotOpenFileForRead Property
  CannotUnderstandAtLine Property
  BuiltInFailures.KeynoteFailures Class
  BuiltInFailures.KeynoteFailures Members
  BuiltInFailures.KeynoteFailures Properties
  MissKeynoteParameter Property
  MissKeynotingSystem Property
  NotAssociatedKeynoteParameter Property
  BuiltInFailures.KeynoteTagFailures Class
  BuiltInFailures.KeynoteTagFailures Members
  BuiltInFailures.KeynoteTagFailures Properties
  KeynoteOnLinkWithDifferentKeynoteFile Property
  NoKeynoteAssignedToLinkedElement Property
  BuiltInFailures.LegendFailures Class
  BuiltInFailures.LegendFailures Members
  BuiltInFailures.LegendFailures Properties
  LegendComponentBadViewType Property
  LegendComponentNotVisible Property
  BuiltInFailures.LevelFailures Class
  BuiltInFailures.LevelFailures Members
  BuiltInFailures.LevelFailures Properties
  NoLevelsLeft Property
  NoLevelsLeftReloading Property
  StoryAboveDeleted Property
  StoryAboveMoved Property
  StoryAboveNonStoryLevel Property
  BuiltInFailures.LinkFailures Class
  BuiltInFailures.LinkFailures Members
  BuiltInFailures.LinkFailures Properties
  CannotOpenLinkedFileServerFound Property
  CannotOpenLinkedFileServerNotFound Property
  CannotPublishSharedCoordinatesToMirroredNonRevitLinks Property
  CannotReloadFile Property
  CannotUnlinkFile Property
  DataDictionaryDifferentInLink Property
  DeleteLinkSymbolPrompt Property
  LinkedFileOpenInOtherDoc Property
  LinkInstanceNeedsReconcile Property
  ModifyingLinkedFile Property
  MultipleLinks Property
  NoConstraintsToLinks1 Property
  SourceFileDrivenByOtherTarget Property
  WatchedLinkMoved Property
  BuiltInFailures.LoadFailures Class
  BuiltInFailures.LoadFailures Members
  BuiltInFailures.LoadFailures Properties
  CannotMirrorBoundaryCondition Property
  CannotMirrorHostedLoad Property
  CannotMirrorLoad Property
  CannotPlaceBoundaryConditions Property
  CannotPlaceBoundaryConditionsWarn Property
  CannotRotateLoad Property
  HostChangeDisallowsLoadOrBoundaryConditions Property
  LineLoadAllZero Property
  PointLoadAllZero Property
  BuiltInFailures.LooseDimensionFailures Class
  BuiltInFailures.LooseDimensionFailures Members
  BuiltInFailures.LooseDimensionFailures Properties
  LooseCurtainWallData Property
  LooseDimensionsForCurtainWall Property
  LooseFaceSplitsForCurtainWall Property
  LooseInsertsForCurtainWall Property
  LooseWallsweepsForCurtainWall Property
  BuiltInFailures.MassFailures Class
  BuiltInFailures.MassFailures Members
  BuiltInFailures.MassFailures Properties
  AutoGlazingFailed Property
  AutoGlazingFailedError Property
  BooleanUnionFailed Property
  CannotIntegrate Property
  CannotMergeGeometry Property
  CannotMoveMassing Property
  CreateCoreGeometryFailed Property
  DividePerimeterZoneFailed Property
  FaceRegionCreationFailed Property
  FaceSplitFailed Property
  FloorAreaFaceFailed Property
  FloorMightLookWrong Property
  MinSkylightWidthImperial Property
  MinSkylightWidthMetric Property
  MultipleMassing Property
  NoCurtainRoofsInMassing Property
  NonOccupiableMassZone Property
  NoSolidInMass Property
  OpenAndSolidGeometry Property
  OpenGeometryOnly Property
  OverlappingSolids Property
  SketchCurveNotModelable Property
  SplitFacesByGroundPlaneCrashed Property
  SplitFacesByGroundPlaneFailed Property
  SplitOverlappingFacesFailed Property
  TooManyGeometries Property
  UpgradedMassingWarning Property
  BuiltInFailures.MatchlineFailures Class
  BuiltInFailures.MatchlineFailures Members
  BuiltInFailures.MatchlineFailures Properties
  CreationFailed Property
  BuiltInFailures.MechanicalFailures Class
  BuiltInFailures.MechanicalFailures Members
  BuiltInFailures.MechanicalFailures Properties
  InitialEqualFrictionSizingFailed Property
  LiningThicknessIsLargeForDiameter Property
  LiningThicknessIsLargeForHeight Property
  LiningThicknessIsLargeForWidth Property
  PanelDoesntMatchCircuitProperties Property
  TwoPointsSelectedBeforeEdit Property
  BuiltInFailures.MEPCalculationFailures Class
  BuiltInFailures.MEPCalculationFailures Members
  BuiltInFailures.MEPCalculationFailures Properties
  DuctFittingAndAccessoryPressureDropCalculatorNotAvailable Property
  DuctPressureDropCalculatorNotAvailable Property
  PipeFittingAndAccessoryPressureDropCalculatorNotAvailable Property
  PipePressureDropCalculatorNotAvailable Property
  PlumbingFlowCalculatorNotAvailable Property
  BuiltInFailures.MEPFabricationFailures Class
  BuiltInFailures.MEPFabricationFailures Members
  BuiltInFailures.MEPFabricationFailures Properties
  CannotConvertFlexPipeToPart Property
  SizeNotAvailableInFabricationService Property
  BuiltInFailures.MirrorFailures Class
  BuiltInFailures.MirrorFailures Members
  BuiltInFailures.MirrorFailures Properties
  BadMirror Property
  BuiltInFailures.MultiReferenceAnnotationFailures Class
  BuiltInFailures.MultiReferenceAnnotationFailures Members
  BuiltInFailures.MultiReferenceAnnotationFailures Properties
  ElementCategoryChangeInvalidatesMultiReferenceAnnotation Property
  MultiReferenceAnnotationReferenceCategoryForcesDeletion Property
  BuiltInFailures.NumberingFailures Class
  BuiltInFailures.NumberingFailures Members
  BuiltInFailures.NumberingFailures Properties
  SampleNumberingError Property
  BuiltInFailures.OffsetFacesCellLegacyFailures Class
  BuiltInFailures.OffsetFacesCellLegacyFailures Members
  BuiltInFailures.OffsetFacesCellLegacyFailures Properties
  OffsetFaceFailed Property
  BuiltInFailures.OpeningFailures Class
  BuiltInFailures.OpeningFailures Members
  BuiltInFailures.OpeningFailures Properties
  HostForCutHasNoGeometry Property
  HostForCutHasNoGeometryWarn Property
  InvalidComplexCut Property
  OpeningCutAll Property
  OpeningDoesnotCutHost Property
  OpeningDoesnotCutHostDelete Property
  OpeningNegativeHeight Property
  OpeningPartiallyCutsHost Property
  OpeningRectDoesnotCutHost Property
  OpeningRemovesHost Property
  OpenStringerConflictNosing Property
  PropertyNotClosed Property
  BuiltInFailures.OverlapFailures Class
  BuiltInFailures.OverlapFailures Members
  BuiltInFailures.OverlapFailures Properties
  AreaBoundaryLinesOverlap Property
  CurvesOverlap Property
  DivisionSketchOverlap Property
  DuplicateInstances Property
  DuplicatePoints Property
  DuplicateRebar Property
  LevelsOverlap Property
  OverlappingElementsTest Property
  RoomSeparationLinesOverlap Property
  SpaceSeparationLinesOverlap Property
  WallAreaBoundaryOverlap Property
  WallRoomSeparationOverlap Property
  WallsOverlap Property
  WallSpaceSeparationOverlap Property
  BuiltInFailures.ParameterFailures Class
  BuiltInFailures.ParameterFailures Members
  BuiltInFailures.ParameterFailures Properties
  InconsistentSharedParameterDefinitions Property
  BuiltInFailures.PartMakerMethodForFamilyInstanceFailures Class
  BuiltInFailures.PartMakerMethodForFamilyInstanceFailures Members
  BuiltInFailures.PartMakerMethodForFamilyInstanceFailures Properties
  PartsCannotBeCreatedFromInvalidFamInstGeom Property
  BuiltInFailures.PartMakerMethodForMergePartFailures Class
  BuiltInFailures.PartMakerMethodForMergePartFailures Members
  BuiltInFailures.PartMakerMethodForMergePartFailures Properties
  MergedPartHasDisConnectedGeometries Property
  NeedTwoPartsToMerge Property
  PartNotIncludedInMerge Property
  PartsCannotBeMerged Property
  UnableToIncludePartInMerge Property
  BuiltInFailures.PartMakerMethodForWallFailures Class
  BuiltInFailures.PartMakerMethodForWallFailures Members
  BuiltInFailures.PartMakerMethodForWallFailures Properties
  CouldNotAdjustWallPartsAtJoin Property
  CouldNotCreateWallPart Property
  BuiltInFailures.PathFailures Class
  BuiltInFailures.PathFailures Members
  BuiltInFailures.PathFailures Properties
  Path3dRegenError Property
  BuiltInFailures.PerformanceFailures Class
  BuiltInFailures.PerformanceFailures Members
  BuiltInFailures.PerformanceFailures Properties
  ClippingIsDisabled Property
  DisjoinedSolidsInInPlaceFamily Property
  DuplicateInstances Property
  FamilyContainsViewSpecificImports Property
  HostHasTooManyInserts Property
  InteriorCategoriesEnabledInLargeView Property
  LargeFamilyFile Property
  ManyElementInFamily Property
  ManyUnusedNestedFamilies Property
  MultipleLoopsInSketch Property
  TooLargeSketch Property
  TooManyAreaBoundaryLinesFound Property
  TooManyElementsInSketch Property
  UnjoinedRoomSeparationLinesFound Property
  UnusedTypesInTheProject Property
  ViewDetailLevelIsHighInLargeView Property
  WallsOverlap Property
  BuiltInFailures.PipingFailures Class
  BuiltInFailures.PipingFailures Members
  BuiltInFailures.PipingFailures Properties
  CannotCreateGeometryForPipe Property
  CircularLoopInPipeSizing Property
  DuctPipeModified Property
  DuctPipeSizeMismatch Property
  FabFittingFailed Property
  InvalidPipeSize Property
  MaxPipeSizeReached Property
  PartNotFoundDueToNoPipeConnectedError Property
  PartNotFoundDueToNoPipeConnectedWarning Property
  PartNotFoundInRoutingPreferenceError Property
  PartNotFoundInRoutingPreferenceWarning Property
  BuiltInFailures.PlanRegionFailures Class
  BuiltInFailures.PlanRegionFailures Members
  BuiltInFailures.PlanRegionFailures Properties
  DeletedViewRangeLevel Property
  Intersecting Property
  InvalidPlanRegion Property
  InvalidPlanRegionError Property
  Nested Property
  BuiltInFailures.PointFailures Class
  BuiltInFailures.PointFailures Members
  BuiltInFailures.PointFailures Properties
  CannotMakePointHostedByIntersection Property
  CantChangeParamFlip Property
  CantChangeParamMirror Property
  CantChangeParamRotate Property
  EdgeHostedPointToBeUnhosted Property
  HostMeasurementError Property
  HostParameterRangeError Property
  RegenFailure Property
  BuiltInFailures.ProfileFailures Class
  BuiltInFailures.ProfileFailures Members
  BuiltInFailures.ProfileFailures Properties
  SketchNotEmpty Property
  BuiltInFailures.PropertySetElementFailures Class
  BuiltInFailures.PropertySetElementFailures Members
  BuiltInFailures.PropertySetElementFailures Properties
  EmptyPropertySetName Property
  NonStringParameterValue Property
  NonUniquePropertySetName Property
  BuiltInFailures.RebarFailures Class
  BuiltInFailures.RebarFailures Members
  BuiltInFailures.RebarFailures Properties
  BarDiameterTooLarge Property
  BarTypeDoesNotAllowHooksOfCurrentShape Property
  BendDiameterTooLarge Property
  BendDiameterTooSmall Property
  CannotPlaceRebar Property
  CannotPlaceRebarWarn Property
  ChangeUnitsFormatWarn Property
  CoverTooLong Property
  HideAllBarsInRebarSet Property
  HostTopologyChange Property
  IncompleteShape Property
  InvalidRebarHost Property
  InvalidRebarHostFamilyCanHostRebarParam Property
  InvalidRebarHostNonConcrete Property
  InvalidRebarHostNonStructural Property
  InvalidRebarHostWrongCategory Property
  Inverted3dShape Property
  MaxHookExtensionMultiplierWarn Property
  NoRebarSelected Property
  NoSurfPatternOnRebar Property
  OutOfPlaneBendDiameterTooSmall Property
  OutSideOfHost Property
  RebarArrayTooShort Property
  RebarBendRadiusTooBig Property
  RebarBendRadiusTooBigWarn Property
  RebarConstraintWarning Property
  RebarHooksDontMatchShape Property
  RebarIllegalBarType Property
  RebarNoMatchingHooks Property
  RebarShapeFailure Property
  RebarSpacingTooSmall Property
  RebarTooShortImperial Property
  RebarTooShortMetric Property
  SketchDimensionsRemoved Property
  StandardHookBendDiameterTooLarge Property
  StandardHookBendDiameterTooSmall Property
  TooLargeNumberOfBars Property
  TooSmallNumberOfBars Property
  TrySmallerBarType Property
  BuiltInFailures.RebarShapeFailures Class
  BuiltInFailures.RebarShapeFailures Members
  BuiltInFailures.RebarShapeFailures Properties
  CircleMultiPlanarShape Property
  CircleUnbounded Property
  CurveOverconstrained Property
  CurvesCollinear Property
  CurvesUnlooped Property
  CurveUnderconstrained Property
  DepthDimensionNotExisted Property
  DiagonalEdgesAreUnderconstrained Property
  DimensionLoose Property
  DimensionWithCommonLengthUnit Property
  DimensionWithoutParameter Property
  FormulaDrivenDimension Property
  MultiPlanarDepth Property
  MultipleArcsMustOverlap Property
  ParameterValueNotDefined Property
  PlanarMultiPlanarShape Property
  ShapeFailure Property
  WrongDepthDimensionLabel Property
  BuiltInFailures.RebarSystemFailures Class
  BuiltInFailures.RebarSystemFailures Members
  BuiltInFailures.RebarSystemFailures Properties
  AreaReinforcementOutSideOfHost Property
  AreaReinforcementRegenFail Property
  AreaReinforcementsCollision Property
  AreaReinforcementWrongHost Property
  BarsTooCloseNumber Property
  BarsTooCloseSpacing Property
  BarsTooSparseSpacing Property
  CannotPlaceAreaReinforcement Property
  CannotPlaceAreaReinforcementWarn Property
  CannotPlaceAreaReininforcement Property
  CannotPlaceAreaReininforcementWarn Property
  CannotPlacePathReinforcement Property
  CannotPlacePathReinforcementWarn Property
  CannotPlacePathReininforcement Property
  CannotPlacePathReininforcementWarn Property
  DPartReinfDeletedEditDivision Property
  DPartReinforcementDeleted Property
  HostFlagAreaOff Property
  HostFlagAreaOn Property
  HostFlagPathOff Property
  HostFlagPathOn Property
  PathReinforcementWrongHost Property
  RebarSystemOffset Property
  ThinHostFloor Property
  ThinHostFloorError Property
  ThinHostWall Property
  ThinHostWallError Property
  BuiltInFailures.RefPlaneFailures Class
  BuiltInFailures.RefPlaneFailures Members
  BuiltInFailures.RefPlaneFailures Properties
  AlreadyHaveTwoClosurePlanes Property
  BuiltInFailures.RegenFailures Class
  BuiltInFailures.RegenFailures Members
  BuiltInFailures.RegenFailures Properties
  CannotRegenFamily Property
  CircularDependency Property
  CircularDependencyAssocProp Property
  CircularDependencyAssocPropError Property
  CircularDependencyConstraint Property
  CircularDependencyConstraintError Property
  CircularDependencyError Property
  CircularDependencyResolved Property
  CircularDependencySketch Property
  CircularDependencySketchError Property
  CircularDependencyUncut Property
  CircularDependencyUncutError Property
  CircularDependencyWall Property
  CircularDependencyWallError Property
  ForceRegenSketch Property
  GeomStepFailed Property
  GeomStepFailedError Property
  RegenElements Property
  RegeneratedElements Property
  RegenFailure Property
  UserCancelled Property
  UserCancelledError Property
  BuiltInFailures.RenderFailures Class
  BuiltInFailures.RenderFailures Members
  BuiltInFailures.RenderFailures Properties
  LightParametersNotInRange Property
  LightSourceInsideGeometry Property
  ProhibitDeletionLightSource Property
  RenderLibNotInstalledWarn Property
  BuiltInFailures.RevisionCloudFailures Class
  BuiltInFailures.RevisionCloudFailures Members
  BuiltInFailures.RevisionCloudFailures Properties
  ModifyingIssuedRevisionCloudOnUpgrade Property
  ProhibitCreationInIssued Property
  ProhibitModificationOfIssuedRevisionCloud Property
  ProhibitSwitchFromIssuedRevision Property
  ProhibitSwitchToIssuedRevision Property
  BuiltInFailures.RevolutionFailures Class
  BuiltInFailures.RevolutionFailures Members
  BuiltInFailures.RevolutionFailures Properties
  CannotDrawRevolution Property
  ProfileCrossesRevolutionAxis Property
  ProfileNotPlanar Property
  BuiltInFailures.RoofFailures Class
  BuiltInFailures.RoofFailures Members
  BuiltInFailures.RoofFailures Properties
  CurveRoofSkippedLoops Property
  CurveRoofSkippedLoopsError Property
  CurveRoofSkippedLoopsWarn Property
  ExtrudedRoofCutBySketch Property
  HadToAlignEaves Property
  HoleInRoofFailed Property
  InvalidArcSegmentation Property
  JoinedRoofMissesTarget Property
  JoinedRoofMissesTargetError Property
  NoFlatCurtainRoofs Property
  OnlyOneSlopeCurtainRoof Property
  OnlyUpwardFacesUsed Property
  RoofCutoffRemoved Property
  RoofExceedsMaxHeight Property
  RoofMeetsRoofTangentially Property
  RoofMeetsRoofTangentiallyError Property
  RoofSlopeExceedsThreshold Property
  RoofToRefPlanes Property
  RoofToRefPlanesError Property
  UnusedSlopeArrow Property
  UptoHeightTooLow Property
  UserCancelledRoof Property
  WorkplaneShouldBeLevel Property
  BuiltInFailures.RoomFailures Class
  BuiltInFailures.RoomFailures Members
  BuiltInFailures.RoomFailures Properties
  AreaTagBadViewType Property
  AreaUnplaceWarning Property
  CannotMakeRoomsGeometry Property
  ExtensionsOverlapWarning Property
  InvalidReflectivityPercentage Property
  InvisibleRoomBoundElemement Property
  OptionConflictBoundariesVaryMainAddToOptionSet Property
  OptionConflictBoundariesVaryMainSeparate Property
  OptionConflictBoundariesVaryOptionSeparate Property
  OptionConflictInLinkBoundariesVaryMainAddToOptionSet Property
  OptionConflictInLinkBoundariesVaryMainSeparate Property
  OptionConflictInLinkBoundariesVaryOptionSeparate Property
  OptionConflictInLinkRoomOverlapMain Property
  OptionConflictInLinkRoomOverlapOption Property
  OptionConflictRoomOverlapMain Property
  OptionConflictRoomOverlapOption Property
  RoomBaseAboveComputationHeight Property
  RoomBelowCompHeight Property
  RoomBoundaryMisalignment Property
  RoomHeightNegative Property
  RoomLevelElevs Property
  RoomNotEnclosed Property
  RoomNotEnclosedAreas Property
  RoomNotEnclosedRooms Property
  RoomNotEnclosedSpaces Property
  RoomsCreatedAutomatically Property
  RoomsFailed Property
  RoomsInSameRegion Property
  RoomsInSameRegionAreas Property
  RoomsInSameRegionRooms Property
  RoomsInSameRegionSpaces Property
  RoomsOverlapInHeight Property
  RoomsReallyFailed Property
  RoomTagBadViewType Property
  RoomTagDeleted Property
  RoomTagNotInRoom Property
  RoomTagNotInRoomToArea Property
  RoomTagNotInRoomToRoom Property
  RoomTagNotInRoomToSpace Property
  RoomTagVolumeNotComputed Property
  RoomTooShort Property
  RoomUnplaceWarning Property
  ShowRoomBoundingElements Property
  SpaceUnplaceWarning Property
  BuiltInFailures.ScheduleViewFailures Class
  BuiltInFailures.ScheduleViewFailures Members
  BuiltInFailures.ScheduleViewFailures Properties
  BadViewType Property
  CannotResizeColumn Property
  ColumnsExceedSegment Property
  ColumnsExcluded Property
  DuplicateFieldRemovedFromKeySchedule Property
  NoColumnsJoinedToGridLines Property
  NotGridName Property
  PanelScheduleLoadClassInconsistency Property
  PanelScheduleSlotInconsistency Property
  SchedulesCanBePlacedOnSheetsOnly Property
  SegmentsStartIsGreaterThanSegmentsEnd Property
  BuiltInFailures.SculptingFailures Class
  BuiltInFailures.SculptingFailures Members
  BuiltInFailures.SculptingFailures Properties
  FaceSculptEditFailed Property
  FaceSculptingFaceLoss Property
  BuiltInFailures.SectionViewFailures Class
  BuiltInFailures.SectionViewFailures Members
  BuiltInFailures.SectionViewFailures Properties
  ScopeBoxBehindSection Property
  SectionAndScopeBoxNotOrtho Property
  BuiltInFailures.SelectionFailures Class
  BuiltInFailures.SelectionFailures Members
  BuiltInFailures.SelectionFailures Properties
  NoElementSelected Property
  NoValidElementSelected Property
  BuiltInFailures.SheetFailures Class
  BuiltInFailures.SheetFailures Members
  BuiltInFailures.SheetFailures Properties
  SheetNumberDuplicated Property
  SheetNumberEmpty Property
  BuiltInFailures.SiteFailures Class
  BuiltInFailures.SiteFailures Members
  BuiltInFailures.SiteFailures Properties
  BuildingPadNotConnected Property
  BuildingPadOverlap Property
  CannotComputeProperArea Property
  CannotIntersectSiteRegions Property
  CannotMakeSurface Property
  ContourLabelEmpty Property
  EnterValueOrFormula Property
  GradingInSamePhase Property
  NoHostForSubregion Property
  NoHostForSubregionWarn Property
  NoSurfPatternOnSite Property
  NotEnoughPointsInSurface Property
  PointNotInSurface Property
  PointRelativeOutside Property
  PropertyIntersect Property
  RegionPhaseMismatch Property
  ResetToposurfacePhaseCreated Property
  SiteEditPointsClipped Property
  SiteEditPointsInvisible Property
  SiteMergeDisconnected Property
  SitePhasesDontOverlap Property
  SiteRegionOptionConflict Property
  SurfaceSelfIntersection Property
  SurfaceSplit Property
  SurfaceSplitError Property
  SurfaceSplitNoIntersection Property
  SurfaceTriangulationFailed Property
  BuiltInFailures.SiteImportFailures Class
  BuiltInFailures.SiteImportFailures Members
  BuiltInFailures.SiteImportFailures Properties
  BoundaryDetectError Property
  ContoursNoncontours Property
  DifferentEntityTypes Property
  NoPoints Property
  NoViewSpecificSiteImports Property
  SurfaceExists Property
  TooFarAway Property
  TooLarge Property
  TooManyMeshes Property
  UnusedPoints Property
  BuiltInFailures.SketchFailures Class
  BuiltInFailures.SketchFailures Members
  BuiltInFailures.SketchFailures Properties
  AreaLoadNoForce Property
  AxisNotSpecified Property
  BadNosingProfile Property
  BadRailingsProfile Property
  BeamDirectionNotSpecified Property
  BeamDirectionNotSpecifiedError Property
  BuildingPadNoSurface Property
  BuildingPadNoSurfaceError Property
  CannotChangeUserSketchPlane Property
  CannotChangeUserSketchPlaneError Property
  CannotChangeWorkplaneVisibility Property
  CannotComputeRailingsElevation Property
  CannotComputeRailingsElevationError Property
  CannotComputeRailingsElevationWarn Property
  CannotConvertSketch Property
  CannotDrawExtrusionRoof Property
  CannotDrawProfileRoof Property
  CannotGetSketchReferences Property
  CannotHaveArcs Property
  CannotHaveArcsPath3d Property
  CircleMultiPlanarShapeInSketch Property
  ClosedProfileRoof Property
  ConstantHeightNotParallel Property
  ConstantHeightNotParallelError Property
  ContainedInOtherLoops Property
  ConvertSplineToLineFailed Property
  CurveFromPickedFailed Property
  CurveIntersectsCutFace Property
  CurveIntersectsSplitFace Property
  CurveTooShort Property
  DifferentOffsets Property
  ElementsSketchTooLarge Property
  EndsNotOnCutFace Property
  EndsNotOnEdge Property
  FloorCannotAddDirectionCurve Property
  FloorCannotAddDirectionCurveError Property
  FloorDirectionNotSpecified Property
  FloorManyDirectionCurves Property
  InvalidAreaLoadSketch Property
  InvalidAreaLoadSketchError Property
  InvalidCropAreaSketch Property
  InvalidCropAreaSketchRegen Property
  InvalidElevationSketch Property
  InvalidElevationSketchError Property
  InvalidProfile Property
  InvalidProfileError Property
  InvalidRoofCurveloop Property
  InvalidRoofCurveloopError Property
  InvalidRoofCurveloopFailure Property
  InvalidSketch Property
  InvalidSketchError Property
  InvalidSketchForBuildingpad Property
  InvalidSketchForCeiling Property
  InvalidSketchForFloor Property
  InvalidSketchForRoofsoffit Property
  InvalidSketchPath3d Property
  LandingNotEnoughBoundaryCurves Property
  LandingTwoManyLoops Property
  LinesOverlap Property
  LinesOverlapError Property
  LinesOverlapPath3d Property
  LoopIntersect Property
  LoopIntersectError Property
  LoopIntersectPath3d Property
  LoopsOutsideFaceSplit Property
  LoopsOutsideFaceSplitterTooShort Property
  ManyCCWLoops Property
  ManyCCWLoopsError Property
  ManyDirectionCurves Property
  ManyDirectionCurvesError Property
  MoreThanOneAxis Property
  MutipleStairsPathInOneRunFailure Property
  NestedLoops Property
  NoLoops Property
  NoLoopsError Property
  NoLoopsPath3d Property
  NonMonotoneRoof Property
  NoPlane Property
  NotOneCCWLoop Property
  NotOneCurve Property
  NotOneCurveError Property
  NotOneCurvePath3d Property
  NotOneLoop Property
  NotOneLoopPath3d Property
  OpenAreaLoadLoop Property
  OpenAreaLoadLoopError Property
  OpenLoop Property
  OpenLoopError Property
  OpenLoopPath3d Property
  PathCannotBeClosedLoop Property
  PathCannotBeClosedLoopPath3d Property
  PathReinforcementClosedLoop Property
  PathReinforcementEmptySketch Property
  PathReinforcementManyLoops Property
  PlanarMultiPlanarShapeInSketch Property
  RailingDoublyConnected Property
  RailingDoublyConnectedError Property
  RailingNotConnected Property
  RailingNotConnectedError Property
  RebarEmptySketch Property
  RebarEmptySketchError Property
  RebarManyLoops Property
  RebarManyLoopsError Property
  RebarSystemDirectionNotSpecified Property
  RebarSystemDirectionNotSpecifiedError Property
  RunInvalidSketch Property
  RunNotEnoughBoundaryCurves Property
  SculptingCurvesCannotFormClosedLoop Property
  SculptingCurvesCrossAxis Property
  SculptingCurvesTouchAxis Property
  SculptingLoopsOnBothSidesOfAxis Property
  SculptingSingleLineLoopLiesOnAxis Property
  ShortCurveInSketch Property
  ShortCurveInSketchRoof Property
  SiteCannotDrawSurfaceBoundary Property
  SketchedRunInvalidPath Property
  SketchFailurePlanes Property
  SketchingInTheWrongView Property
  SketchingInWrongView Property
  SketchOverconstrained Property
  SketchOverconstrainedError Property
  SketchOverconstrainedWarn Property
  SketchTooLarge Property
  SketchWasDeleted Property
  StairClosedBoundaries Property
  StairClosedBoundariesError Property
  StairNotEnoughBoundaryCurves Property
  StairNotEnoughBoundaryCurvesError Property
  StairNotEnoughRiserCurves Property
  StairNotEnoughRiserCurvesError Property
  StairOnlyOneConnectedBoundary Property
  StairOnlyOneConnectedBoundaryError Property
  StairRiserDoesntIntersectBoundary Property
  StairRiserDoesntIntersectBoundaryError Property
  StairTooManyConnectedBoundaries Property
  StairTooManyConnectedBoundariesError Property
  SubregionNoHostSurf Property
  SuggestMakingFamilyNonParametric Property
  SuspendedSketchWarn Property
  TooFewParamsForSketch Property
  TooManyElementsInSketch Property
  TooManySlopes Property
  TooManySlopesError Property
  TrussClosedReference Property
  TrussCrossingReferences Property
  TrussMissingReference Property
  TrussOverlappingReference Property
  TrussSegmentedReference Property
  TrussShiftedReferences Property
  TrussSwappedReferences Property
  UnsatisfiedSupportAssocProp Property
  UnsatisfiedWallAssocProp Property
  VarSketchFailure Property
  VarSketchInElementFailure Property
  WrongCutBoundaryLoops Property
  WrongFaceSplitterLoopTypesNum Property
  BuiltInFailures.SkylightFailures Class
  BuiltInFailures.SkylightFailures Members
  BuiltInFailures.SkylightFailures Properties
  MinSkylightWidthImperial Property
  MinSkylightWidthMetric Property
  BuiltInFailures.SlabFailures Class
  BuiltInFailures.SlabFailures Members
  BuiltInFailures.SlabFailures Properties
  CantileverValueTooBig Property
  BuiltInFailures.SlabShapeFailures Class
  BuiltInFailures.SlabShapeFailures Members
  BuiltInFailures.SlabShapeFailures Properties
  SlabShapeEditFailed Property
  SlabShapeEditFailedError Property
  SlabShapeFailedNotHorz Property
  SlabShapeFailedNotOnlyLines Property
  SlabShapeFailedTooThin Property
  SlabShapeWarnVerticesDeleted Property
  SlopedInnerEdge Property
  SlopeTailInsideSlopeLine Property
  SlopeZero Property
  BuiltInFailures.SlantedColumnFailures Class
  BuiltInFailures.SlantedColumnFailures Members
  BuiltInFailures.SlantedColumnFailures Properties
  CannotCutParallelToLocationCurve Property
  SlantedColumnCannotCutEnd Property
  SlantedColumnCannotCutEndWarn Property
  BuiltInFailures.SpanDirectionSymbolFailures Class
  BuiltInFailures.SpanDirectionSymbolFailures Members
  BuiltInFailures.SpanDirectionSymbolFailures Properties
  NonPlanView Property
  BuiltInFailures.SplineFailures Class
  BuiltInFailures.SplineFailures Members
  BuiltInFailures.SplineFailures Properties
  CannotCreateSpline Property
  ClosedSpline Property
  BuiltInFailures.StairRampFailures Class
  BuiltInFailures.StairRampFailures Members
  BuiltInFailures.StairRampFailures Properties
  ActualRiserHeightChanged Property
  AntiparallelRampRisers Property
  AntiparallelRampRisersError Property
  ArcRunRadiusTooSmall Property
  ArcRunWidthTooLongFailure Property
  AutomaticLandingConvertedToSketchedLandingWarning Property
  BadBalustersPerTread Property
  BadFillingSpacing Property
  BadRailings Property
  BadRailingsError Property
  BadRailProfile Property
  BadTreadRiserProfile Property
  BalustersTooClose Property
  BalustersTooCloseAbsolute Property
  BalusterUpsideDown Property
  CannotAlignSupportOnPosts Property
  CannotComputeRailElevation Property
  CannotCreateBaluster Property
  CannotCreateBalusterPatterns Property
  CannotCreateCornerBalusters Property
  CannotCreateLandingStringer Property
  CannotCreateMiddleStringer Property
  CannotCreateMonolithicStairs Property
  CannotCreateNosing Property
  CannotCreateOneOrMoreBaluster Property
  CannotCreateOneOrMoreTreads Property
  CannotCreateOpenMiddleStringers Property
  CannotCreateRail Property
  CannotCreateRailGeom Property
  CannotCreateRailWarn Property
  CannotCreateRiser Property
  CannotCreateSideStringer Property
  CannotCreateStringers Property
  CannotDrawStairs Property
  CannotDrawStairsError Property
  CannotEndWithZeroRiser Property
  CannotGenerateFaces Property
  CannotGenerateFacesError Property
  CannotGenerateRamp Property
  CannotGenerateRampError Property
  CannotMakeLanding Property
  CannotOffsetBoundary Property
  CannotOffsetRail Property
  CannotPlaceBalusterOffset Property
  CannotPlaceBalusterPatterns Property
  CannotPlaceRailingOnStringerWarning Property
  ContinuousRailFilletCreationError Property
  ContinuousRailFilletCreationParallel Property
  ContinuousRailFilletCreationWarning Property
  ContinuousRailGometryCreationFailure Property
  ContinuousRailNotContinuous Property
  ContinuousRailSupportPlacementFailure Property
  ContinuousRailTransitionFailure Property
  ExtendBelowBaseGreaterThanLandingBaseElevation Property
  ExtendBelowBaseGreaterThanRunTopElevation Property
  FailToReOrientSketchCurvesFailure Property
  HeightOfRunIsTooSmall Property
  IntermediateLandingHigherThanTopRunFailure Property
  InvalidBalustersPattern Property
  InvalidLocationLineJustificationFailure Property
  InvalidParameters Property
  InvalidRailProfile Property
  InvalidStairsPathFailure Property
  InvalidStartLevel Property
  InvalidStartLevelRamp Property
  LandingDepthIsLessThanRunWidthWarning Property
  LandingHeightUnderStairsBottom Property
  LandingShapeHandleOnPinnedRunFailure Property
  MayUnjoinRailAndSupports Property
  MultistoryLevelBelowTopbottomLevel Property
  MultistoryLevelBelowTopbottomLevelError Property
  MultistoryStairDoesntReach Property
  MultusegmentRampRiser Property
  MultusegmentRampRiserError Property
  NoCurvesInRailing Property
  NoProfileForRail Property
  NoRailingsStringer Property
  NoRisersInPureMonolithicStairs Property
  NoRunsRamp Property
  NoRunsRampError Property
  NotALineRiserRamp Property
  NotALineRiserRampError Property
  NotchThicknessIsLargerThanLandingWarning Property
  NotEnoughRisers Property
  OnlyMonolithicStairs Property
  PartOfRiserLiesOnBoundaryFailure Property
  PathDoesntJoinToBorderRisersFailure Property
  RailCurveTooShort Property
  RailingBadOffset Property
  RailingCurvesNotSplitRamp Property
  RailingCurvesNotSplitStairs Property
  RailingDoublyConnected Property
  RailingNotConnected Property
  RailPathCloseLoopForExtensionWarning Property
  RailProfileLowerThanFilletError Property
  RailProfileLowerThanFilletFailure Property
  RailProfileOpen Property
  RailTypeChangeInconsistancyWarningWithResetBtn Property
  RampDoesntReach Property
  RampDoesntReachOffset Property
  RampLandingNotCreated Property
  RampRunTooComplex Property
  RampStartHigherThanEnd Property
  RiserCurveTooShort Property
  RiserHeightIsTooSmall Property
  RiserIntWithBoundaryMoreThanOnceFailure Property
  RisersAtSameLocation Property
  RiserThicknesssResetToZero Property
  RunBottomHigherThanTopFailure Property
  RunBottomUnderStairsBottomFailure Property
  RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning Property
  RunTopLowerThanBottomFailure Property
  SpiralRunRadiusTooSmallFailure Property
  StairIncompleteFailure Property
  StairsActualRiserHeightGreaterThanMaximumFailure Property
  StairsActualRunWidthLessThanMinimumFailure Property
  StairsActualTreadDepthLessThanMinimumFailure Property
  StairsAutomaticLandingLayoutFailure Property
  StairsAutomaticLandingLayoutWarn Property
  StairsBottomEndExceedsOrNotReachWarning Property
  StairsCannotExtendToFloorStructureLayerWarning Property
  StairsCommonRunGenerateLayoutFailure Property
  StairsComponentJoinFailure Property
  StairsCrossingRisersDisallowedFailure Property
  StairsGenericFailure Property
  StairsGenericTransformFailure Property
  StairsIllegalDesiredNumRisers Property
  StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure Property
  StairsOtherThan2IntsByRiserAndBoundaryFailure Property
  StairsPathPositionResetWarning Property
  StairsRunRunJoinNotAllowedFailure Property
  StairsStartHigherThanEnd Property
  StairsStringerCannotBeCreated Property
  StairsSubElementsNotConnectedWarning Property
  StairsSupportOverlapFailure Property
  StairsSupportTooShort Property
  StairsTopEndExceedsOrNotReachWarning Property
  StairsTopLowerThanBaseFailure Property
  StairStringerCantOffset Property
  StairsWinderGenLayoutFailure Property
  StairsWinderInvalidParamsFailure Property
  StairsZeroDesiredRisers Property
  StringerCurvesNotSplitStairs Property
  StringerCurveTooShort Property
  TooShortCurveDowngradeGeometry Property
  TreadDepthBelowMin Property
  TreadDepthFailsEq Property
  TreadDepthTooBigFailure Property
  TreadFrontProfileInvalid Property
  UnexpectedCurveIntersectionFailure Property
  WinderFilletRadiusTooLargeFailure Property
  WinderFirstLegTooShortOrRunWidthTooGreatFailure Property
  WinderGenericError Property
  WinderLegIsTooShortFailure Property
  WinderLegsAngleTooGreatOrRunWidthTooSmallFailure Property
  WinderLegTooShortOrRunWidthTooGreatFailure Property
  WinderMinWidthTooLargeFailure Property
  WinderMinWidthTooLargeForParallelTreadsFailure Property
  WinderParallelLegsFailure Property
  WinderParallelTreadsNumberFailure Property
  WinderRunCreationFailure Property
  WinderRunInsideMinTreadDepthFailure Property
  WinderRunInsideWalklineOffsetFailure Property
  WinderRunWidthLessThan2TimesMinWidthFailure Property
  WinderRunWidthLessThanWalkLineOffsetFailure Property
  WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure Property
  WinderRunWidthOrMinWidthOrTooShortFailure Property
  WinderSecondLegTooShortOrRunwidthTooGreatFailure Property
  WinderStraightStepsNumberFailure Property
  WinderThirdLegTooShortOrRunWidthTooGreatFailure Property
  WinderTooManyEndParallelTreadsOrRunWidthFailure Property
  WinderTooManyParallelTreadsAtEndFailure Property
  WinderTooManyParallelTreadsAtHeadFailure Property
  WinderTooManyStartParallelTreadsOrRunWidthFailure Property
  BuiltInFailures.StructuralAssetFailures Class
  BuiltInFailures.StructuralAssetFailures Members
  BuiltInFailures.StructuralAssetFailures Properties
  StructuralMaterialAssetInvalid Property
  BuiltInFailures.SweepFailures Class
  BuiltInFailures.SweepFailures Members
  BuiltInFailures.SweepFailures Properties
  CannotDrawSweep Property
  ComplexPathWithComplexProfile Property
  ProfileLoopEmpty Property
  SweepFailed Property
  SweepFailedError Property
  BuiltInFailures.SweptBlendFailures Class
  BuiltInFailures.SweptBlendFailures Members
  BuiltInFailures.SweptBlendFailures Properties
  CannotDrawSweptblend Property
  BuiltInFailures.SystemNavigatorFailures Class
  BuiltInFailures.SystemNavigatorFailures Members
  BuiltInFailures.SystemNavigatorFailures Properties
  CannottFindCorrectTreeNode Property
  MultipleSelectNumberIsWrong Property
  BuiltInFailures.SystemsFailures Class
  BuiltInFailures.SystemsFailures Members
  BuiltInFailures.SystemsFailures Properties
  AddingOtherConnectedMembersToSystem Property
  CreatePartsWithInvalidService Property
  CreatePartsWithInvalidSystem Property
  CreatePartsWithoutDabasebase Property
  DefaultSystemOver50Elems Property
  ElementsBelongToOtherSystem Property
  FamilyDoesntMatchSystemProperties Property
  FamilyDoesntMatchSystemPropertiesWasDisconnected Property
  MismatchSystemType Property
  PastePartsWithInvalidService Property
  SelectedElementsArePartOfOtherSystem Property
  BuiltInFailures.TagFailures Class
  BuiltInFailures.TagFailures Members
  BuiltInFailures.TagFailures Properties
  CannotCopyTag Property
  CannotCopyTagWarn Property
  CannotPasteOrphanTags Property
  CannotPasteOrphanTagsWarn Property
  CannotPasteTag Property
  ElementCategoryChangeInvalidatesTag Property
  ElementCategoryChangeInvalidatesTagUpgrade Property
  MultiCategoryTagFilterParamNotFoundInElement Property
  TagsCannotBePlacedInUnlocked3dViews Property
  BuiltInFailures.TextFailures Class
  BuiltInFailures.TextFailures Members
  BuiltInFailures.TextFailures Properties
  CannotCreateModeltext Property
  ModeltextIsEmpty Property
  BuiltInFailures.TrussFailures Class
  BuiltInFailures.TrussFailures Members
  BuiltInFailures.TrussFailures Properties
  IncorrectWallUsageWithAttachedStruct Property
  InvalidWorkplaneForStructuralFraming Property
  RemoveTrussSketch Property
  TrussBadTransformation Property
  TrussChordUntransformable Property
  TrussDuplicateEngineeringType Property
  TrussInvalidSymbolGeom Property
  TrussIsAttachedTo Property
  TrussLayoutNonSympleTopChord Property
  TrussLayoutOverlapedCurves Property
  TrussNotJoinedWebs Property
  TrussUserDefinedMemberDeleted Property
  TrussUserDefinedMemberNotJoined Property
  BuiltInFailures.ViewFailures Class
  BuiltInFailures.ViewFailures Members
  BuiltInFailures.ViewFailures Properties
  BadViewDirectionSetting Property
  CanNotDeleteLastOpenView Property
  CannotPasteViewReferences Property
  DetailNumberDuplicate Property
  DetailNumberEmpty Property
  InitialViewDeleted Property
  InsertColumnViewError Property
  InsertColumnViewFailure Property
  InsertComponentViewError Property
  InsertComponentViewFailure Property
  InvalidDBviewScopeBox Property
  NewElementInvisibleInCurrentView Property
  NoTargetsForDependentViewPropagation Property
  NothingToApplyError Property
  NothingToApplyWarning Property
  ReloadLatestDeletedLastOpenView Property
  TurnCropRegionOffRemovesViewBreaks Property
  ViewPublishFailed Property
  ZeroLengthViewBreaksRemoved Property
  ZeroLengthViewRegionsRemoved Property
  BuiltInFailures.WallFailures Class
  BuiltInFailures.WallFailures Members
  BuiltInFailures.WallFailures Properties
  CannotChangeSubwall Property
  CannotChangeTypeOfOldCurtainPanel Property
  CannotMaintainKeyReference Property
  CannotMirrorWallPanel Property
  CannotRedoFaceBased Property
  CannotRedoFaceBasedWarn Property
  CannotRedoFaceRoof Property
  CannotSplitJoinHostsInplaceFamilies Property
  CannotSplitVerticallyCompoundWall Property
  CannotToSplitWallPanels Property
  CannotUpdateWallPanel Property
  ChangingWallsweepType Property
  ConstrainedToWall Property
  ConstrainedToWallError Property
  ContFootingCannotJoin Property
  ContFootingRadiusTooSmall Property
  EmbeddedButShouldNotBe Property
  FaceBecameVertical Property
  FaceIsNoGoodForWall Property
  FaceIsNoLongerVertical Property
  FaceWallBadType Property
  FaceWallComplexType Property
  FaceWallFailedToMake Property
  FaceWallMissingFace Property
  FailedConvertWallToPanel Property
  FailedToChangeInstSymbol Property
  FailedToStoreSideFace Property
  InvalidBaseConstraintForLevel Property
  InvalidCompoundStructure Property
  InvalidTargetPosition Property
  InvalidTargetPositionError Property
  InvalidTopConstraintForLevel Property
  LostEditsJoinsRedoFaceBased Property
  ParameterChangeNotAffectingGeometry Property
  RecursionParameterIgnored Property
  RemapConstrainLocationLine Property
  ShorterThanMinWall Property
  ShorterThanMinWallError Property
  ShorterThanMinWallFailure Property
  ShouldAdjustWallParameters Property
  StackedWallNeedsUnjoin Property
  TooShortStackedWall Property
  UnableToCreateWallForPanel Property
  UnableToDeleteWallForPanel Property
  UnjoinOnEditWallChange Property
  VerticalLayerExtensionFailure Property
  VerticalLayerExtensionFailureError Property
  WallCutoutForInsertionFailure Property
  WallLacksCurve Property
  WallNegativeHeight Property
  WallSettingsChanged Property
  BuiltInFailures.WallJoinRoofFailures Class
  BuiltInFailures.WallJoinRoofFailures Members
  BuiltInFailures.WallJoinRoofFailures Properties
  NoFromRoofForWall Property
  NotCoveredAtAllByTarget Property
  NoUptoRoofForWall Property
  WallMeetsRoofTangentially Property
  WallNotCoveredByRoof Property
  BuiltInFailures.WorksharingFailures Class
  BuiltInFailures.WorksharingFailures Members
  BuiltInFailures.WorksharingFailures Properties
  DuplicateNamesChanged Property
  MissingUpdaterLatestOrCentralPlural Property
  MissingUpdaterLatestOrCentralSingular Property
  SeriousElementReferenceCorruption Property
  BuiltInParameter Enumeration
  BuiltInParameterGroup Enumeration
  CADExportOptions Class
  CADExportOptions Members
  CADExportOptions Methods
  CADLinkType Class
  CADLinkType Members
  CADLinkType Methods
  CADLinkType Properties
  Parameter Property
  CameraInfo Class
  CameraInfo Members
  CameraInfo Methods
  Dispose Method
  CameraInfo Properties
  FarDistance Property
  HorizontalExtent Property
  IsPespective Property
  IsValidObject Property
  NearDistance Property
  RightOffset Property
  TargetDistance Property
  UpOffset Property
  VerticalExtent Property
  Categories Class
  Categories Members
  Categories Methods
  Contains Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  NewSubcategory Method
  ReverseIterator Method
  Categories Properties
  IsEmpty Property
  Item Property
  Item Property (String)
  Item Property (BuiltInCategory)
  Size Property
  Category Class
  Category Members
  Category Methods
  GetGraphicsStyle Method
  GetHashCode Method
  GetLineWeight Method
  SetLineWeight Method
  Category Properties
  AllowsBoundParameters Property
  AllowsVisibilityControl Property
  CanAddSubcategory Property
  CategoryType Property
  HasMaterialQuantities Property
  Id Property
  IsCuttable Property
  IsTagCategory Property
  LineColor Property
  Material Property
  Name Property
  Parent Property
  SubCategories Property
  Visible Property
  CategoryNameMap Class
  CategoryNameMap Members
  CategoryNameMap Constructor
  CategoryNameMap Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CategoryNameMap Properties
  IsEmpty Property
  Item Property
  Size Property
  CategoryNameMapIterator Class
  CategoryNameMapIterator Members
  CategoryNameMapIterator Constructor
  CategoryNameMapIterator Methods
  MoveNext Method
  Reset Method
  CategoryNameMapIterator Properties
  Current Property
  Key Property
  CategorySet Class
  CategorySet Members
  CategorySet Constructor
  CategorySet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CategorySet Properties
  IsEmpty Property
  Size Property
  CategorySetIterator Class
  CategorySetIterator Members
  CategorySetIterator Constructor
  CategorySetIterator Methods
  MoveNext Method
  Reset Method
  CategorySetIterator Properties
  Current Property
  CategoryType Enumeration
  Ceiling Class
  Ceiling Members
  Ceiling Methods
  Ceiling Properties
  Parameter Property
  CeilingAndFloor Class
  CeilingAndFloor Members
  CeilingAndFloor Methods
  CeilingAndFloor Properties
  Parameter Property
  CeilingType Class
  CeilingType Members
  CeilingType Methods
  CeilingType Properties
  Parameter Property
  ThermalProperties Property
  CellType Enumeration
  ChangePriority Enumeration
  ChangeType Class
  ChangeType Members
  ChangeType Methods
  ConcatenateChangeTypes Method
  Contains Method
  Dispose Method
  IsIdentical Method
  ChangeType Properties
  IsValidObject Property
  CheckoutStatus Enumeration
  City Class
  City Members
  City Methods
  City Properties
  Latitude Property
  Longitude Property
  Name Property
  TimeZone Property
  WeatherStation Property
  CitySet Class
  CitySet Members
  CitySet Constructor
  CitySet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CitySet Properties
  IsEmpty Property
  Size Property
  CitySetIterator Class
  CitySetIterator Members
  CitySetIterator Constructor
  CitySetIterator Methods
  MoveNext Method
  Reset Method
  CitySetIterator Properties
  Current Property
  ClassificationEntries Class
  ClassificationEntries Members
  ClassificationEntries Methods
  LoadClassificationEntriesFromFile Method
  ClassificationEntries Properties
  ClassificationEntry Class
  ClassificationEntry Members
  ClassificationEntry Constructor
  ClassificationEntry Methods
  HasBadCategoryId Method
  HasBadLevel Method
  HasInvalidKey Method
  ClassificationEntry Properties
  CategoryId Property
  Description Property
  Level Property
  Color Class
  Color Members
  Color Constructor
  Color Methods
  Color Properties
  Blue Property
  Green Property
  InvalidColorValue Property
  IsValid Property
  Red Property
  ColorBackgroundSettings Class
  ColorBackgroundSettings Members
  ColorBackgroundSettings Methods
  ColorBackgroundSettings Properties
  Color Property
  ColorDepthType Enumeration
  ColumnAttachment Class
  ColumnAttachment Members
  ColumnAttachment Methods
  AddColumnAttachment Method
  Dispose Method
  GetColumnAttachment Method
  GetColumnAttachment Method (FamilyInstance, ElementId)
  GetColumnAttachment Method (FamilyInstance, Int32)
  IsValidColumn Method
  IsValidTarget Method
  IsValidTarget Method (Boolean, Element)
  IsValidTarget Method (FamilyInstance, Element)
  RemoveColumnAttachment Method
  RemoveColumnAttachment Method (FamilyInstance, ElementId)
  RemoveColumnAttachment Method (FamilyInstance, Int32)
  SetJustification Method
  ColumnAttachment Properties
  AttachOffset Property
  BaseOrTop Property
  CutStyle Property
  IsValidObject Property
  Justification Property
  TargetId Property
  ColumnAttachmentCutStyle Enumeration
  ColumnAttachmentJustification Enumeration
  CombinableElement Class
  CombinableElement Members
  CombinableElement Methods
  CombinableElement Properties
  Combinations Property
  Parameter Property
  CombinableElementArray Class
  CombinableElementArray Members
  CombinableElementArray Constructor
  CombinableElementArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CombinableElementArray Properties
  IsEmpty Property
  Item Property
  Size Property
  CombinableElementArrayIterator Class
  CombinableElementArrayIterator Members
  CombinableElementArrayIterator Constructor
  CombinableElementArrayIterator Methods
  MoveNext Method
  Reset Method
  CombinableElementArrayIterator Properties
  Current Property
  ComponentRepeater Class
  ComponentRepeater Members
  ComponentRepeater Methods
  GetBasicIEnumerator Method
  GetEnumerator Method
  IsTypeValidForRepeater Method
  RepeatElements Method
  ComponentRepeater Properties
  DefaultFamilyType Property
  DimensionCount Property
  Parameter Property
  ComponentRepeaterIterator Class
  ComponentRepeaterIterator Members
  ComponentRepeaterIterator Methods
  Dispose Method
  GetCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  ComponentRepeaterIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  ComponentRepeaterSlot Class
  ComponentRepeaterSlot Members
  ComponentRepeaterSlot Methods
  IsTypeValidForSlot Method
  MakeDefault Method
  MakeEmpty Method
  ComponentRepeaterSlot Properties
  FamilyType Property
  IsDefault Property
  IsEmpty Property
  Parameter Property
  ComponentRotation Enumeration
  CompoundStructure Class
  CompoundStructure Members
  CompoundStructure Methods
  AddWallSweep Method
  AssociateRegionWithLayer Method
  CanLayerWidthBeNonZero Method
  ChangeRegionWidth Method
  ClearWallSweeps Method
  CreateSimpleCompoundStructure Method
  CreateSingleLayerCompoundStructure Method
  CreateSingleLayerCompoundStructure Method (MaterialFunctionAssignment, Double, ElementId)
  CreateSingleLayerCompoundStructure Method (Double, MaterialFunctionAssignment, Double, ElementId)
  DeleteLayer Method
  Dispose Method
  FindEnclosingRegionAndSegments Method
  GetAdjacentRegions Method
  GetCoreBoundaryLayerIndex Method
  GetDeckEmbeddingType Method
  GetDeckProfileId Method
  GetExtendableRegionIds Method
  GetFirstCoreLayerIndex Method
  GetLastCoreLayerIndex Method
  GetLayerAssociatedToRegion Method
  GetLayerFunction Method
  GetLayers Method
  GetLayerWidth Method
  GetMaterialId Method
  GetMinimumLayerThickness Method
  GetNumberOfShellLayers Method
  GetOffsetForLocationLine Method
  GetPreviousNonZeroLayerIndex Method
  GetRegionEnvelope Method
  GetRegionIds Method
  GetRegionsAlongLevel Method
  GetRegionsAssociatedToLayer Method
  GetSegmentCoordinate Method
  GetSegmentEndPoints Method
  GetSegmentIds Method
  GetSegmentOrientation Method
  GetSimpleCompoundStructure Method
  GetWallSweepsInfo Method
  GetWidth Method
  GetWidth Method
  GetWidth Method (Int32)
  IsCoreLayer Method
  IsEqual Method
  IsLayerValid Method
  IsRectangularRegion Method
  IsSimpleRegion Method
  IsStructuralDeck Method
  IsValid Method
  IsValidRegionId Method
  IsValidSampleHeight Method
  IsValidSegmentId Method
  IsVerticallyHomogeneous Method
  MergeRegionsAdjacentToSegment Method
  ParticipatesInWrapping Method
  RemoveWallSweep Method
  SetDeckEmbeddingType Method
  SetDeckProfileId Method
  SetExtendableRegionIds Method
  SetLayer Method
  SetLayerFunction Method
  SetLayers Method
  SetLayerWidth Method
  SetMaterialId Method
  SetNumberOfShellLayers Method
  SetParticipatesInWrapping Method
  SplitRegion Method
  SplitRegion Method (UV, RectangularGridSegmentOrientation)
  SplitRegion Method (UV, RectangularGridSegmentOrientation, Int32)
  CompoundStructure Properties
  CutoffHeight Property
  EndCap Property
  HasStructuralDeck Property
  IsEmpty Property
  IsValidObject Property
  IsVerticallyCompound Property
  LayerCount Property
  MinimumSampleHeight Property
  OpeningWrapping Property
  SampleHeight Property
  StructuralMaterialIndex Property
  VariableLayerIndex Property
  CompoundStructureDeckUsage Enumeration
  CompoundStructureError Enumeration
  CompoundStructureLayer Class
  CompoundStructureLayer Members
  CompoundStructureLayer Constructor
  CompoundStructureLayer Constructor
  CompoundStructureLayer Constructor (CompoundStructureLayer)
  CompoundStructureLayer Constructor (Double, MaterialFunctionAssignment, ElementId)
  CompoundStructureLayer Methods
  Dispose Method
  CompoundStructureLayer Properties
  DeckEmbeddingType Property
  DeckProfileId Property
  Function Property
  IsValidObject Property
  LayerCapFlag Property
  LayerId Property
  MaterialId Property
  Width Property
  CompoundStructureLayerFunction Enumeration
  ConicalFace Class
  ConicalFace Members
  ConicalFace Methods
  Intersect Method
  IsInside Method
  Triangulate Method
  ConicalFace Properties
  Axis Property
  HalfAngle Property
  Origin Property
  Radius Property
  Connector Class
  Connector Members
  Connector Methods
  ConnectTo Method
  DisconnectFrom Method
  Dispose Method
  IsConnectedTo Method
  Connector Properties
  AllowsSlopeAdjustments Property
  AllRefs Property
  Angle Property
  AssignedDuctFlowConfiguration Property
  AssignedDuctLossMethod Property
  AssignedFixtureUnits Property
  AssignedFlow Property
  AssignedFlowDirection Property
  AssignedFlowFactor Property
  AssignedKCoefficient Property
  AssignedLossCoefficient Property
  AssignedPipeFlowConfiguration Property
  AssignedPipeLossMethod Property
  AssignedPressureDrop Property
  Coefficient Property
  ConnectorManager Property
  ConnectorType Property
  CoordinateSystem Property
  Demand Property
  Description Property
  Direction Property
  Domain Property
  DuctSystemType Property
  ElectricalSystemType Property
  EngagementLength Property
  Flow Property
  Height Property
  IsConnected Property
  IsMovable Property
  IsValidObject Property
  MEPSystem Property
  Origin Property
  Owner Property
  PipeSystemType Property
  PressureDrop Property
  Radius Property
  Shape Property
  Utility Property
  VelocityPressure Property
  Width Property
  ConnectorDomainType Enumeration
  ConnectorElement Class
  ConnectorElement Members
  ConnectorElement Methods
  AssignAsPrimary Method
  CreateCableTrayConnector Method
  CreateCableTrayConnector Method (Document, Reference)
  CreateCableTrayConnector Method (Document, Reference, Edge)
  CreateConduitConnector Method
  CreateConduitConnector Method (Document, Reference)
  CreateConduitConnector Method (Document, Reference, Edge)
  CreateDuctConnector Method
  CreateDuctConnector Method (Document, DuctSystemType, ConnectorProfileType, Reference)
  CreateDuctConnector Method (Document, DuctSystemType, ConnectorProfileType, Reference, Edge)
  CreateElectricalConnector Method
  CreateElectricalConnector Method (Document, ElectricalSystemType, Reference)
  CreateElectricalConnector Method (Document, ElectricalSystemType, Reference, Edge)
  CreatePipeConnector Method
  CreatePipeConnector Method (Document, PipeSystemType, Reference)
  CreatePipeConnector Method (Document, PipeSystemType, Reference, Edge)
  FlipDirection Method
  GetLinkedConnectorElement Method
  IsSystemClassificationValid Method
  SetLinkedConnectorElement Method
  ConnectorElement Properties
  CoordinateSystem Property
  Direction Property
  Domain Property
  Height Property
  IsPrimary Property
  Origin Property
  Parameter Property
  Radius Property
  Shape Property
  SystemClassification Property
  Width Property
  ConnectorGenderType Enumeration
  ConnectorJointType Enumeration
  ConnectorManager Class
  ConnectorManager Members
  ConnectorManager Methods
  Dispose Method
  ConnectorManager Properties
  Connectors Property
  IsValidObject Property
  Owner Property
  UnusedConnectors Property
  ConnectorProfileType Enumeration
  ConnectorSet Class
  ConnectorSet Members
  ConnectorSet Constructor
  ConnectorSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ConnectorSet Properties
  IsEmpty Property
  Size Property
  ConnectorSetIterator Class
  ConnectorSetIterator Members
  ConnectorSetIterator Constructor
  ConnectorSetIterator Methods
  MoveNext Method
  Reset Method
  ConnectorSetIterator Properties
  Current Property
  ConnectorType Enumeration
  Construction Class
  Construction Members
  Construction Methods
  Construction Properties
  Id Property
  Name Property
  ContentNode Class
  ContentNode Members
  ContentNode Methods
  GetAsset Method
  GetTransform Method
  ContentNode Properties
  ContFooting Class
  ContFooting Members
  ContFooting Methods
  ContFooting Properties
  FootingType Property
  Parameter Property
  ContFootingType Class
  ContFootingType Members
  ContFootingType Methods
  ContFootingType Properties
  Parameter Property
  ContFootingTypeSet Class
  ContFootingTypeSet Members
  ContFootingTypeSet Constructor
  ContFootingTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ContFootingTypeSet Properties
  IsEmpty Property
  Size Property
  ContFootingTypeSetIterator Class
  ContFootingTypeSetIterator Members
  ContFootingTypeSetIterator Constructor
  ContFootingTypeSetIterator Methods
  MoveNext Method
  Reset Method
  ContFootingTypeSetIterator Properties
  Current Property
  Control Class
  Control Members
  Control Methods
  Control Properties
  Origin Property
  Parameter Property
  Shape Property
  View Property
  ControlShape Enumeration
  CoordinatePlaneVisibility Enumeration
  CopyPasteOptions Class
  CopyPasteOptions Members
  CopyPasteOptions Constructor
  CopyPasteOptions Methods
  Dispose Method
  GetDuplicateTypeNamesHandler Method
  SetDuplicateTypeNamesHandler Method
  CopyPasteOptions Properties
  IsValidObject Property
  CurtainCell Class
  CurtainCell Members
  CurtainCell Methods
  CurtainCell Properties
  CurveLoops Property
  PlanarizedCurveLoops Property
  CurtainGrid Class
  CurtainGrid Members
  CurtainGrid Methods
  AddGridLine Method
  ChangePanelType Method
  GetCell Method
  GetCurtainCells Method
  GetMullionIds Method
  GetPanel Method
  GetPanelIds Method
  GetUGridLineIds Method
  GetUnlockedMullionIds Method
  GetUnlockedPanelIds Method
  GetVGridLineIds Method
  CurtainGrid Properties
  Grid1Angle Property
  Grid1Justification Property
  Grid1Offset Property
  Grid2Angle Property
  Grid2Justification Property
  Grid2Offset Property
  NumPanels Property
  NumULines Property
  NumVLines Property
  CurtainGridAlignType Enumeration
  CurtainGridLine Class
  CurtainGridLine Members
  CurtainGridLine Methods
  AddAllSegments Method
  AddMullions Method
  AddSegment Method
  Move Method
  RemoveSegment Method
  CurtainGridLine Properties
  AllSegmentCurves Property
  ExistingSegmentCurves Property
  FullCurve Property
  IsUGridLine Property
  Lock Property
  Parameter Property
  SkippedSegmentCurves Property
  CurtainGridSet Class
  CurtainGridSet Members
  CurtainGridSet Constructor
  CurtainGridSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CurtainGridSet Properties
  IsEmpty Property
  Size Property
  CurtainGridSetIterator Class
  CurtainGridSetIterator Members
  CurtainGridSetIterator Constructor
  CurtainGridSetIterator Methods
  MoveNext Method
  Reset Method
  CurtainGridSetIterator Properties
  Current Property
  CurtainSystem Class
  CurtainSystem Members
  CurtainSystem Methods
  AddCurtainGrid Method
  RemoveCurtainGrid Method
  CurtainSystem Properties
  CurtainGrids Property
  CurtainSystemType Property
  Parameter Property
  CurtainSystemBase Class
  CurtainSystemBase Members
  CurtainSystemBase Methods
  CurtainSystemBase Properties
  Parameter Property
  CurtainSystemType Class
  CurtainSystemType Members
  CurtainSystemType Methods
  CurtainSystemType Properties
  Parameter Property
  CurtainSystemTypeSet Class
  CurtainSystemTypeSet Members
  CurtainSystemTypeSet Constructor
  CurtainSystemTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CurtainSystemTypeSet Properties
  IsEmpty Property
  Size Property
  CurtainSystemTypeSetIterator Class
  CurtainSystemTypeSetIterator Members
  CurtainSystemTypeSetIterator Constructor
  CurtainSystemTypeSetIterator Methods
  MoveNext Method
  Reset Method
  CurtainSystemTypeSetIterator Properties
  Current Property
  Curve Class
  Curve Members
  Curve Methods
  Clone Method
  ComputeDerivatives Method
  ComputeNormalizedParameter Method
  ComputeRawParameter Method
  CreateOffset Method
  CreateReversed Method
  CreateTransformed Method
  Distance Method
  Evaluate Method
  GetEndParameter Method
  GetEndPoint Method
  GetEndPointReference Method
  Intersect Method
  Intersect Method (Curve)
  Intersect Method (Curve, IntersectionResultArray)
  IsInside Method
  IsInside Method (Double)
  IsInside Method (Double, Int32)
  MakeBound Method
  MakeUnbound Method
  Project Method
  Tessellate Method
  Curve Properties
  ApproximateLength Property
  IsBound Property
  IsCyclic Property
  Length Property
  Period Property
  Reference Property
  CurveArrArray Class
  CurveArrArray Members
  CurveArrArray Constructor
  CurveArrArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CurveArrArray Properties
  IsEmpty Property
  Item Property
  Size Property
  CurveArrArrayIterator Class
  CurveArrArrayIterator Members
  CurveArrArrayIterator Constructor
  CurveArrArrayIterator Methods
  MoveNext Method
  Reset Method
  CurveArrArrayIterator Properties
  Current Property
  CurveArray Class
  CurveArray Members
  CurveArray Constructor
  CurveArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CurveArray Properties
  IsEmpty Property
  Item Property
  Size Property
  CurveArrayIterator Class
  CurveArrayIterator Members
  CurveArrayIterator Constructor
  CurveArrayIterator Methods
  MoveNext Method
  Reset Method
  CurveArrayIterator Properties
  Current Property
  CurveByPoints Class
  CurveByPoints Members
  CurveByPoints Methods
  GetPoints Method
  GetVisibility Method
  SetPoints Method
  SetVisibility Method
  SortPoints Method
  CurveByPoints Properties
  IsReferenceLine Property
  Parameter Property
  ReferenceType Property
  SketchPlane Property
  Subcategory Property
  Visible Property
  CurveByPointsArray Class
  CurveByPointsArray Members
  CurveByPointsArray Constructor
  CurveByPointsArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CurveByPointsArray Properties
  IsEmpty Property
  Item Property
  Size Property
  CurveByPointsArrayIterator Class
  CurveByPointsArrayIterator Members
  CurveByPointsArrayIterator Constructor
  CurveByPointsArrayIterator Methods
  MoveNext Method
  Reset Method
  CurveByPointsArrayIterator Properties
  Current Property
  CurveByPointsUtils Class
  CurveByPointsUtils Members
  CurveByPointsUtils Methods
  AddCurvesToFaceRegion Method
  CreateArcThroughPoints Method
  CreateRectangle Method
  Dispose Method
  GetFaceRegions Method
  GetHostFace Method
  GetProjectionType Method
  GetSketchOnSurface Method
  SetProjectionType Method
  SetSketchOnSurface Method
  ValidateCurveElementIdArrayForFaceRegions Method
  CurveByPointsUtils Properties
  IsValidObject Property
  CurveElement Class
  CurveElement Members
  CurveElement Methods
  GetLineStyleIds Method
  SetGeometryCurve Method
  SetSketchPlaneAndCurve Method
  CurveElement Properties
  CenterPointReference Property
  CurveElementType Property
  GeometryCurve Property
  LineStyle Property
  Parameter Property
  SketchPlane Property
  CurveElementFilter Class
  CurveElementFilter Members
  CurveElementFilter Constructor
  CurveElementFilter Constructor (CurveElementType)
  CurveElementFilter Constructor (CurveElementType, Boolean)
  CurveElementFilter Methods
  PassesFilter Method
  CurveElementFilter Properties
  CurveElementType Property
  CurveElementType Enumeration
  CurveExtents Class
  CurveExtents Members
  CurveExtents Methods
  Dispose Method
  CurveExtents Properties
  EndParameter Property
  IsValidObject Property
  StartParameter Property
  CurveLoop Class
  CurveLoop Members
  CurveLoop Constructor
  CurveLoop Methods
  Append Method
  Create Method
  CreateViaCopy Method
  CreateViaOffset Method
  CreateViaThicken Method
  CreateViaThicken Method (Curve, Double, XYZ)
  CreateViaThicken Method (CurveLoop, Double, XYZ)
  Dispose Method
  Flip Method
  GetBasicIEnumerator Method
  GetCurveLoopIterator Method
  GetEnumerator Method
  GetExactLength Method
  GetPlane Method
  GetRectangularHeight Method
  GetRectangularWidth Method
  HasPlane Method
  IsCounterclockwise Method
  IsOpen Method
  IsRectangular Method
  CurveLoop Properties
  IsValidObject Property
  CurveLoopIterator Class
  CurveLoopIterator Members
  CurveLoopIterator Methods
  Dispose Method
  MoveNext Method
  Reset Method
  CurveLoopIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  CurveLoopsProfile Class
  CurveLoopsProfile Members
  CurveLoopsProfile Methods
  CurveLoopsProfile Properties
  Profile Property
  CurveProjectionType Enumeration
  CustomExporter Class
  CustomExporter Members
  CustomExporter Constructor
  CustomExporter Methods
  Dispose Method
  Export Method
  Export Method (IList(ElementId))
  Export Method (View3D)
  IsRenderingSupported Method
  CustomExporter Properties
  IncludeFaces Property
  IsValidObject Property
  ShouldStopOnError Property
  CutFailureReason Enumeration
  CylindricalFace Class
  CylindricalFace Members
  CylindricalFace Methods
  Intersect Method
  IsInside Method
  Triangulate Method
  CylindricalFace Properties
  Axis Property
  Origin Property
  Radius Property
  CylindricalHelix Class
  CylindricalHelix Members
  CylindricalHelix Methods
  Create Method
  Intersect Method
  IsInside Method
  CylindricalHelix Properties
  BasePoint Property
  Height Property
  IsRightHanded Property
  Pitch Property
  Radius Property
  XVector Property
  YVector Property
  ZVector Property
  DaylightPortalNode Class
  DaylightPortalNode Members
  DaylightPortalNode Methods
  DaylightPortalNode Properties
  DecimalSymbol Enumeration
  DefaultDivideSettings Class
  DefaultDivideSettings Members
  DefaultDivideSettings Methods
  GetDefaultDivideSettings Method
  GetDistance Method
  GetLayout Method
  GetNumber Method
  GetSurfaceDistance Method
  GetSurfaceLayout Method
  GetSurfaceNumber Method
  SetDistance Method
  SetLayout Method
  SetNumber Method
  SetSurfaceDistance Method
  SetSurfaceLayout Method
  SetSurfaceNumber Method
  DefaultDivideSettings Properties
  Parameter Property
  PathDistance Property
  PathLayout Property
  PathMeasurementType Property
  PathNumber Property
  Definition Class
  Definition Members
  Definition Methods
  Definition Properties
  Name Property
  ParameterGroup Property
  ParameterType Property
  UnitType Property
  DefinitionBindingMap Class
  DefinitionBindingMap Members
  DefinitionBindingMap Constructor
  DefinitionBindingMap Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  DefinitionBindingMap Properties
  IsEmpty Property
  Item Property
  Size Property
  DefinitionBindingMapIterator Class
  DefinitionBindingMapIterator Members
  DefinitionBindingMapIterator Constructor
  DefinitionBindingMapIterator Methods
  MoveNext Method
  Reset Method
  DefinitionBindingMapIterator Properties
  Current Property
  Key Property
  DefinitionFile Class
  DefinitionFile Members
  DefinitionFile Methods
  DefinitionFile Properties
  Filename Property
  Groups Property
  DefinitionGroup Class
  DefinitionGroup Members
  DefinitionGroup Methods
  DefinitionGroup Properties
  Definitions Property
  Name Property
  DefinitionGroups Class
  DefinitionGroups Members
  DefinitionGroups Methods
  Contains Method
  Create Method
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  DefinitionGroups Properties
  IsEmpty Property
  Item Property
  Size Property
  Definitions Class
  Definitions Members
  Definitions Constructor
  Definitions Methods
  Contains Method
  Create Method
  Create Method (ExternalDefinitonCreationOptions)
  Create Method (String, ParameterType)
  Create Method (String, ParameterType, Boolean)
  Create Method (String, ParameterType, Boolean, Guid)
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  Definitions Properties
  IsEmpty Property
  Item Property
  Size Property
  DeleteElements Class
  DeleteElements Members
  DeleteElements Methods
  Create Method
  Create Method (Document, ElementId)
  Create Method (Document, IList(ElementId))
  DeleteElements Properties
  DesignOption Class
  DesignOption Members
  DesignOption Methods
  GetActiveDesignOptionId Method
  DesignOption Properties
  IsPrimary Property
  Parameter Property
  DetachFromCentralOption Enumeration
  DetailArc Class
  DetailArc Members
  DetailArc Methods
  DetailArc Properties
  Parameter Property
  DetailCurve Class
  DetailCurve Members
  DetailCurve Methods
  DetailCurve Properties
  Parameter Property
  DetailCurveArray Class
  DetailCurveArray Members
  DetailCurveArray Constructor
  DetailCurveArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  DetailCurveArray Properties
  IsEmpty Property
  Item Property
  Size Property
  DetailCurveArrayIterator Class
  DetailCurveArrayIterator Members
  DetailCurveArrayIterator Constructor
  DetailCurveArrayIterator Methods
  MoveNext Method
  Reset Method
  DetailCurveArrayIterator Properties
  Current Property
  DetailElementOrderUtils Class
  DetailElementOrderUtils Members
  DetailElementOrderUtils Methods
  AreDetailElements Method
  BringForward Method
  BringForward Method (Document, View, ElementId)
  BringForward Method (Document, View, ICollection(ElementId))
  BringToFront Method
  BringToFront Method (Document, View, ElementId)
  BringToFront Method (Document, View, ICollection(ElementId))
  IsDetailElement Method
  SendBackward Method
  SendBackward Method (Document, View, ElementId)
  SendBackward Method (Document, View, ICollection(ElementId))
  SendToBack Method
  SendToBack Method (Document, View, ElementId)
  SendToBack Method (Document, View, ICollection(ElementId))
  DetailEllipse Class
  DetailEllipse Members
  DetailEllipse Methods
  DetailEllipse Properties
  Parameter Property
  DetailLine Class
  DetailLine Members
  DetailLine Methods
  DetailLine Properties
  Parameter Property
  DetailNurbSpline Class
  DetailNurbSpline Members
  DetailNurbSpline Methods
  DetailNurbSpline Properties
  Parameter Property
  DGNExportOptions Class
  DGNExportOptions Members
  DGNExportOptions Constructor
  DGNExportOptions Constructor
  DGNExportOptions Constructor (DGNExportOptions)
  DGNExportOptions Methods
  GetExportLineweightTable Method
  GetPredefinedOptions Method
  SetExportLineweightTable Method
  DGNExportOptions Properties
  FileVersion Property
  MasterUnits Property
  MergedViews Property
  SeedName Property
  DGNFileFormat Enumeration
  DGNImportOptions Class
  DGNImportOptions Members
  DGNImportOptions Constructor
  DGNImportOptions Constructor
  DGNImportOptions Constructor (DGNImportOptions)
  DGNImportOptions Methods
  DGNImportOptions Properties
  DGNModelViewName Property
  IgnoreUnsupportedElementWarning Property
  DigitGroupingAmount Enumeration
  DigitGroupingSymbol Enumeration
  Dimension Class
  Dimension Members
  Dimension Methods
  Dimension Properties
  Above Property
  AreSegmentsEqual Property
  Below Property
  Curve Property
  DimensionShape Property
  DimensionType Property
  FamilyLabel Property
  IsLocked Property
  Name Property
  NumberOfSegments Property
  Parameter Property
  Prefix Property
  References Property
  Segments Property
  Suffix Property
  Value Property
  ValueOverride Property
  ValueString Property
  View Property
  DimensionSegment Class
  DimensionSegment Members
  DimensionSegment Methods
  DimensionSegment Properties
  Above Property
  Below Property
  IsLocked Property
  Origin Property
  Prefix Property
  Suffix Property
  Value Property
  ValueOverride Property
  ValueString Property
  DimensionSegmentArray Class
  DimensionSegmentArray Members
  DimensionSegmentArray Constructor
  DimensionSegmentArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  DimensionSegmentArray Properties
  IsEmpty Property
  Item Property
  Size Property
  DimensionSegmentArrayIterator Class
  DimensionSegmentArrayIterator Members
  DimensionSegmentArrayIterator Constructor
  DimensionSegmentArrayIterator Methods
  MoveNext Method
  Reset Method
  DimensionSegmentArrayIterator Properties
  Current Property
  DimensionShape Enumeration
  DimensionStyleType Enumeration
  DimensionType Class
  DimensionType Members
  DimensionType Methods
  GetAlternateUnitsFormatOptions Method
  SetAlternateUnitsFormatOptions Method
  DimensionType Properties
  AlternateUnits Property
  AlternateUnitsPrefix Property
  AlternateUnitsSuffix Property
  Parameter Property
  StyleType Property
  UnitType Property
  DimensionTypeSet Class
  DimensionTypeSet Members
  DimensionTypeSet Constructor
  DimensionTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  DimensionTypeSet Properties
  IsEmpty Property
  Size Property
  DimensionTypeSetIterator Class
  DimensionTypeSetIterator Members
  DimensionTypeSetIterator Constructor
  DimensionTypeSetIterator Methods
  MoveNext Method
  Reset Method
  DimensionTypeSetIterator Properties
  Current Property
  DirectShape Class
  DirectShape Members
  DirectShape Methods
  CreateElement Method
  CreateElementInstance Method
  CreateGeometryInstance Method
  IsValidCategoryId Method
  IsValidGeometry Method
  IsValidTypeId Method
  SetGUIDs Method
  SetName Method
  SetShape Method
  SetShape Method (IList(GeometryObject))
  SetShape Method (IList(GeometryObject), DirectShapeTargetViewType)
  SetTypeId Method
  DirectShape Properties
  Parameter Property
  TypeId Property
  DirectShapeLibrary Class
  DirectShapeLibrary Members
  DirectShapeLibrary Methods
  AddDefinition Method
  AddDefinition Method (String, GeometryObject)
  AddDefinition Method (String, IList(GeometryObject))
  AddDefinitionType Method
  Contains Method
  ContainsType Method
  Dispose Method
  FindDefinition Method
  FindDefinitionType Method
  GetDirectShapeLibrary Method
  Reset Method
  DirectShapeLibrary Properties
  IsValidObject Property
  DirectShapeTargetViewType Enumeration
  DirectShapeType Class
  DirectShapeType Members
  DirectShapeType Methods
  Create Method
  SetShape Method
  DirectShapeType Properties
  Parameter Property
  DisplacementElement Class
  DisplacementElement Members
  DisplacementElement Methods
  CanCategoryBeDisplaced Method
  CanElementsBeAddedToDisplacementSet Method
  CanElementsBeDisplaced Method
  CanElementsBeDisplaced Method (View, ICollection(ElementId))
  CanElementsBeDisplaced Method (View, ICollection(ElementId), ElementId)
  Create Method
  GetAbsoluteDisplacement Method
  GetAdditionalElementsToDisplace Method
  GetChildren Method
  GetDisplacedElementIds Method
  GetDisplacedElementIds Method
  GetDisplacedElementIds Method (View)
  GetDisplacedElementIdsFromAllChildren Method
  GetDisplacementElementId Method
  GetDisplacementElementIds Method
  GetRelativeDisplacement Method
  IsAllowedAsDisplacedElement Method
  IsElementDisplacedInView Method
  IsNotEmpty Method
  IsValidAsParentInView Method
  RemoveDisplacedElement Method
  ResetDisplacedElements Method
  SetDisplacedElementIds Method
  SetRelativeDisplacement Method
  DisplacementElement Properties
  Parameter Property
  ParentId Property
  DisplacementPath Class
  DisplacementPath Members
  DisplacementPath Methods
  Create Method
  IsValidParam Method
  IsValidReference Method
  SetAnchorPoint Method
  DisplacementPath Properties
  AncestorIdx Property
  Parameter Property
  PathStyle Property
  DisplacementPathStyle Enumeration
  DisplayStyle Enumeration
  DisplayUnit Enumeration
  DisplayUnitType Enumeration
  DistanceMeasuredFrom Enumeration
  DistributionOfNormals Enumeration
  DividedPath Class
  DividedPath Members
  DividedPath Methods
  AreCurveReferencesConnected Method
  Create Method
  Create Method (Document, IList(Reference))
  Create Method (Document, IList(Reference), ICollection(ElementId))
  Flip Method
  GetIntersectingElements Method
  IsCurveReferenceValid Method
  IsIntersectorValidForCreation Method
  IsIntersectorValidForDividedPath Method
  IsValidBeginningIndent Method
  IsValidEndIndent Method
  IsValidFixedNumberOfPoints Method
  IsValidMeasurementType Method
  IsValidSpacingRuleJustification Method
  IsValidSpacingRuleLayout Method
  SeparateReferencesIntoConnectedReferences Method
  SetIntersectingElements Method
  DividedPath Properties
  BeginningIndent Property
  DisplayNodeNumbers Property
  DisplayNodes Property
  DisplayReferenceCurves Property
  Distance Property
  EndIndent Property
  FixedNumberOfPoints Property
  Flipped Property
  IsClosedLoop Property
  IsCyclical Property
  MaximumDistance Property
  MeasurementType Property
  MinimumDistance Property
  NumberOfPoints Property
  Parameter Property
  SpacingRuleJustification Property
  SpacingRuleLayout Property
  TotalPathLength Property
  DividedPathMeasurementType Enumeration
  DividedSurface Class
  DividedSurface Members
  DividedSurface Methods
  AddIntersectionElement Method
  CanBeDivided Method
  CanBeIntersectionElement Method
  Create Method
  GetAllIntersectionElements Method
  GetDividedSurfaceForReference Method
  GetGridNodeLocation Method
  GetGridNodeReference Method
  GetGridNodeUV Method
  GetGridSegmentReference Method
  GetReferencesWithDividedSurfaces Method
  GetTileFamilyInstance Method
  GetTileReference Method
  IsSeedNode Method
  RemoveAllIntersectionElements Method
  RemoveIntersectionElement Method
  DividedSurface Properties
  AllGridRotation Property
  BorderTile Property
  ComponentRotation Property
  Host Property
  HostReference Property
  IsComponentFlipped Property
  IsComponentMirrored Property
  NumberOfUGridlines Property
  NumberOfVGridlines Property
  Parameter Property
  UPatternIndent Property
  USpacingRule Property
  VPatternIndent Property
  VSpacingRule Property
  Document Class
  Document Members
  Document Methods
  AutoJoinElements Method
  CanEnableWorksharing Method
  Close Method
  Close Method
  Close Method (Boolean)
  CombineElements Method
  ConvertDetailToModelCurves Method
  ConvertModelToDetailCurves Method
  ConvertModelToSymbolicCurves Method
  ConvertSymbolicToModelCurves Method
  Delete Method
  Delete Method (ElementId)
  Delete Method (ICollection(ElementId))
  Dispose Method
  EditFamily Method
  EnableWorksharing Method
  Equals Method
  Export Method
  Export Method (String, String, MassGBXMLExportOptions)
  Export Method (String, String, GBXMLExportOptions)
  Export Method (String, String, IFCExportOptions)
  Export Method (String, String, NavisworksExportOptions)
  Export Method (String, String, ViewSet, DWFExportOptions)
  Export Method (String, String, ViewSet, DWFXExportOptions)
  Export Method (String, String, ViewSet, FBXExportOptions)
  Export Method (String, String, ICollection(ElementId), DGNExportOptions)
  Export Method (String, String, ICollection(ElementId), DWGExportOptions)
  Export Method (String, String, ICollection(ElementId), DXFExportOptions)
  Export Method (String, String, ICollection(ElementId), SATExportOptions)
  Export Method (String, String, View3D, ViewPlan, BuildingSiteExportOptions)
  ExportImage Method
  GetDefaultElementTypeId Method
  GetDefaultFamilyTypeId Method
  GetDocumentPreviewSettings Method
  GetDocumentVersion Method
  GetElement Method
  GetElement Method (String)
  GetElement Method (ElementId)
  GetElement Method (Reference)
  GetHashCode Method
  GetPaintedMaterial Method
  GetPrintSettingIds Method
  GetRoomAtPoint Method
  GetRoomAtPoint Method (XYZ)
  GetRoomAtPoint Method (XYZ, Phase)
  GetSpaceAtPoint Method
  GetSpaceAtPoint Method (XYZ)
  GetSpaceAtPoint Method (XYZ, Phase)
  GetUnits Method
  GetWorksetId Method
  GetWorksetTable Method
  GetWorksharingCentralModelPath Method
  HasAllChangesFromCentral Method
  Import Method
  Import Method (String, GBXMLImportOptions)
  Import Method (String, SATImportOptions, View)
  Import Method (String, SKPImportOptions, View)
  Import Method (String, DGNImportOptions, View, ElementId)
  Import Method (String, DWGImportOptions, View, ElementId)
  Import Method (String, ImageImportOptions, View, Element)
  IsDefaultElementTypeIdValid Method
  IsDefaultFamilyTypeIdValid Method
  IsPainted Method
  Link Method
  Link Method (String, DWFImportOptions)
  Link Method (String, SATImportOptions, View)
  Link Method (String, SKPImportOptions, View)
  Link Method (String, DGNImportOptions, View, ElementId)
  Link Method (String, DWGImportOptions, View, ElementId)
  LoadFamily Method
  LoadFamily Method (String)
  LoadFamily Method (Document)
  LoadFamily Method (String, Family)
  LoadFamily Method (Document, IFamilyLoadOptions)
  LoadFamily Method (String, IFamilyLoadOptions, Family)
  LoadFamilySymbol Method
  LoadFamilySymbol Method (String, String)
  LoadFamilySymbol Method (String, String, FamilySymbol)
  LoadFamilySymbol Method (String, String, IFamilyLoadOptions, FamilySymbol)
  Paint Method
  Paint Method (ElementId, Face, ElementId)
  Paint Method (ElementId, Face, FamilyParameter)
  PostFailure Method
  Print Method
  Print Method (ViewSet)
  Print Method (ViewSet, View)
  Print Method (ViewSet, Boolean)
  Print Method (ViewSet, View, Boolean)
  Regenerate Method
  ReloadLatest Method
  RemovePaint Method
  Save Method
  Save Method
  Save Method (SaveOptions)
  SaveAs Method
  SaveAs Method (String)
  SaveAs Method (String, SaveAsOptions)
  SaveAs Method (ModelPath, SaveAsOptions)
  SaveToProjectAsImage Method
  SeparateElements Method
  SetDefaultElementTypeId Method
  SetDefaultFamilyTypeId Method
  SetUnits Method
  SynchronizeWithCentral Method
  UnpostFailure Method
  Document Properties
  ActiveProjectLocation Property
  ActiveView Property
  Application Property
  Create Property
  DisplayUnitSystem Property
  FamilyCreate Property
  FamilyManager Property
  IsDetached Property
  IsFamilyDocument Property
  IsLinked Property
  IsModifiable Property
  IsModified Property
  IsReadOnly Property
  IsReadOnlyFile Property
  IsValidObject Property
  IsWorkshared Property
  MassDisplayTemporaryOverride Property
  MullionTypes Property
  OwnerFamily Property
  PanelTypes Property
  ParameterBindings Property
  PathName Property
  Phases Property
  PlanTopologies Property
  PlanTopologies Property
  PlanTopologies Property (Phase)
  PlanTopology Property
  PlanTopology Property (Level)
  PlanTopology Property (Level, Phase)
  PrintManager Property
  ProjectInformation Property
  ProjectLocations Property
  ReactionsAreUpToDate Property
  Settings Property
  SiteLocation Property
  Title Property
  TypeOfStorage Property
  WorksharingCentralGUID Property
  Document Events
  DocumentClosing Event
  DocumentPrinted Event
  DocumentPrinting Event
  DocumentSaved Event
  DocumentSavedAs Event
  DocumentSaving Event
  DocumentSavingAs Event
  ViewPrinted Event
  ViewPrinting Event
  DocumentPreviewSettings Class
  DocumentPreviewSettings Members
  DocumentPreviewSettings Methods
  Dispose Method
  ForceViewUpdate Method
  IsViewIdValidForPreview Method
  DocumentPreviewSettings Properties
  IsValidObject Property
  IsViewUpdateForced Property
  PreviewViewId Property
  DocumentSet Class
  DocumentSet Members
  DocumentSet Constructor
  DocumentSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  DocumentSet Properties
  IsEmpty Property
  Size Property
  DocumentSetIterator Class
  DocumentSetIterator Members
  DocumentSetIterator Constructor
  DocumentSetIterator Methods
  MoveNext Method
  Reset Method
  DocumentSetIterator Properties
  Current Property
  DocumentType Enumeration
  DocumentValidation Class
  DocumentValidation Members
  DocumentValidation Methods
  CanDeleteElement Method
  DocumentVersion Class
  DocumentVersion Members
  DocumentVersion Methods
  Dispose Method
  IsEqual Method
  DocumentVersion Properties
  IsValidObject Property
  NumberOfSaves Property
  VersionGUID Property
  Domain Enumeration
  DoubleArray Class
  DoubleArray Members
  DoubleArray Constructor
  DoubleArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  DoubleArray Properties
  IsEmpty Property
  Item Property
  Size Property
  DoubleArrayIterator Class
  DoubleArrayIterator Members
  DoubleArrayIterator Constructor
  DoubleArrayIterator Methods
  MoveNext Method
  Reset Method
  DoubleArrayIterator Properties
  Current Property
  DuplicateTypeAction Enumeration
  DuplicateTypeNamesHandlerArgs Class
  DuplicateTypeNamesHandlerArgs Members
  DuplicateTypeNamesHandlerArgs Methods
  Dispose Method
  GetTypeIds Method
  DuplicateTypeNamesHandlerArgs Properties
  Document Property
  IsValidObject Property
  DWFExportOptions Class
  DWFExportOptions Members
  DWFExportOptions Constructor
  DWFExportOptions Methods
  DWFExportOptions Properties
  CropBoxVisible Property
  ExportingAreas Property
  ExportObjectData Property
  ImageFormat Property
  ImageQuality Property
  MergedViews Property
  PaperFormat Property
  PortraitLayout Property
  StopOnError Property
  DWFImageFormat Enumeration
  DWFImageQuality Enumeration
  DWFImportOptions Class
  DWFImportOptions Members
  DWFImportOptions Constructor
  DWFImportOptions Constructor (DWFImportOptions)
  DWFImportOptions Constructor (IList(ElementId))
  DWFImportOptions Methods
  Dispose Method
  GetSheetViews Method
  SetSheetViews Method
  DWFImportOptions Properties
  IsValidObject Property
  DWFXExportOptions Class
  DWFXExportOptions Members
  DWFXExportOptions Constructor
  DWFXExportOptions Methods
  DWFXExportOptions Properties
  DWGExportOptions Class
  DWGExportOptions Members
  DWGExportOptions Constructor
  DWGExportOptions Constructor
  DWGExportOptions Constructor (DWGExportOptions)
  DWGExportOptions Methods
  GetPredefinedOptions Method
  DWGExportOptions Properties
  MergedViews Property
  DWGImportOptions Class
  DWGImportOptions Members
  DWGImportOptions Constructor
  DWGImportOptions Constructor
  DWGImportOptions Constructor (DWGImportOptions)
  DWGImportOptions Methods
  GetLineWeights Method
  SetLineWeights Method
  DWGImportOptions Properties
  DXFExportOptions Class
  DXFExportOptions Members
  DXFExportOptions Constructor
  DXFExportOptions Constructor
  DXFExportOptions Constructor (DXFExportOptions)
  DXFExportOptions Methods
  GetPredefinedOptions Method
  DXFExportOptions Properties
  EaveCutterType Enumeration
  Edge Class
  Edge Members
  Edge Methods
  AsCurve Method
  AsCurveFollowingFace Method
  ComputeDerivatives Method
  Evaluate Method
  EvaluateOnFace Method
  GetEndPointReference Method
  GetFace Method
  Tessellate Method
  TessellateOnFace Method
  Edge Properties
  ApproximateLength Property
  Reference Property
  EdgeArray Class
  EdgeArray Members
  EdgeArray Constructor
  EdgeArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  EdgeArray Properties
  IsEmpty Property
  Item Property
  Size Property
  EdgeArrayArray Class
  EdgeArrayArray Members
  EdgeArrayArray Constructor
  EdgeArrayArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  EdgeArrayArray Properties
  IsEmpty Property
  Item Property
  Size Property
  EdgeArrayArrayIterator Class
  EdgeArrayArrayIterator Members
  EdgeArrayArrayIterator Constructor
  EdgeArrayArrayIterator Methods
  MoveNext Method
  Reset Method
  EdgeArrayArrayIterator Properties
  Current Property
  EdgeArrayIterator Class
  EdgeArrayIterator Members
  EdgeArrayIterator Constructor
  EdgeArrayIterator Methods
  MoveNext Method
  Reset Method
  EdgeArrayIterator Properties
  Current Property
  EditScope Class
  EditScope Members
  EditScope Methods
  Cancel Method
  Commit Method
  Dispose Method
  EditScope Properties
  IsActive Property
  IsValidObject Property
  Element Class
  Element Members
  Element Methods
  ArePhasesModifiable Method
  CanBeHidden Method
  CanBeLocked Method
  CanHaveAnalyticalModel Method
  CanHaveTypeAssigned Method
  CanHaveTypeAssigned Method
  CanHaveTypeAssigned Method (Document, ICollection(ElementId))
  ChangeTypeId Method
  ChangeTypeId Method (ElementId)
  ChangeTypeId Method (Document, ICollection(ElementId), ElementId)
  DeleteEntity Method
  Dispose Method
  GetAnalyticalModel Method
  GetAnalyticalModelId Method
  GetChangeTypeAny Method
  GetChangeTypeElementAddition Method
  GetChangeTypeElementDeletion Method
  GetChangeTypeGeometry Method
  GetChangeTypeParameter Method
  GetChangeTypeParameter Method (ElementId)
  GetChangeTypeParameter Method (Parameter)
  GetEntity Method
  GetEntitySchemaGuids Method
  GetExternalFileReference Method
  GetExternalResourceReference Method
  GetExternalResourceReferences Method
  GetGeneratingElementIds Method
  GetGeometryObjectFromReference Method
  GetMaterialArea Method
  GetMaterialIds Method
  GetMaterialVolume Method
  GetMonitoredLinkElementIds Method
  GetMonitoredLocalElementIds Method
  GetOrderedParameters Method
  GetParameterFormatOptions Method
  GetParameters Method
  GetPhaseStatus Method
  GetTypeId Method
  GetValidTypes Method
  GetValidTypes Method
  GetValidTypes Method (Document, ICollection(ElementId))
  HasPhases Method
  IsExternalFileReference Method
  IsHidden Method
  IsMonitoringLinkElement Method
  IsMonitoringLocalElement Method
  IsPhaseCreatedValid Method
  IsPhaseDemolishedValid Method
  IsValidType Method
  IsValidType Method (ElementId)
  IsValidType Method (Document, ICollection(ElementId), ElementId)
  LookupParameter Method
  RefersToExternalResourceReference Method
  RefersToExternalResourceReferences Method
  SetEntity Method
  Element Properties
  AssemblyInstanceId Property
  BoundingBox Property
  Category Property
  CreatedPhaseId Property
  DemolishedPhaseId Property
  DesignOption Property
  Document Property
  Geometry Property
  GroupId Property
  Id Property
  IsValidObject Property
  LevelId Property
  Location Property
  Name Property
  OwnerViewId Property
  Parameter Property
  Parameter Property (Guid)
  Parameter Property (String)
  Parameter Property (BuiltInParameter)
  Parameter Property (Definition)
  Parameters Property
  ParametersMap Property
  Pinned Property
  UniqueId Property
  ViewSpecific Property
  WorksetId Property
  ElementArray Class
  ElementArray Members
  ElementArray Constructor
  ElementArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ElementArray Properties
  IsEmpty Property
  Item Property
  Size Property
  ElementArrayIterator Class
  ElementArrayIterator Members
  ElementArrayIterator Constructor
  ElementArrayIterator Methods
  MoveNext Method
  Reset Method
  ElementArrayIterator Properties
  Current Property
  ElementBinding Class
  ElementBinding Members
  ElementBinding Methods
  ElementBinding Properties
  Categories Property
  ElementCategoryFilter Class
  ElementCategoryFilter Members
  ElementCategoryFilter Constructor
  ElementCategoryFilter Constructor (BuiltInCategory)
  ElementCategoryFilter Constructor (ElementId)
  ElementCategoryFilter Constructor (BuiltInCategory, Boolean)
  ElementCategoryFilter Constructor (ElementId, Boolean)
  ElementCategoryFilter Methods
  PassesFilter Method
  ElementCategoryFilter Properties
  CategoryId Property
  ElementClassFilter Class
  ElementClassFilter Members
  ElementClassFilter Constructor
  ElementClassFilter Constructor (Type)
  ElementClassFilter Constructor (Type, Boolean)
  ElementClassFilter Methods
  GetElementClass Method
  PassesFilter Method
  ElementClassFilter Properties
  ElementComparisonResult Enumeration
  ElementDesignOptionFilter Class
  ElementDesignOptionFilter Members
  ElementDesignOptionFilter Constructor
  ElementDesignOptionFilter Constructor (ElementId)
  ElementDesignOptionFilter Constructor (ElementId, Boolean)
  ElementDesignOptionFilter Methods
  PassesFilter Method
  ElementDesignOptionFilter Properties
  DesignOptionId Property
  ElementFilter Class
  ElementFilter Members
  ElementFilter Methods
  Dispose Method
  PassesFilter Method
  PassesFilter Method (Element)
  PassesFilter Method (Document, ElementId)
  ElementFilter Properties
  Inverted Property
  IsValidObject Property
  ElementId Class
  ElementId Members
  ElementId Constructor
  ElementId Constructor (Int32)
  ElementId Constructor (BuiltInCategory)
  ElementId Constructor (BuiltInParameter)
  ElementId Methods
  Compare Method
  Equals Method
  GetHashCode Method
  ToString Method
  ElementId Operators
  Equality Operator
  GreaterThan Operator
  GreaterThanOrEqual Operator
  Inequality Operator
  LessThan Operator
  LessThanOrEqual Operator
  ElementId Properties
  IntegerValue Property
  InvalidElementId Property
  ElementIntersectsElementFilter Class
  ElementIntersectsElementFilter Members
  ElementIntersectsElementFilter Constructor
  ElementIntersectsElementFilter Constructor (Element)
  ElementIntersectsElementFilter Constructor (Element, Boolean)
  ElementIntersectsElementFilter Methods
  GetElement Method
  PassesFilter Method
  ElementIntersectsElementFilter Properties
  ElementIntersectsFilter Class
  ElementIntersectsFilter Members
  ElementIntersectsFilter Methods
  IsCategorySupported Method
  IsElementSupported Method
  PassesFilter Method
  ElementIntersectsFilter Properties
  ElementIntersectsSolidFilter Class
  ElementIntersectsSolidFilter Members
  ElementIntersectsSolidFilter Constructor
  ElementIntersectsSolidFilter Constructor (Solid)
  ElementIntersectsSolidFilter Constructor (Solid, Boolean)
  ElementIntersectsSolidFilter Methods
  GetSolid Method
  PassesFilter Method
  ElementIntersectsSolidFilter Properties
  ElementIsCurveDrivenFilter Class
  ElementIsCurveDrivenFilter Members
  ElementIsCurveDrivenFilter Constructor
  ElementIsCurveDrivenFilter Constructor
  ElementIsCurveDrivenFilter Constructor (Boolean)
  ElementIsCurveDrivenFilter Methods
  PassesFilter Method
  ElementIsCurveDrivenFilter Properties
  ElementIsElementTypeFilter Class
  ElementIsElementTypeFilter Members
  ElementIsElementTypeFilter Constructor
  ElementIsElementTypeFilter Constructor
  ElementIsElementTypeFilter Constructor (Boolean)
  ElementIsElementTypeFilter Methods
  PassesFilter Method
  ElementIsElementTypeFilter Properties
  ElementLevelFilter Class
  ElementLevelFilter Members
  ElementLevelFilter Constructor
  ElementLevelFilter Constructor (ElementId)
  ElementLevelFilter Constructor (ElementId, Boolean)
  ElementLevelFilter Methods
  PassesFilter Method
  ElementLevelFilter Properties
  LevelId Property
  ElementLogicalFilter Class
  ElementLogicalFilter Members
  ElementLogicalFilter Methods
  PassesFilter Method
  ElementLogicalFilter Properties
  ElementMulticategoryFilter Class
  ElementMulticategoryFilter Members
  ElementMulticategoryFilter Constructor
  ElementMulticategoryFilter Constructor (ICollection(BuiltInCategory))
  ElementMulticategoryFilter Constructor (ICollection(ElementId))
  ElementMulticategoryFilter Constructor (ICollection(BuiltInCategory), Boolean)
  ElementMulticategoryFilter Constructor (ICollection(ElementId), Boolean)
  ElementMulticategoryFilter Methods
  GetCategoryIds Method
  PassesFilter Method
  ElementMulticategoryFilter Properties
  ElementMulticlassFilter Class
  ElementMulticlassFilter Members
  ElementMulticlassFilter Constructor
  ElementMulticlassFilter Constructor (IList(Type))
  ElementMulticlassFilter Constructor (IList(Type), Boolean)
  ElementMulticlassFilter Methods
  PassesFilter Method
  ElementMulticlassFilter Properties
  ElementOnPhaseStatus Enumeration
  ElementOwnerViewFilter Class
  ElementOwnerViewFilter Members
  ElementOwnerViewFilter Constructor
  ElementOwnerViewFilter Constructor (ElementId)
  ElementOwnerViewFilter Constructor (ElementId, Boolean)
  ElementOwnerViewFilter Methods
  PassesFilter Method
  ElementOwnerViewFilter Properties
  ViewId Property
  ElementParameterFilter Class
  ElementParameterFilter Members
  ElementParameterFilter Constructor
  ElementParameterFilter Constructor (FilterRule)
  ElementParameterFilter Constructor (IList(FilterRule))
  ElementParameterFilter Constructor (FilterRule, Boolean)
  ElementParameterFilter Constructor (IList(FilterRule), Boolean)
  ElementParameterFilter Methods
  GetRules Method
  PassesFilter Method
  ElementParameterFilter Properties
  ElementPhaseStatusFilter Class
  ElementPhaseStatusFilter Members
  ElementPhaseStatusFilter Constructor
  ElementPhaseStatusFilter Constructor (ElementId, ElementOnPhaseStatus)
  ElementPhaseStatusFilter Constructor (ElementId, ICollection(ElementOnPhaseStatus))
  ElementPhaseStatusFilter Constructor (ElementId, ElementOnPhaseStatus, Boolean)
  ElementPhaseStatusFilter Constructor (ElementId, ICollection(ElementOnPhaseStatus), Boolean)
  ElementPhaseStatusFilter Methods
  GetPhaseStatuses Method
  PassesFilter Method
  ElementPhaseStatusFilter Properties
  PhaseId Property
  ElementQuickFilter Class
  ElementQuickFilter Members
  ElementQuickFilter Methods
  PassesFilter Method
  ElementQuickFilter Properties
  ElementRecord Class
  ElementRecord Members
  ElementRecord Methods
  Dispose Method
  GetBoundingBox Method
  GetCategoryId Method
  GetDesignOptionId Method
  GetId Method
  GetOwnerViewId Method
  HasBoundingBox Method
  IsAnElementType Method
  IsCurveDriven Method
  ElementRecord Properties
  IsValidObject Property
  WorksetId Property
  ElementReferenceType Enumeration
  ElementSet Class
  ElementSet Members
  ElementSet Constructor
  ElementSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ElementSet Properties
  IsEmpty Property
  Size Property
  ElementSetIterator Class
  ElementSetIterator Members
  ElementSetIterator Constructor
  ElementSetIterator Methods
  MoveNext Method
  Reset Method
  ElementSetIterator Properties
  Current Property
  ElementSlowFilter Class
  ElementSlowFilter Members
  ElementSlowFilter Methods
  PassesFilter Method
  ElementSlowFilter Properties
  ElementStructuralTypeFilter Class
  ElementStructuralTypeFilter Members
  ElementStructuralTypeFilter Constructor
  ElementStructuralTypeFilter Constructor (StructuralType)
  ElementStructuralTypeFilter Constructor (StructuralType, Boolean)
  ElementStructuralTypeFilter Methods
  PassesFilter Method
  ElementStructuralTypeFilter Properties
  StructuralType Property
  ElementTransformUtils Class
  ElementTransformUtils Members
  ElementTransformUtils Methods
  CanMirrorElement Method
  CanMirrorElements Method
  CopyElement Method
  CopyElements Method
  CopyElements Method (Document, ICollection(ElementId), XYZ)
  CopyElements Method (Document, ICollection(ElementId), Document, Transform, CopyPasteOptions)
  CopyElements Method (View, ICollection(ElementId), View, Transform, CopyPasteOptions)
  GetTransformFromViewToView Method
  MirrorElement Method
  MirrorElements Method
  MoveElement Method
  MoveElements Method
  RotateElement Method
  RotateElements Method
  ElementType Class
  ElementType Members
  ElementType Methods
  Duplicate Method
  GetPreviewImage Method
  GetSimilarTypes Method
  IsSimilarType Method
  IsValidDefaultFamilyType Method
  ElementType Properties
  CanBeCopied Property
  CanBeDeleted Property
  CanBeRenamed Property
  FamilyName Property
  Name Property
  Parameter Property
  ElementTypeGroup Enumeration
  ElementWorksetFilter Class
  ElementWorksetFilter Members
  ElementWorksetFilter Constructor
  ElementWorksetFilter Constructor (WorksetId)
  ElementWorksetFilter Constructor (WorksetId, Boolean)
  ElementWorksetFilter Methods
  PassesFilter Method
  ElementWorksetFilter Properties
  WorksetId Property
  ElevationMarker Class
  ElevationMarker Members
  ElevationMarker Methods
  CreateElevation Method
  CreateElevationMarker Method
  CreateReferenceElevation Method
  CreateReferenceElevationMarker Method
  GetViewId Method
  HasElevations Method
  IsAvailableIndex Method
  ElevationMarker Properties
  CurrentViewCount Property
  IsReference Property
  MaximumViewCount Property
  Parameter Property
  Ellipse Class
  Ellipse Members
  Ellipse Methods
  Create Method
  Intersect Method
  IsInside Method
  Ellipse Properties
  Center Property
  Normal Property
  RadiusX Property
  RadiusY Property
  XDirection Property
  YDirection Property
  EndCapCondition Enumeration
  ExclusionFilter Class
  ExclusionFilter Members
  ExclusionFilter Constructor
  ExclusionFilter Methods
  GetIdsToExclude Method
  PassesFilter Method
  ExclusionFilter Properties
  ExportColorMode Enumeration
  ExportColumnHeaders Enumeration
  ExportDGNSettings Class
  ExportDGNSettings Members
  ExportDGNSettings Methods
  Create Method
  Create Method (Document, String)
  Create Method (Document, String, DGNExportOptions)
  GetDGNExportOptions Method
  ListNames Method
  SetDGNExportOptions Method
  ExportDGNSettings Properties
  Parameter Property
  ExportDWGSettings Class
  ExportDWGSettings Members
  ExportDWGSettings Methods
  Create Method
  Create Method (Document, String)
  Create Method (Document, String, DWGExportOptions)
  Create Method (Document, String, DXFExportOptions)
  GetDWGExportOptions Method
  GetDXFExportOptions Method
  ListNames Method
  SetDWGExportOptions Method
  SetDXFExportOptions Method
  ExportDWGSettings Properties
  Parameter Property
  ExportEnergyModelType Enumeration
  ExportFontInfo Class
  ExportFontInfo Members
  ExportFontInfo Constructor
  ExportFontInfo Constructor
  ExportFontInfo Constructor (String)
  ExportFontInfo Constructor (ExportFontInfo)
  ExportFontInfo Methods
  Dispose Method
  ExportFontInfo Properties
  DestinationFontName Property
  IsValidObject Property
  ExportFontKey Class
  ExportFontKey Members
  ExportFontKey Constructor
  ExportFontKey Constructor
  ExportFontKey Constructor (String)
  ExportFontKey Constructor (ExportFontKey)
  ExportFontKey Methods
  Dispose Method
  ExportFontKey Properties
  IsValidObject Property
  OriginalFontName Property
  ExportFontTable Class
  ExportFontTable Members
  ExportFontTable Constructor
  ExportFontTable Methods
  Add Method
  Clear Method
  ContainsKey Method
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetExportFontInfo Method
  GetFontTableIterator Method
  GetKeys Method
  GetValues Method
  Remove Method
  ExportFontTable Properties
  Count Property
  IsValidObject Property
  Item Property
  ExportFontTableIterator Class
  ExportFontTableIterator Members
  ExportFontTableIterator Methods
  Dispose Method
  IsDone Method
  MoveNext Method
  Reset Method
  ExportFontTableIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  ExportLayerInfo Class
  ExportLayerInfo Members
  ExportLayerInfo Constructor
  ExportLayerInfo Methods
  AddCutLayerModifier Method
  AddLayerModifier Method
  ClearCutLayerModifiers Method
  ClearLayerModifiers Method
  Dispose Method
  GetCutLayerModifiers Method
  GetLayerModifiers Method
  RemoveCutLayerModifier Method
  RemoveLayerModifier Method
  SetCutLayerModifiers Method
  SetLayerModifiers Method
  ExportLayerInfo Properties
  CategoryType Property
  ColorName Property
  ColorNumber Property
  CutColorNumber Property
  CutLayerName Property
  IsValidObject Property
  LayerName Property
  ExportLayerKey Class
  ExportLayerKey Members
  ExportLayerKey Constructor
  ExportLayerKey Constructor
  ExportLayerKey Constructor (String, String, SpecialType)
  ExportLayerKey Methods
  Dispose Method
  ExportLayerKey Properties
  CategoryName Property
  IsValidObject Property
  SpecialType Property
  SubCategoryName Property
  ExportLayerTable Class
  ExportLayerTable Members
  ExportLayerTable Constructor
  ExportLayerTable Methods
  Add Method
  Clear Method
  ContainsKey Method
  Dispose Method
  GetAvaliableLayerModifierTypes Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetExportLayerInfo Method
  GetKeys Method
  GetLayerTableIterator Method
  GetValues Method
  Remove Method
  ExportLayerTable Properties
  Count Property
  IsValidObject Property
  Item Property
  ExportLayerTableIterator Class
  ExportLayerTableIterator Members
  ExportLayerTableIterator Methods
  Dispose Method
  IsDone Method
  MoveNext Method
  Reset Method
  ExportLayerTableIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  ExportLinetypeInfo Class
  ExportLinetypeInfo Members
  ExportLinetypeInfo Constructor
  ExportLinetypeInfo Constructor
  ExportLinetypeInfo Constructor (String)
  ExportLinetypeInfo Constructor (ExportLinetypeInfo)
  ExportLinetypeInfo Methods
  Dispose Method
  ExportLinetypeInfo Properties
  DestinationLinetypeName Property
  IsValidObject Property
  ExportLinetypeKey Class
  ExportLinetypeKey Members
  ExportLinetypeKey Constructor
  ExportLinetypeKey Constructor
  ExportLinetypeKey Constructor (String)
  ExportLinetypeKey Constructor (ExportLinetypeKey)
  ExportLinetypeKey Methods
  Dispose Method
  ExportLinetypeKey Properties
  IsValidObject Property
  OriginalLinetypeName Property
  ExportLinetypeTable Class
  ExportLinetypeTable Members
  ExportLinetypeTable Constructor
  ExportLinetypeTable Methods
  Add Method
  Clear Method
  ContainsKey Method
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetExportLinetypeInfo Method
  GetKeys Method
  GetLinetypeTableIterator Method
  GetValues Method
  Remove Method
  ExportLinetypeTable Properties
  Count Property
  IsValidObject Property
  Item Property
  ExportLinetypeTableIterator Class
  ExportLinetypeTableIterator Members
  ExportLinetypeTableIterator Methods
  Dispose Method
  IsDone Method
  MoveNext Method
  Reset Method
  ExportLinetypeTableIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  ExportLineweightInfo Class
  ExportLineweightInfo Members
  ExportLineweightInfo Constructor
  ExportLineweightInfo Constructor
  ExportLineweightInfo Constructor (String)
  ExportLineweightInfo Constructor (ExportLineweightInfo)
  ExportLineweightInfo Methods
  Dispose Method
  ExportLineweightInfo Properties
  DestinationLineweightName Property
  IsValidObject Property
  ExportLineweightKey Class
  ExportLineweightKey Members
  ExportLineweightKey Constructor
  ExportLineweightKey Constructor
  ExportLineweightKey Constructor (Int32)
  ExportLineweightKey Constructor (ExportLineweightKey)
  ExportLineweightKey Methods
  Dispose Method
  ExportLineweightKey Properties
  IsValidObject Property
  OriginalLineweight Property
  ExportLineweightTable Class
  ExportLineweightTable Members
  ExportLineweightTable Constructor
  ExportLineweightTable Methods
  Add Method
  Clear Method
  ContainsKey Method
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetExportLineweightInfo Method
  GetKeys Method
  GetLineweightTableIterator Method
  GetValues Method
  Remove Method
  ExportLineweightTable Properties
  Count Property
  IsValidObject Property
  Item Property
  ExportLineweightTableIterator Class
  ExportLineweightTableIterator Members
  ExportLineweightTableIterator Methods
  Dispose Method
  IsDone Method
  MoveNext Method
  Reset Method
  ExportLineweightTableIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  ExportPaperFormat Enumeration
  ExportPatternInfo Class
  ExportPatternInfo Members
  ExportPatternInfo Constructor
  ExportPatternInfo Constructor
  ExportPatternInfo Constructor (String)
  ExportPatternInfo Constructor (ExportPatternInfo)
  ExportPatternInfo Methods
  Dispose Method
  ExportPatternInfo Properties
  DestinationPatternName Property
  IsValidObject Property
  ExportPatternKey Class
  ExportPatternKey Members
  ExportPatternKey Constructor
  ExportPatternKey Constructor
  ExportPatternKey Constructor (ExportPatternKey)
  ExportPatternKey Constructor (FillPatternTarget, String)
  ExportPatternKey Methods
  Dispose Method
  ExportPatternKey Properties
  IsValidObject Property
  OriginalFillPatternName Property
  OriginalFillPatternType Property
  ExportPatternTable Class
  ExportPatternTable Members
  ExportPatternTable Constructor
  ExportPatternTable Methods
  Add Method
  Clear Method
  ContainsKey Method
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetExportPatternInfo Method
  GetKeys Method
  GetPatternTableIterator Method
  GetValues Method
  Remove Method
  ExportPatternTable Properties
  Count Property
  IsValidObject Property
  Item Property
  ExportPatternTableIterator Class
  ExportPatternTableIterator Members
  ExportPatternTableIterator Methods
  Dispose Method
  IsDone Method
  MoveNext Method
  Reset Method
  ExportPatternTableIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  ExportRange Enumeration
  ExportSheetType Enumeration
  ExportTextQualifier Enumeration
  ExportUnit Enumeration
  ExportUtils Class
  ExportUtils Members
  ExportUtils Methods
  GetExportId Method
  GetGBXMLDocumentId Method
  ExternalDBApplicationResult Enumeration
  ExternalDefinition Class
  ExternalDefinition Members
  ExternalDefinition Methods
  Dispose Method
  ExternalDefinition Properties
  Description Property
  GUID Property
  IsValidObject Property
  Name Property
  OwnerGroup Property
  ParameterGroup Property
  ParameterType Property
  UserModifiable Property
  Visible Property
  ExternalDefinitions Class
  ExternalDefinitions Members
  ExternalDefinitions Methods
  Create Method
  ExternalDefinitions Properties
  ExternalDefinitonCreationOptions Class
  ExternalDefinitonCreationOptions Members
  ExternalDefinitonCreationOptions Constructor
  ExternalDefinitonCreationOptions Methods
  Dispose Method
  ExternalDefinitonCreationOptions Properties
  Description Property
  GUID Property
  IsValidObject Property
  Name Property
  Type Property
  UserModifiable Property
  Visible Property
  ExternalFileReference Class
  ExternalFileReference Members
  ExternalFileReference Methods
  Dispose Method
  GetAbsolutePath Method
  GetLinkedFileStatus Method
  GetPath Method
  GetReferencingId Method
  IsValidExternalFileReference Method
  IsValidPathTypeForExternalFileReference Method
  ExternalFileReference Properties
  ExternalFileReferenceType Property
  IsValidObject Property
  PathType Property
  ExternalFileReferenceType Enumeration
  ExternalFileUtils Class
  ExternalFileUtils Members
  ExternalFileUtils Methods
  GetAllExternalFileReferences Method
  GetExternalFileReference Method
  IsExternalFileReference Method
  ExternalResourceBrowserData Class
  ExternalResourceBrowserData Members
  ExternalResourceBrowserData Constructor
  ExternalResourceBrowserData Methods
  AddResource Method
  AddResource Method (String)
  AddResource Method (String, IDictionary(String, String))
  AddResource Method (String, String)
  AddResource Method (String, String, IDictionary(String, String))
  AddSubFolder Method
  CallingDocumentHasModelPath Method
  Dispose Method
  GetCallingDocumentModelPath Method
  GetMatchOptions Method
  GetResources Method
  GetSubFolders Method
  IsValidFolderName Method
  IsValidResouceName Method
  ExternalResourceBrowserData Properties
  FolderPath Property
  IsValidObject Property
  ServerId Property
  ExternalResourceLoadContent Class
  ExternalResourceLoadContent Members
  ExternalResourceLoadContent Methods
  Dispose Method
  ExternalResourceLoadContent Properties
  IsValidObject Property
  LoadStatus Property
  Version Property
  ExternalResourceLoadContext Class
  ExternalResourceLoadContext Members
  ExternalResourceLoadContext Methods
  CallingDocumentHasModelPath Method
  Dispose Method
  GetCallingDocumentModelPath Method
  GetCurrentlyLoadedReference Method
  ExternalResourceLoadContext Properties
  IsValidObject Property
  LoadOperationType Property
  ExternalResourceLoadData Class
  ExternalResourceLoadData Members
  ExternalResourceLoadData Methods
  Dispose Method
  GetExternalResourceReference Method
  GetLoadContent Method
  GetLoadContext Method
  GetLoadRequestId Method
  ExternalResourceLoadData Properties
  ErrorsReported Property
  ExternalResourceType Property
  IsValidObject Property
  LoadStatus Property
  ExternalResourceLoadStatus Enumeration
  ExternalResourceMatchOptions Class
  ExternalResourceMatchOptions Members
  ExternalResourceMatchOptions Constructor
  ExternalResourceMatchOptions Methods
  Dispose Method
  ExternalResourceMatchOptions Properties
  IsValidObject Property
  ResourceType Property
  ExternalResourceReference Class
  ExternalResourceReference Members
  ExternalResourceReference Constructor
  ExternalResourceReference Constructor (ExternalResourceReference)
  ExternalResourceReference Constructor (Guid, IDictionary(String, String), String, String)
  ExternalResourceReference Methods
  CreateLocalResource Method
  Dispose Method
  GetReferenceInformation Method
  GetResourceShortDisplayName Method
  GetResourceVersionStatus Method
  HasValidDisplayPath Method
  IsValidReference Method
  ExternalResourceReference Properties
  InSessionPath Property
  IsValidObject Property
  ServerId Property
  Version Property
  ExternalResourceServerExtensions Class
  ExternalResourceServerExtensions Members
  ExternalResourceServerExtensions Methods
  Dispose Method
  GetRevitLinkOperations Method
  ExternalResourceServerExtensions Properties
  IsValidObject Property
  ExternalResourceServerUtils Class
  ExternalResourceServerUtils Members
  ExternalResourceServerUtils Methods
  IsValidShortName Method
  ServerSupportsAssemblyCodeData Method
  ServerSupportsKeynotes Method
  ServerSupportsRevitLinks Method
  ExternalResourceServiceUtils Class
  ExternalResourceServiceUtils Members
  ExternalResourceServiceUtils Methods
  GetServersByType Method
  ExternalResourceType Class
  ExternalResourceType Members
  ExternalResourceType Constructor
  ExternalResourceType Methods
  ExternalResourceType Operators
  Equality Operator
  Inequality Operator
  ExternalResourceType Properties
  ExternalResourceTypes Class
  ExternalResourceTypes.BuiltInExternalResourceTypes Class
  ExternalResourceTypes.BuiltInExternalResourceTypes Members
  ExternalResourceTypes.BuiltInExternalResourceTypes Properties
  AssemblyCodeTable Property
  KeynoteTable Property
  RevitLink Property
  ExternalResourceUIBrowseResultType Enumeration
  ExternalResourceUtils Class
  ExternalResourceUtils Members
  ExternalResourceUtils Methods
  GetAllExternalResourceReferences Method
  GetAllExternalResourceReferences Method (Document)
  GetAllExternalResourceReferences Method (Document, ExternalResourceType)
  Extrusion Class
  Extrusion Members
  Extrusion Methods
  Extrusion Properties
  EndOffset Property
  Parameter Property
  Sketch Property
  StartOffset Property
  ExtrusionAnalyzer Class
  ExtrusionAnalyzer Members
  ExtrusionAnalyzer Methods
  CalculateFaceAlignment Method
  Create Method
  Dispose Method
  GetExtrusionBase Method
  ExtrusionAnalyzer Properties
  EndParameter Property
  ExtrusionDirection Property
  IsValidObject Property
  StartParameter Property
  ExtrusionAnalyzerFaceAlignment Enumeration
  ExtrusionRoof Class
  ExtrusionRoof Members
  ExtrusionRoof Methods
  GetProfile Method
  ExtrusionRoof Properties
  CurtainGrids Property
  Parameter Property
  Face Class
  Face Members
  Face Methods
  ComputeDerivatives Method
  ComputeNormal Method
  Evaluate Method
  GetBoundingBox Method
  GetEdgesAsCurveLoops Method
  GetRegions Method
  Intersect Method
  Intersect Method (Curve)
  Intersect Method (Face)
  Intersect Method (Curve, IntersectionResultArray)
  Intersect Method (Face, Curve)
  IsInside Method
  IsInside Method (UV)
  IsInside Method (UV, IntersectionResult)
  Project Method
  Triangulate Method
  Triangulate Method
  Triangulate Method (Double)
  Face Properties
  Area Property
  EdgeLoops Property
  HasRegions Property
  IsCyclic Property
  IsTwoSided Property
  MaterialElementId Property
  Period Property
  Reference Property
  FaceArray Class
  FaceArray Members
  FaceArray Constructor
  FaceArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  FaceArray Properties
  IsEmpty Property
  Item Property
  Size Property
  FaceArrayIterator Class
  FaceArrayIterator Members
  FaceArrayIterator Constructor
  FaceArrayIterator Methods
  MoveNext Method
  Reset Method
  FaceArrayIterator Properties
  Current Property
  FaceIntersectionFaceResult Enumeration
  FaceNode Class
  FaceNode Members
  FaceNode Methods
  GetFace Method
  FaceNode Properties
  FaceSplitter Class
  FaceSplitter Members
  FaceSplitter Methods
  FaceSplitter Properties
  Parameter Property
  SplitElementId Property
  FacetingUtils Class
  FacetingUtils Members
  FacetingUtils Methods
  ConvertTrianglesToQuads Method
  FaceWall Class
  FaceWall Members
  FaceWall Methods
  Create Method
  IsValidFaceReferenceForFaceWall Method
  IsWallTypeValidForFaceWall Method
  FaceWall Properties
  Parameter Property
  FailureDefinition Class
  FailureDefinition Members
  FailureDefinition Methods
  AddResolutionType Method
  CreateFailureDefinition Method
  Dispose Method
  GetApplicableResolutionTypes Method
  GetDefaultResolutionType Method
  GetDescriptionText Method
  GetResolutionCaption Method
  HasResolutions Method
  IsResolutionApplicable Method
  SetDefaultResolutionType Method
  FailureDefinition Properties
  IsValidObject Property
  Severity Property
  FailureDefinitionAccessor Class
  FailureDefinitionAccessor Members
  FailureDefinitionAccessor Methods
  Dispose Method
  GetApplicableResolutionTypes Method
  GetDefaultResolutionType Method
  GetDescriptionText Method
  GetId Method
  GetResolutionCaption Method
  GetSeverity Method
  HasResolutions Method
  IsResolutionApplicable Method
  SetDefaultResolutionType Method
  FailureDefinitionAccessor Properties
  IsValidObject Property
  FailureDefinitionId Class
  FailureDefinitionId Members
  FailureDefinitionId Constructor
  FailureDefinitionId Methods
  FailureDefinitionId Operators
  Equality Operator
  Inequality Operator
  FailureDefinitionId Properties
  FailureDefinitionRegistry Class
  FailureDefinitionRegistry Members
  FailureDefinitionRegistry Methods
  Dispose Method
  FindFailureDefinition Method
  ListAllFailureDefinitions Method
  FailureDefinitionRegistry Properties
  IsValidObject Property
  FailureHandlingOptions Class
  FailureHandlingOptions Members
  FailureHandlingOptions Methods
  Dispose Method
  GetClearAfterRollback Method
  GetDelayedMiniWarnings Method
  GetFailuresPreprocessor Method
  GetForcedModalHandling Method
  GetTransactionFinalizer Method
  SetClearAfterRollback Method
  SetDelayedMiniWarnings Method
  SetFailuresPreprocessor Method
  SetForcedModalHandling Method
  SetTransactionFinalizer Method
  FailureHandlingOptions Properties
  IsValidObject Property
  FailureMessage Class
  FailureMessage Members
  FailureMessage Constructor
  FailureMessage Methods
  AddResolution Method
  Dispose Method
  GetAdditionalElements Method
  GetDefaultResolutionCaption Method
  GetDescriptionText Method
  GetFailingElements Method
  GetFailureDefinitionId Method
  GetSeverity Method
  HasResolutionOfType Method
  HasResolutions Method
  SetAdditionalElement Method
  SetAdditionalElements Method
  SetFailingElement Method
  SetFailingElements Method
  FailureMessage Properties
  IsValidObject Property
  FailureMessageAccessor Class
  FailureMessageAccessor Members
  FailureMessageAccessor Methods
  CloneFailureMessage Method
  Dispose Method
  GetAdditionalElementIds Method
  GetCurrentResolutionType Method
  GetDefaultResolutionCaption Method
  GetDescriptionText Method
  GetFailingElementIds Method
  GetFailureDefinitionId Method
  GetNumberOfResolutions Method
  GetSeverity Method
  HasResolutionOfType Method
  HasResolutions Method
  SetCurrentResolutionType Method
  ShouldMergeWithMessage Method
  FailureMessageAccessor Properties
  IsValidObject Property
  FailureMessageKey Class
  FailureMessageKey Members
  FailureMessageKey Constructor
  FailureMessageKey Methods
  Dispose Method
  Equals Method
  GetHashCode Method
  IsEqual Method
  IsValid Method
  FailureMessageKey Operators
  Equality Operator
  Inequality Operator
  FailureMessageKey Properties
  IsValidObject Property
  FailureProcessingResult Enumeration
  FailureResolution Class
  FailureResolution Members
  FailureResolution Methods
  Dispose Method
  FailureResolution Properties
  IsValidObject Property
  FailureResolutionType Enumeration
  FailuresAccessor Class
  FailuresAccessor Members
  FailuresAccessor Methods
  CanCommitPendingTransaction Method
  CanRollBackPendingTransaction Method
  CommitPendingTransaction Method
  DeleteAllWarnings Method
  DeleteElements Method
  DeleteWarning Method
  Dispose Method
  GetAttemptedResolutionTypes Method
  GetDocument Method
  GetFailureHandlingOptions Method
  GetFailureMessages Method
  GetFailureMessages Method
  GetFailureMessages Method (FailureSeverity)
  GetSeverity Method
  GetTransactionName Method
  IsActive Method
  IsElementsDeletionPermitted Method
  IsElementsDeletionPermitted Method
  IsElementsDeletionPermitted Method (IList(ElementId))
  IsElementsDeletionPermitted Method (IList(ElementId), String)
  IsFailureResolutionPermitted Method
  IsFailureResolutionPermitted Method
  IsFailureResolutionPermitted Method (FailureMessageAccessor)
  IsFailureResolutionPermitted Method (FailureMessageAccessor, FailureResolutionType)
  IsPending Method
  IsTransactionBeingCommitted Method
  JournalFailures Method
  PostFailure Method
  ReplaceFailures Method
  ResolveFailure Method
  ResolveFailures Method
  RollBackPendingTransaction Method
  SetFailureHandlingOptions Method
  SetTransactionName Method
  FailuresAccessor Properties
  IsValidObject Property
  FailureSeverity Enumeration
  Family Class
  Family Members
  Family Methods
  ExtractPartAtom Method
  GetFamilySymbolIds Method
  HasStructuralSection Method
  IsAppropriateCategoryId Method
  Family Properties
  CurtainPanelHorizontalSpacing Property
  CurtainPanelTilePattern Property
  CurtainPanelVerticalSpacing Property
  FamilyCategory Property
  FamilyCategoryId Property
  FamilyPlacementType Property
  IsConceptualMassFamily Property
  IsCurtainPanelFamily Property
  IsEditable Property
  IsInPlace Property
  IsOwnerFamily Property
  IsUserCreated Property
  Parameter Property
  ShowSpatialElementCalculationPoint Property
  StructuralMaterialType Property
  StructuralSectionShape Property
  Symbols Property
  FamilyElementVisibility Class
  FamilyElementVisibility Members
  FamilyElementVisibility Constructor
  FamilyElementVisibility Methods
  FamilyElementVisibility Properties
  IsShownInCoarse Property
  IsShownInFine Property
  IsShownInFrontBack Property
  IsShownInLeftRight Property
  IsShownInMedium Property
  IsShownInPlanRCPCut Property
  IsShownInTopBottom Property
  IsShownOnlyWhenCut Property
  VisibilityType Property
  FamilyElementVisibilityType Enumeration
  FamilyHostingBehavior Enumeration
  FamilyInstance Class
  FamilyInstance Members
  FamilyInstance Methods
  AddCoping Method
  flipFacing Method
  FlipFromToRoom Method
  flipHand Method
  GetCopingIds Method
  GetFamilyPointPlacementReferences Method
  GetOriginalGeometry Method
  GetSubComponentIds Method
  RemoveCoping Method
  rotate Method
  SetCopingIds Method
  FamilyInstance Properties
  CanFlipFacing Property
  CanFlipHand Property
  CanFlipWorkPlane Property
  CanRotate Property
  ExtensionUtility Property
  FacingFlipped Property
  FacingOrientation Property
  FromRoom Property
  FromRoom Property
  FromRoom Property (Phase)
  HandFlipped Property
  HandOrientation Property
  Host Property
  HostFace Property
  HostParameter Property
  Invisible Property
  IsSlantedColumn Property
  IsWorkPlaneFlipped Property
  Location Property
  MEPModel Property
  Mirrored Property
  Parameter Property
  Room Property
  Room Property
  Room Property (Phase)
  Space Property
  Space Property
  Space Property (Phase)
  StructuralMaterialId Property
  StructuralMaterialType Property
  StructuralType Property
  StructuralUsage Property
  SuperComponent Property
  Symbol Property
  ToRoom Property
  ToRoom Property
  ToRoom Property (Phase)
  FamilyInstanceFilter Class
  FamilyInstanceFilter Members
  FamilyInstanceFilter Constructor
  FamilyInstanceFilter Methods
  PassesFilter Method
  FamilyInstanceFilter Properties
  FamilySymbolId Property
  FamilyManager Class
  FamilyManager Members
  FamilyManager Methods
  AddParameter Method
  AddParameter Method (ExternalDefinition, BuiltInParameterGroup, Boolean)
  AddParameter Method (String, BuiltInParameterGroup, Category, Boolean)
  AddParameter Method (String, BuiltInParameterGroup, ParameterType, Boolean)
  AssociateElementParameterToFamilyParameter Method
  CanElementParameterBeAssociated Method
  DeleteCurrentType Method
  GetAssociatedFamilyParameter Method
  GetParameters Method
  IsParameterLockable Method
  IsParameterLocked Method
  IsUserAssignableParameterGroup Method
  MakeInstance Method
  MakeNonReporting Method
  MakeReporting Method
  MakeType Method
  NewType Method
  RemoveParameter Method
  RenameCurrentType Method
  RenameParameter Method
  ReorderParameters Method
  ReplaceParameter Method
  ReplaceParameter Method (FamilyParameter, ExternalDefinition, BuiltInParameterGroup, Boolean)
  ReplaceParameter Method (FamilyParameter, String, BuiltInParameterGroup, Boolean)
  Set Method
  Set Method (FamilyParameter, ElementId)
  Set Method (FamilyParameter, Double)
  Set Method (FamilyParameter, Int32)
  Set Method (FamilyParameter, String)
  SetDescription Method
  SetFormula Method
  SetParameterLocked Method
  SetValueString Method
  SortParameters Method
  FamilyManager Properties
  CurrentType Property
  Parameter Property
  Parameter Property (Guid)
  Parameter Property (String)
  Parameter Property (BuiltInParameter)
  Parameter Property (Definition)
  Parameters Property
  Types Property
  FamilyParameter Class
  FamilyParameter Members
  FamilyParameter Methods
  FamilyParameter Properties
  AssociatedParameters Property
  CanAssignFormula Property
  Definition Property
  DisplayUnitType Property
  Formula Property
  GUID Property
  Id Property
  IsDeterminedByFormula Property
  IsInstance Property
  IsReadOnly Property
  IsReporting Property
  IsShared Property
  StorageType Property
  UserModifiable Property
  FamilyParameterSet Class
  FamilyParameterSet Members
  FamilyParameterSet Constructor
  FamilyParameterSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  FamilyParameterSet Properties
  IsEmpty Property
  Size Property
  FamilyParameterSetIterator Class
  FamilyParameterSetIterator Members
  FamilyParameterSetIterator Constructor
  FamilyParameterSetIterator Methods
  MoveNext Method
  Reset Method
  FamilyParameterSetIterator Properties
  Current Property
  FamilyPlacementType Enumeration
  FamilyPointLocation Class
  FamilyPointLocation Members
  FamilyPointLocation Methods
  FamilyPointLocation Properties
  IsValidObject Property
  Location Property
  Name Property
  FamilyPointPlacementReference Class
  FamilyPointPlacementReference Members
  FamilyPointPlacementReference Methods
  FamilyPointPlacementReference Properties
  Location Property
  Name Property
  PointReference Property
  FamilySizeTable Class
  FamilySizeTable Members
  FamilySizeTable Methods
  AsValueString Method
  Dispose Method
  GetColumnHeader Method
  IsValidColumnIndex Method
  FamilySizeTable Properties
  IsValidObject Property
  NumberOfColumns Property
  NumberOfRows Property
  FamilySizeTableColumn Class
  FamilySizeTableColumn Members
  FamilySizeTableColumn Methods
  Dispose Method
  FamilySizeTableColumn Properties
  DisplayUnitType Property
  IsValidObject Property
  Name Property
  UnitType Property
  FamilySizeTableErrorInfo Class
  FamilySizeTableErrorInfo Members
  FamilySizeTableErrorInfo Constructor
  FamilySizeTableErrorInfo Methods
  Dispose Method
  FamilySizeTableErrorInfo Properties
  FamilySizeTableErrorType Property
  FilePath Property
  InvalidColumnIndex Property
  InvalidHeaderText Property
  InvalidRowIndex Property
  IsValidObject Property
  FamilySizeTableErrorType Enumeration
  FamilySizeTableManager Class
  FamilySizeTableManager Members
  FamilySizeTableManager Methods
  CreateFamilySizeTableManager Method
  Dispose Method
  ExportSizeTable Method
  GetAllSizeTableNames Method
  GetFamilySizeTableManager Method
  GetSizeTable Method
  HasSizeTable Method
  ImportSizeTable Method
  RemoveSizeTable Method
  FamilySizeTableManager Properties
  IsValidObject Property
  NumberOfSizeTables Property
  FamilySource Enumeration
  FamilySymbol Class
  FamilySymbol Members
  FamilySymbol Methods
  Activate Method
  GetFamilyPointLocations Method
  GetStructuralSection Method
  GetThermalProperties Method
  HasStructuralSection Method
  HasThermalProperties Method
  SetStructuralSection Method
  SetThermalProperties Method
  FamilySymbol Properties
  Family Property
  IsActive Property
  Parameter Property
  StructuralMaterialType Property
  FamilySymbolFilter Class
  FamilySymbolFilter Members
  FamilySymbolFilter Constructor
  FamilySymbolFilter Methods
  PassesFilter Method
  FamilySymbolFilter Properties
  FamilyId Property
  FamilySymbolProfile Class
  FamilySymbolProfile Members
  FamilySymbolProfile Methods
  FamilySymbolProfile Properties
  Angle Property
  IsFlipped Property
  Profile Property
  XOffset Property
  YOffset Property
  FamilySymbolSet Class
  FamilySymbolSet Members
  FamilySymbolSet Constructor
  FamilySymbolSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  FamilySymbolSet Properties
  IsEmpty Property
  Size Property
  FamilySymbolSetIterator Class
  FamilySymbolSetIterator Members
  FamilySymbolSetIterator Constructor
  FamilySymbolSetIterator Methods
  MoveNext Method
  Reset Method
  FamilySymbolSetIterator Properties
  Current Property
  FamilyThermalProperties Class
  FamilyThermalProperties Members
  FamilyThermalProperties Constructor
  FamilyThermalProperties Methods
  Dispose Method
  Find Method
  IsValid Method
  FamilyThermalProperties Properties
  AnalyticConstructionName Property
  AnalyticConstructionTypeId Property
  HeatTransferCoefficient Property
  IsValidObject Property
  SolarHeatGainCoefficient Property
  ThermalResistance Property
  VisualLightTransmittance Property
  FamilyType Class
  FamilyType Members
  FamilyType Methods
  AsDouble Method
  AsElementId Method
  AsInteger Method
  AsString Method
  AsValueString Method
  HasValue Method
  FamilyType Properties
  Name Property
  FamilyTypeSet Class
  FamilyTypeSet Members
  FamilyTypeSet Constructor
  FamilyTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  FamilyTypeSet Properties
  IsEmpty Property
  Size Property
  FamilyTypeSetIterator Class
  FamilyTypeSetIterator Members
  FamilyTypeSetIterator Constructor
  FamilyTypeSetIterator Methods
  MoveNext Method
  Reset Method
  FamilyTypeSetIterator Properties
  Current Property
  FamilyUtils Class
  FamilyUtils Members
  FamilyUtils Methods
  ConvertFamilyToFaceHostBased Method
  FamilyCanConvertToFaceHostBased Method
  GetProfileSymbols Method
  FBXExportOptions Class
  FBXExportOptions Members
  FBXExportOptions Constructor
  FBXExportOptions Methods
  FBXExportOptions Properties
  LevelsOfDetailValue Property
  StopOnError Property
  UseLevelsOfDetail Property
  WithoutBoundaryEdges Property
  FilePath Class
  FilePath Members
  FilePath Constructor
  FilePath Methods
  FilePath Properties
  FilledRegion Class
  FilledRegion Members
  FilledRegion Methods
  Create Method
  GetBoundaries Method
  GetValidLineStyleIdsForFilledRegion Method
  IsValidFilledRegionTypeId Method
  IsValidLineStyleIdForFilledRegion Method
  SetLineStyleId Method
  FilledRegion Properties
  IsMasking Property
  Parameter Property
  FilledRegionBackground Enumeration
  FilledRegionType Class
  FilledRegionType Members
  FilledRegionType Methods
  IsValidLineWeight Method
  FilledRegionType Properties
  Background Property
  Color Property
  FillPatternId Property
  LineWeight Property
  Parameter Property
  FillGrid Class
  FillGrid Members
  FillGrid Constructor
  FillGrid Constructor
  FillGrid Constructor (FillGrid)
  FillGrid Constructor (Double, Double)
  FillGrid Methods
  CalculateLengthPerArea Method
  CalculateLinesPerLength Method
  CalculateStrokesPerArea Method
  Dispose Method
  GetHatchingDirection Method
  GetPointLineZone Method
  GetPointLineZone Method (UV)
  GetPointLineZone Method (UV, UV)
  GetSegmentDirection Method
  GetSegments Method
  IsEqual Method
  SetSegments Method
  FillGrid Properties
  Angle Property
  IsValidObject Property
  Offset Property
  Origin Property
  Shift Property
  FillPattern Class
  FillPattern Members
  FillPattern Constructor
  FillPattern Constructor
  FillPattern Constructor (FillPattern)
  FillPattern Constructor (String, FillPatternTarget, FillPatternHostOrientation)
  FillPattern Constructor (String, FillPatternTarget, FillPatternHostOrientation, Double, Double)
  FillPattern Constructor (String, FillPatternTarget, FillPatternHostOrientation, Double, Double, Double)
  FillPattern Methods
  Dispose Method
  ExpandDots Method
  GetFillGrid Method
  GetFillGrids Method
  IsEqual Method
  SetFillGrid Method
  SetFillGrids Method
  FillPattern Properties
  GridCount Property
  HostOrientation Property
  IsSolidFill Property
  IsValidObject Property
  LengthPerArea Property
  LinesPerLength Property
  Name Property
  StrokesPerArea Property
  Target Property
  FillPatternElement Class
  FillPatternElement Members
  FillPatternElement Methods
  Create Method
  GetFillPattern Method
  GetFillPatternElementByName Method
  SetFillPattern Method
  FillPatternElement Properties
  Parameter Property
  FillPatternHostOrientation Enumeration
  FillPatternTarget Enumeration
  FilterableValueProvider Class
  FilterableValueProvider Members
  FilterableValueProvider Methods
  Dispose Method
  GetDoubleValue Method
  GetElementIdValue Method
  GetIntegerValue Method
  GetStringValue Method
  IsDoubleValueSupported Method
  IsElementIdValueSupported Method
  IsIntegerValueSupported Method
  IsStringValueSupported Method
  FilterableValueProvider Properties
  IsValidObject Property
  FilterCategoryRule Class
  FilterCategoryRule Members
  FilterCategoryRule Constructor
  FilterCategoryRule Methods
  AllCategoriesFilterable Method
  GetCategories Method
  SetCategories Method
  FilterCategoryRule Properties
  FilterDoubleRule Class
  FilterDoubleRule Members
  FilterDoubleRule Constructor
  FilterDoubleRule Methods
  FilterDoubleRule Properties
  Epsilon Property
  RuleValue Property
  FilteredElementCollector Class
  FilteredElementCollector Members
  FilteredElementCollector Constructor
  FilteredElementCollector Constructor (Document)
  FilteredElementCollector Constructor (Document, ElementId)
  FilteredElementCollector Constructor (Document, ICollection(ElementId))
  FilteredElementCollector Methods
  ContainedInDesignOption Method
  Dispose Method
  Excluding Method
  FirstElement Method
  FirstElementId Method
  GetBasicIEnumerator Method
  GetElementIdIterator Method
  GetElementIterator Method
  GetEnumerator Method
  IntersectWith Method
  IsViewValidForElementIteration Method
  OfCategory Method
  OfCategoryId Method
  OfClass Method
  OwnedByView Method
  ToElementIds Method
  ToElements Method
  UnionWith Method
  WhereElementIsCurveDriven Method
  WhereElementIsElementType Method
  WhereElementIsNotElementType Method
  WhereElementIsViewIndependent Method
  WherePasses Method
  FilteredElementCollector Properties
  IsValidObject Property
  FilteredElementIdIterator Class
  FilteredElementIdIterator Members
  FilteredElementIdIterator Methods
  Dispose Method
  GetCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  FilteredElementIdIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  FilteredElementIterator Class
  FilteredElementIterator Members
  FilteredElementIterator Methods
  Dispose Method
  GetCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  FilteredElementIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  FilteredWorksetCollector Class
  FilteredWorksetCollector Members
  FilteredWorksetCollector Constructor
  FilteredWorksetCollector Methods
  Dispose Method
  FirstWorkset Method
  FirstWorksetId Method
  GetEnumerator Method
  GetWorksetIdIterator Method
  GetWorksetIterator Method
  OfKind Method
  ToWorksetIds Method
  ToWorksets Method
  WherePasses Method
  FilteredWorksetCollector Properties
  IsValidObject Property
  FilteredWorksetIdIterator Class
  FilteredWorksetIdIterator Members
  FilteredWorksetIdIterator Methods
  Dispose Method
  GetCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  FilteredWorksetIdIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  FilteredWorksetIterator Class
  FilteredWorksetIterator Members
  FilteredWorksetIterator Methods
  Dispose Method
  GetCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  FilteredWorksetIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  FilterElement Class
  FilterElement Members
  FilterElement Methods
  IsNameUnique Method
  IsNameUnique Method (String)
  IsNameUnique Method (Document, String)
  FilterElement Properties
  Parameter Property
  FilterElementIdRule Class
  FilterElementIdRule Members
  FilterElementIdRule Constructor
  FilterElementIdRule Methods
  FilterElementIdRule Properties
  RuleValue Property
  FilterIntegerRule Class
  FilterIntegerRule Members
  FilterIntegerRule Constructor
  FilterIntegerRule Methods
  FilterIntegerRule Properties
  RuleValue Property
  FilterInverseRule Class
  FilterInverseRule Members
  FilterInverseRule Constructor
  FilterInverseRule Methods
  GetInnerRule Method
  SetInnerRule Method
  FilterInverseRule Properties
  FilterNumericEquals Class
  FilterNumericEquals Members
  FilterNumericEquals Constructor
  FilterNumericEquals Methods
  Evaluate Method
  FilterNumericEquals Properties
  FilterNumericGreater Class
  FilterNumericGreater Members
  FilterNumericGreater Constructor
  FilterNumericGreater Methods
  Evaluate Method
  FilterNumericGreater Properties
  FilterNumericGreaterOrEqual Class
  FilterNumericGreaterOrEqual Members
  FilterNumericGreaterOrEqual Constructor
  FilterNumericGreaterOrEqual Methods
  Evaluate Method
  FilterNumericGreaterOrEqual Properties
  FilterNumericLess Class
  FilterNumericLess Members
  FilterNumericLess Constructor
  FilterNumericLess Methods
  Evaluate Method
  FilterNumericLess Properties
  FilterNumericLessOrEqual Class
  FilterNumericLessOrEqual Members
  FilterNumericLessOrEqual Constructor
  FilterNumericLessOrEqual Methods
  Evaluate Method
  FilterNumericLessOrEqual Properties
  FilterNumericRuleEvaluator Class
  FilterNumericRuleEvaluator Members
  FilterNumericRuleEvaluator Methods
  Dispose Method
  Evaluate Method
  Evaluate Method (Int32, Int32)
  Evaluate Method (Double, Double, Double)
  FilterNumericRuleEvaluator Properties
  IsValidObject Property
  FilterNumericValueRule Class
  FilterNumericValueRule Members
  FilterNumericValueRule Methods
  GetEvaluator Method
  SetEvaluator Method
  FilterNumericValueRule Properties
  FilterRule Class
  FilterRule Members
  FilterRule Methods
  Dispose Method
  ElementPasses Method
  FilterRule Properties
  IsValidObject Property
  FilterStringBeginsWith Class
  FilterStringBeginsWith Members
  FilterStringBeginsWith Constructor
  FilterStringBeginsWith Methods
  FilterStringBeginsWith Properties
  FilterStringContains Class
  FilterStringContains Members
  FilterStringContains Constructor
  FilterStringContains Methods
  FilterStringContains Properties
  FilterStringEndsWith Class
  FilterStringEndsWith Members
  FilterStringEndsWith Constructor
  FilterStringEndsWith Methods
  FilterStringEndsWith Properties
  FilterStringEquals Class
  FilterStringEquals Members
  FilterStringEquals Constructor
  FilterStringEquals Methods
  FilterStringEquals Properties
  FilterStringGreater Class
  FilterStringGreater Members
  FilterStringGreater Constructor
  FilterStringGreater Methods
  FilterStringGreater Properties
  FilterStringGreaterOrEqual Class
  FilterStringGreaterOrEqual Members
  FilterStringGreaterOrEqual Constructor
  FilterStringGreaterOrEqual Methods
  FilterStringGreaterOrEqual Properties
  FilterStringLess Class
  FilterStringLess Members
  FilterStringLess Constructor
  FilterStringLess Methods
  FilterStringLess Properties
  FilterStringLessOrEqual Class
  FilterStringLessOrEqual Members
  FilterStringLessOrEqual Constructor
  FilterStringLessOrEqual Methods
  FilterStringLessOrEqual Properties
  FilterStringRule Class
  FilterStringRule Members
  FilterStringRule Constructor
  FilterStringRule Methods
  GetEvaluator Method
  SetEvaluator Method
  FilterStringRule Properties
  RuleString Property
  FilterStringRuleEvaluator Class
  FilterStringRuleEvaluator Members
  FilterStringRuleEvaluator Methods
  Dispose Method
  Evaluate Method
  FilterStringRuleEvaluator Properties
  IsValidObject Property
  FilterValueRule Class
  FilterValueRule Members
  FilterValueRule Methods
  FilterValueRule Properties
  FindReferenceTarget Enumeration
  FitDirectionType Enumeration
  FittingAndAccessoryCalculationType Enumeration
  FittingAngleUsage Enumeration
  Floor Class
  Floor Members
  Floor Methods
  GetNormalAtVerticalProjectionPoint Method
  GetSpanDirectionSymbolIds Method
  GetVerticalProjectionPoint Method
  Floor Properties
  FloorType Property
  Parameter Property
  SlabShapeEditor Property
  SpanDirectionAngle Property
  StructuralUsage Property
  FloorFace Enumeration
  FloorType Class
  FloorType Members
  FloorType Methods
  FloorType Properties
  IsFoundationSlab Property
  Parameter Property
  StructuralMaterialId Property
  ThermalProperties Property
  FloorTypeSet Class
  FloorTypeSet Members
  FloorTypeSet Constructor
  FloorTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  FloorTypeSet Properties
  IsEmpty Property
  Size Property
  FloorTypeSetIterator Class
  FloorTypeSetIterator Members
  FloorTypeSetIterator Constructor
  FloorTypeSetIterator Methods
  MoveNext Method
  Reset Method
  FloorTypeSetIterator Properties
  Current Property
  FlowDirectionType Enumeration
  FolderItemInfo Class
  FolderItemInfo Members
  FolderItemInfo Methods
  Dispose Method
  FolderItemInfo Properties
  ElementId Property
  IsValidObject Property
  Name Property
  FootPrintRoof Class
  FootPrintRoof Members
  FootPrintRoof Methods
  GetProfiles Method
  FootPrintRoof Properties
  CurtainGrids Property
  DefinesSlope Property
  ExtendIntoWall Property
  Offset Property
  Overhang Property
  Parameter Property
  SlopeAngle Property
  Form Class
  Form Members
  Form Methods
  AddEdge Method
  AddEdge Method (Reference, Reference)
  AddEdge Method (Reference, XYZ)
  AddEdge Method (Reference, Double, Reference, Double)
  AddProfile Method
  CanManipulateProfile Method
  CanManipulateSubElement Method
  ConstrainProfiles Method
  DeleteProfile Method
  DeleteSubElement Method
  GetControlPoints Method
  GetCurvesAndEdgesReference Method
  GetPathCurveIndexByCurveReference Method
  GetProfileAndCurveLoopIndexFromReference Method
  IsAutoCreaseEdge Method
  IsBeginningFace Method
  IsConnectingEdge Method
  IsCurveReference Method
  IsEdgeReference Method
  IsEndFace Method
  IsFaceReference Method
  IsProfileEdge Method
  IsReferenceOnlyProfile Method
  IsSideFace Method
  IsVertexReference Method
  MoveProfile Method
  MoveSubElement Method
  Rehost Method
  Rehost Method (Reference, XYZ)
  Rehost Method (SketchPlane, XYZ)
  RotateProfile Method
  RotateSubElement Method
  ScaleProfile Method
  ScaleSubElement Method
  Form Properties
  AreProfilesConstrained Property
  BaseOffset Property
  CurveLoopReferencesOnProfile Property
  HasOneOrMoreReferenceProfiles Property
  HasOpenGeometry Property
  IsInXRayMode Property
  Parameter Property
  PathCurveCount Property
  PathCurveReference Property
  ProfileCount Property
  ProfileCurveLoopCount Property
  TopOffset Property
  FormArray Class
  FormArray Members
  FormArray Constructor
  FormArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  FormArray Properties
  IsEmpty Property
  Item Property
  Size Property
  FormArrayIterator Class
  FormArrayIterator Members
  FormArrayIterator Constructor
  FormArrayIterator Methods
  MoveNext Method
  Reset Method
  FormArrayIterator Properties
  Current Property
  FormatOptions Class
  FormatOptions Members
  FormatOptions Constructor
  FormatOptions Constructor
  FormatOptions Constructor (DisplayUnitType)
  FormatOptions Constructor (FormatOptions)
  FormatOptions Constructor (DisplayUnitType, UnitSymbolType)
  FormatOptions Constructor (DisplayUnitType, Double)
  FormatOptions Constructor (UnitSymbolType, DisplayUnitType)
  FormatOptions Constructor (DisplayUnitType, UnitSymbolType, Double)
  FormatOptions Methods
  CanHaveUnitSymbol Method
  CanHaveUnitSymbol Method
  CanHaveUnitSymbol Method (DisplayUnitType)
  CanSuppressLeadingZeros Method
  CanSuppressLeadingZeros Method
  CanSuppressLeadingZeros Method (DisplayUnitType)
  CanSuppressSpaces Method
  CanSuppressSpaces Method
  CanSuppressSpaces Method (DisplayUnitType)
  CanSuppressTrailingZeros Method
  CanSuppressTrailingZeros Method
  CanSuppressTrailingZeros Method (DisplayUnitType)
  CanUsePlusPrefix Method
  CanUsePlusPrefix Method
  CanUsePlusPrefix Method (DisplayUnitType)
  Dispose Method
  GetName Method
  GetRounding Method
  GetValidUnitSymbols Method
  GetValidUnitSymbols Method
  GetValidUnitSymbols Method (DisplayUnitType)
  HasRounding Method
  IsValidAccuracy Method
  IsValidAccuracy Method (Double)
  IsValidAccuracy Method (DisplayUnitType, Double)
  IsValidForUnitType Method
  IsValidUnitSymbol Method
  IsValidUnitSymbol Method (UnitSymbolType)
  IsValidUnitSymbol Method (DisplayUnitType, UnitSymbolType)
  FormatOptions Properties
  Accuracy Property
  DisplayUnits Property
  IsValidObject Property
  SuppressLeadingZeros Property
  SuppressSpaces Property
  SuppressTrailingZeros Property
  UnitSymbol Property
  UseDefault Property
  UseDigitGrouping Property
  UseGrouping Property
  UsePlusPrefix Property
  FormatUtils Class
  FormatUtils Members
  FormatUtils Methods
  Format Method
  FormatValueOptions Class
  FormatValueOptions Members
  FormatValueOptions Constructor
  FormatValueOptions Methods
  AreValidForUnitType Method
  Dispose Method
  GetFormatOptions Method
  SetFormatOptions Method
  FormatValueOptions Properties
  AppendUnitSymbol Property
  IsValidObject Property
  FormUtils Class
  FormUtils Members
  FormUtils Methods
  CanBeDissolved Method
  DissolveForms Method
  DissolveForms Method (Document, ICollection(ElementId))
  DissolveForms Method (Document, ICollection(ElementId), ICollection(ElementId))
  Frame Class
  Frame Members
  Frame Constructor
  Frame Constructor
  Frame Constructor (XYZ, XYZ, XYZ, XYZ)
  Frame Methods
  Dispose Method
  IsOrthogonal Method
  IsOrthonormal Method
  IsRightHanded Method
  Transform Method
  Frame Properties
  BasisX Property
  BasisY Property
  BasisZ Property
  IsValidObject Property
  Origin Property
  FreeFormElement Class
  FreeFormElement Members
  FreeFormElement Methods
  CanOffsetFace Method
  Create Method
  SetFaceOffset Method
  UpdateSolidGeometry Method
  FreeFormElement Properties
  Parameter Property
  GBXMLExportOptions Class
  GBXMLExportOptions Members
  GBXMLExportOptions Constructor
  GBXMLExportOptions Methods
  Dispose Method
  GBXMLExportOptions Properties
  ExportEnergyModelType Property
  IsValidObject Property
  GBXMLImportOptions Class
  GBXMLImportOptions Members
  GBXMLImportOptions Constructor
  GBXMLImportOptions Methods
  GenericForm Class
  GenericForm Members
  GenericForm Methods
  GetVisibility Method
  SetVisibility Method
  GenericForm Properties
  IsSolid Property
  Name Property
  Parameter Property
  Subcategory Property
  Visible Property
  GenericFormSet Class
  GenericFormSet Members
  GenericFormSet Constructor
  GenericFormSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  GenericFormSet Properties
  IsEmpty Property
  Size Property
  GenericFormSetIterator Class
  GenericFormSetIterator Members
  GenericFormSetIterator Constructor
  GenericFormSetIterator Methods
  MoveNext Method
  Reset Method
  GenericFormSetIterator Properties
  Current Property
  GenericImportOptions Class
  GenericImportOptions Members
  GenericImportOptions Methods
  GenericImportOptions Properties
  RefPoint Property
  GeomCombination Class
  GeomCombination Members
  GeomCombination Methods
  GeomCombination Properties
  AllMembers Property
  Parameter Property
  GeomCombinationSet Class
  GeomCombinationSet Members
  GeomCombinationSet Constructor
  GeomCombinationSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  GeomCombinationSet Properties
  IsEmpty Property
  Size Property
  GeomCombinationSetIterator Class
  GeomCombinationSetIterator Members
  GeomCombinationSetIterator Constructor
  GeomCombinationSetIterator Methods
  MoveNext Method
  Reset Method
  GeomCombinationSetIterator Properties
  Current Property
  GeometryCreationUtilities Class
  GeometryCreationUtilities Members
  GeometryCreationUtilities Methods
  CreateBlendGeometry Method
  CreateBlendGeometry Method (CurveLoop, CurveLoop, ICollection(VertexPair))
  CreateBlendGeometry Method (CurveLoop, CurveLoop, ICollection(VertexPair), SolidOptions)
  CreateExtrusionGeometry Method
  CreateExtrusionGeometry Method (IList(CurveLoop), XYZ, Double)
  CreateExtrusionGeometry Method (IList(CurveLoop), XYZ, Double, SolidOptions)
  CreateRevolvedGeometry Method
  CreateRevolvedGeometry Method (Frame, IList(CurveLoop), Double, Double)
  CreateRevolvedGeometry Method (Frame, IList(CurveLoop), Double, Double, SolidOptions)
  CreateSweptBlendGeometry Method
  CreateSweptBlendGeometry Method (Curve, IList(Double), IList(CurveLoop), IList(ICollection(VertexPair)))
  CreateSweptBlendGeometry Method (Curve, IList(Double), IList(CurveLoop), IList(ICollection(VertexPair)), SolidOptions)
  CreateSweptGeometry Method
  CreateSweptGeometry Method (CurveLoop, Int32, Double, IList(CurveLoop))
  CreateSweptGeometry Method (CurveLoop, Int32, Double, IList(CurveLoop), SolidOptions)
  GeometryElement Class
  GeometryElement Members
  GeometryElement Methods
  GetBoundingBox Method
  GetEnumerator Method
  GetEnumeratorNG Method
  GetTransformed Method
  GeometryElement Properties
  MaterialElement Property
  GeometryInstance Class
  GeometryInstance Members
  GeometryInstance Methods
  GetInstanceGeometry Method
  GetInstanceGeometry Method
  GetInstanceGeometry Method (Transform)
  GetSymbolGeometry Method
  GetSymbolGeometry Method
  GetSymbolGeometry Method (Transform)
  GeometryInstance Properties
  Symbol Property
  SymbolGeometry Property
  Transform Property
  GeometryObject Class
  GeometryObject Members
  GeometryObject Methods
  Equals Method
  GetHashCode Method
  GeometryObject Operators
  Equality Operator
  Inequality Operator
  GeometryObject Properties
  GraphicsStyleId Property
  IsElementGeometry Property
  Visibility Property
  GeometryObjectArray Class
  GeometryObjectArray Members
  GeometryObjectArray Constructor
  GeometryObjectArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  GeometryObjectArray Properties
  IsEmpty Property
  Item Property
  Size Property
  GeometryObjectArrayIterator Class
  GeometryObjectArrayIterator Members
  GeometryObjectArrayIterator Constructor
  GeometryObjectArrayIterator Methods
  MoveNext Method
  Reset Method
  GeometryObjectArrayIterator Properties
  Current Property
  GradientBackgroundSettings Class
  GradientBackgroundSettings Members
  GradientBackgroundSettings Methods
  GradientBackgroundSettings Properties
  GroundColor Property
  HorizonColor Property
  SkyColor Property
  GraphicsStyle Class
  GraphicsStyle Members
  GraphicsStyle Methods
  GraphicsStyle Properties
  GraphicsStyleCategory Property
  GraphicsStyleType Property
  Parameter Property
  GraphicsStyleType Enumeration
  Grid Class
  Grid Members
  Grid Methods
  ExtendToAllLevels Method
  GetExtents Method
  Grid Properties
  Curve Property
  GridType Property
  IsCurved Property
  Parameter Property
  GridNode Structure
  GridNode Members
  GridNode Constructor
  GridNode Methods
  GridNode Properties
  UIndex Property
  VIndex Property
  GridNodeLocation Enumeration
  GridSegmentDirection Enumeration
  GridType Class
  GridType Members
  GridType Methods
  GridType Properties
  Parameter Property
  GridTypeSet Class
  GridTypeSet Members
  GridTypeSet Constructor
  GridTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  GridTypeSet Properties
  IsEmpty Property
  Size Property
  GridTypeSetIterator Class
  GridTypeSetIterator Members
  GridTypeSetIterator Constructor
  GridTypeSetIterator Methods
  MoveNext Method
  Reset Method
  GridTypeSetIterator Properties
  Current Property
  Group Class
  Group Members
  Group Methods
  GetMemberIds Method
  UngroupMembers Method
  Group Properties
  GroupType Property
  Location Property
  Parameter Property
  GroupNode Class
  GroupNode Members
  GroupNode Methods
  GetSymbolId Method
  GetTransform Method
  GroupNode Properties
  GroupSet Class
  GroupSet Members
  GroupSet Constructor
  GroupSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  GroupSet Properties
  IsEmpty Property
  Size Property
  GroupSetIterator Class
  GroupSetIterator Members
  GroupSetIterator Constructor
  GroupSetIterator Methods
  MoveNext Method
  Reset Method
  GroupSetIterator Properties
  Current Property
  GroupType Class
  GroupType Members
  GroupType Methods
  GroupType Properties
  Groups Property
  Parameter Property
  GuidEnum Class
  GuidEnum Members
  GuidEnum Constructor
  GuidEnum Methods
  Equals Method
  GetHashCode Method
  GuidEnum Properties
  Guid Property
  HermiteFace Class
  HermiteFace Members
  HermiteFace Methods
  Intersect Method
  IsInside Method
  Triangulate Method
  HermiteFace Properties
  MixedDerivs Property
  Params Property
  Points Property
  Tangents Property
  HermiteSpline Class
  HermiteSpline Members
  HermiteSpline Methods
  Create Method
  Create Method (IList(XYZ), Boolean)
  Create Method (IList(XYZ), Boolean, HermiteSplineTangents)
  Intersect Method
  IsInside Method
  HermiteSpline Properties
  ControlPoints Property
  IsPeriodic Property
  Parameters Property
  Tangents Property
  HermiteSplineTangents Class
  HermiteSplineTangents Members
  HermiteSplineTangents Constructor
  HermiteSplineTangents Methods
  Dispose Method
  HermiteSplineTangents Properties
  EndTangent Property
  IsValidObject Property
  StartTangent Property
  HiddenLineViewsType Enumeration
  HorizontalAlign Enumeration
  HorizontalAlignmentStyle Enumeration
  HostedSweep Class
  HostedSweep Members
  HostedSweep Methods
  AddSegment Method
  GetEndPointParameter Method
  HorizontalFlip Method
  RemoveSegment Method
  SetEndPointParameter Method
  VerticalFlip Method
  HostedSweep Properties
  Angle Property
  HorizontalFlipped Property
  HorizontalOffset Property
  Length Property
  Parameter Property
  ReferenceCurve Property
  VerticalFlipped Property
  VerticalOffset Property
  HostedSweepType Class
  HostedSweepType Members
  HostedSweepType Methods
  HostedSweepType Properties
  Parameter Property
  HostObjAttributes Class
  HostObjAttributes Members
  HostObjAttributes Methods
  GetCompoundStructure Method
  SetCompoundStructure Method
  HostObjAttributes Properties
  Parameter Property
  HostObject Class
  HostObject Members
  HostObject Methods
  FindInserts Method
  HostObject Properties
  Parameter Property
  HostObjectUtils Class
  HostObjectUtils Members
  HostObjectUtils Methods
  GetBottomFaces Method
  GetSideFaces Method
  GetTopFaces Method
  ICentralLockedCallback Interface
  ICentralLockedCallback Members
  ICentralLockedCallback Methods
  ShouldWaitForLockAvailability Method
  IConnector Interface
  IConnector Members
  IConnector Properties
  CoordinateSystem Property
  Domain Property
  Height Property
  Origin Property
  Radius Property
  Shape Property
  Width Property
  IDuplicateTypeNamesHandler Interface
  IDuplicateTypeNamesHandler Members
  IDuplicateTypeNamesHandler Methods
  OnDuplicateTypeNamesFound Method
  IExportContext Interface
  IExportContext Members
  IExportContext Methods
  Finish Method
  IsCanceled Method
  OnDaylightPortal Method
  OnElementBegin Method
  OnElementEnd Method
  OnFaceBegin Method
  OnFaceEnd Method
  OnInstanceBegin Method
  OnInstanceEnd Method
  OnLight Method
  OnLinkBegin Method
  OnLinkEnd Method
  OnMaterial Method
  OnPolymesh Method
  OnRPC Method
  OnViewBegin Method
  OnViewEnd Method
  Start Method
  IExtension Interface
  IExtension Members
  IExtension Properties
  Extended Property
  HasMiter Property
  IsMiterLocked Property
  SymbolicExtended Property
  IExternalDBApplication Interface
  IExternalDBApplication Members
  IExternalDBApplication Methods
  OnShutdown Method
  OnStartup Method
  IExternalResourceServer Interface
  IExternalResourceServer Members
  IExternalResourceServer Methods
  AreSameResources Method
  GetIconPath Method
  GetInformationLink Method
  GetInSessionPath Method
  GetResourceVersionStatus Method
  GetShortName Method
  GetTypeSpecificServerOperations Method
  IsResourceWellFormed Method
  LoadResource Method
  SetupBrowserData Method
  SupportsExternalResourceType Method
  IFailuresPreprocessor Interface
  IFailuresPreprocessor Members
  IFailuresPreprocessor Methods
  PreprocessFailures Method
  IFailuresProcessor Interface
  IFailuresProcessor Members
  IFailuresProcessor Methods
  Dismiss Method
  ProcessFailures Method
  IFamilyLoadOptions Interface
  IFamilyLoadOptions Members
  IFamilyLoadOptions Methods
  OnFamilyFound Method
  OnSharedFamilyFound Method
  IFCExportOptions Class
  IFCExportOptions Members
  IFCExportOptions Constructor
  IFCExportOptions Constructor
  IFCExportOptions Constructor (IFCExportOptions)
  IFCExportOptions Methods
  AddOption Method
  Assign Method
  Dispose Method
  IFCExportOptions Properties
  ExportBaseQuantities Property
  FamilyMappingFile Property
  FileVersion Property
  FilterViewId Property
  IsValidObject Property
  SpaceBoundaryLevel Property
  WallAndColumnSplitting Property
  IFCVersion Enumeration
  IGetLocalPathForOpenCallback Interface
  IGetLocalPathForOpenCallback Members
  IGetLocalPathForOpenCallback Methods
  GetLocalPathForOpen Method
  ImageBackgroundSettings Class
  ImageBackgroundSettings Members
  ImageBackgroundSettings Methods
  ImageBackgroundSettings Properties
  BackgroundImageFit Property
  FilePath Property
  OffsetHeight Property
  OffsetWidth Property
  ImageExportOptions Class
  ImageExportOptions Members
  ImageExportOptions Constructor
  ImageExportOptions Methods
  Dispose Method
  GetFileName Method
  GetViewsAndSheets Method
  IsValidFileName Method
  IsValidForSaveToProjectAsImage Method
  SetViewsAndSheets Method
  ImageExportOptions Properties
  ExportRange Property
  FilePath Property
  FitDirection Property
  HLRandWFViewsFileType Property
  ImageResolution Property
  IsValidObject Property
  PixelSize Property
  ShadowViewsFileType Property
  ShouldCreateWebSite Property
  ViewName Property
  Zoom Property
  ZoomType Property
  ImageFileType Enumeration
  ImageImportOptions Class
  ImageImportOptions Members
  ImageImportOptions Constructor
  ImageImportOptions Methods
  ImageImportOptions Properties
  Placement Property
  Resolution Property
  ImageResolution Enumeration
  ImageType Class
  ImageType Members
  ImageType Methods
  Create Method
  GetImage Method
  IsLoadedFromFile Method
  Reload Method
  ReloadFrom Method
  ImageType Properties
  Parameter Property
  Path Property
  ImageView Class
  ImageView Members
  ImageView Methods
  Create Method
  Print Method
  ImageView Properties
  ImageInstanceId Property
  Parameter Property
  ImportColorMode Enumeration
  ImportExportFileFormat Enumeration
  ImportInstance Class
  ImportInstance Members
  ImportInstance Methods
  GetVisibility Method
  SetVisibility Method
  ImportInstance Properties
  IsLinked Property
  Parameter Property
  ImportPlacement Enumeration
  ImportUnit Enumeration
  INavisworksExporter Interface
  INavisworksExporter Members
  INavisworksExporter Methods
  Export Method
  ValidateExportOptions Method
  IndependentTag Class
  IndependentTag Members
  IndependentTag Methods
  CanLeaderEndConditionBeAssigned Method
  GetTaggedLocalElement Method
  IndependentTag Properties
  HasLeader Property
  IsMaterialTag Property
  IsMulticategoryTag Property
  IsOrphaned Property
  LeaderElbow Property
  LeaderEnd Property
  LeaderEndCondition Property
  MultiReferenceAnnotationId Property
  Parameter Property
  TaggedElementId Property
  TaggedLocalElementId Property
  TagHeadPosition Property
  TagOrientation Property
  TagText Property
  InsertableObject Class
  InsertableObject Members
  InsertableObject Methods
  InsertableObject Properties
  Parameter Property
  InSessionPrintSetting Class
  InSessionPrintSetting Members
  InSessionPrintSetting Methods
  InSessionPrintSetting Properties
  PrintParameters Property
  InSessionViewSheetSet Class
  InSessionViewSheetSet Members
  InSessionViewSheetSet Methods
  InSessionViewSheetSet Properties
  Views Property
  Instance Class
  Instance Members
  Instance Methods
  GetTotalTransform Method
  GetTransform Method
  Instance Properties
  Parameter Property
  InstanceArray Class
  InstanceArray Members
  InstanceArray Constructor
  InstanceArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  InstanceArray Properties
  IsEmpty Property
  Item Property
  Size Property
  InstanceArrayIterator Class
  InstanceArrayIterator Members
  InstanceArrayIterator Constructor
  InstanceArrayIterator Methods
  MoveNext Method
  Reset Method
  InstanceArrayIterator Properties
  Current Property
  InstanceBinding Class
  InstanceBinding Members
  InstanceBinding Constructor
  InstanceBinding Constructor
  InstanceBinding Constructor (CategorySet)
  InstanceBinding Methods
  InstanceBinding Properties
  InstanceNode Class
  InstanceNode Members
  InstanceNode Methods
  InstanceNode Properties
  InstanceVoidCutUtils Class
  InstanceVoidCutUtils Members
  InstanceVoidCutUtils Methods
  AddInstanceVoidCut Method
  CanBeCutWithVoid Method
  GetCuttingVoidInstances Method
  GetElementsBeingCut Method
  InstanceVoidCutExists Method
  IsVoidInstanceCuttingElement Method
  RemoveInstanceVoidCut Method
  InsulationLiningBase Class
  InsulationLiningBase Members
  InsulationLiningBase Methods
  GetInsulationIds Method
  GetLiningIds Method
  IsValidThickness Method
  InsulationLiningBase Properties
  HostElementId Property
  Parameter Property
  Thickness Property
  IntegerRange Class
  IntegerRange Members
  IntegerRange Methods
  Dispose Method
  IntegerRange Properties
  High Property
  IsValidObject Property
  Low Property
  InternalDefinition Class
  InternalDefinition Members
  InternalDefinition Methods
  Dispose Method
  SetAllowVaryBetweenGroups Method
  InternalDefinition Properties
  BuiltInParameter Property
  IsValidObject Property
  Name Property
  ParameterGroup Property
  ParameterType Property
  VariesAcrossGroups Property
  Visible Property
  InternalDefinitions Class
  InternalDefinitions Members
  InternalDefinitions Constructor
  InternalDefinitions Methods
  Create Method
  InternalDefinitions Properties
  IntersectionResult Class
  IntersectionResult Members
  IntersectionResult Constructor
  IntersectionResult Methods
  IntersectionResult Properties
  Distance Property
  EdgeObject Property
  EdgeParameter Property
  Parameter Property
  UVPoint Property
  XYZPoint Property
  IntersectionResultArray Class
  IntersectionResultArray Members
  IntersectionResultArray Constructor
  IntersectionResultArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  IntersectionResultArray Properties
  IsEmpty Property
  Item Property
  Size Property
  IntersectionResultArrayIterator Class
  IntersectionResultArrayIterator Members
  IntersectionResultArrayIterator Constructor
  IntersectionResultArrayIterator Methods
  MoveNext Method
  Reset Method
  IntersectionResultArrayIterator Properties
  Current Property
  IOnLocalLinkSharedCoordinatesSavedCallback Interface
  IOnLocalLinkSharedCoordinatesSavedCallback Members
  IOnLocalLinkSharedCoordinatesSavedCallback Methods
  OnLocalLinkSharedCoordinatesSaved Method
  IPerformanceAdviserRule Interface
  IPerformanceAdviserRule Members
  IPerformanceAdviserRule Methods
  ExecuteElementCheck Method
  FinalizeCheck Method
  GetDescription Method
  GetElementFilter Method
  GetName Method
  InitCheck Method
  WillCheckElements Method
  IPrintSetting Interface
  IPrintSetting Members
  IPrintSetting Properties
  PrintParameters Property
  ISaveSharedCoordinatesCallback Interface
  ISaveSharedCoordinatesCallback Members
  ISaveSharedCoordinatesCallback Methods
  GetSaveModifiedLinksOption Method
  ITransactionFinalizer Interface
  ITransactionFinalizer Members
  ITransactionFinalizer Methods
  OnCommitted Method
  OnRolledBack Method
  IUpdater Interface
  IUpdater Members
  IUpdater Methods
  Execute Method
  GetAdditionalInformation Method
  GetChangePriority Method
  GetUpdaterId Method
  GetUpdaterName Method
  IViewSheetSet Interface
  IViewSheetSet Members
  IViewSheetSet Properties
  Views Property
  JoinGeometryUtils Class
  JoinGeometryUtils Members
  JoinGeometryUtils Methods
  AreElementsJoined Method
  GetJoinedElements Method
  IsCuttingElementInJoin Method
  JoinGeometry Method
  SwitchJoinOrder Method
  UnjoinGeometry Method
  JoinType Enumeration
  JunctionType Enumeration
  KeyBasedTreeEntries Class
  KeyBasedTreeEntries Members
  KeyBasedTreeEntries Methods
  Dispose Method
  FindEntry Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetKeyBasedTreeEntriesIterator Method
  KeyBasedTreeEntries Properties
  IsValidObject Property
  KeyBasedTreeEntriesIterator Class
  KeyBasedTreeEntriesIterator Members
  KeyBasedTreeEntriesIterator Methods
  Dispose Method
  IsDone Method
  MoveNext Method
  Reset Method
  KeyBasedTreeEntriesIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  KeyBasedTreeEntriesLoadContent Class
  KeyBasedTreeEntriesLoadContent Members
  KeyBasedTreeEntriesLoadContent Methods
  AddEntry Method
  BuildEntries Method
  CanAddEntry Method
  GetEntries Method
  GetLoadResults Method
  IsEntriesBuilt Method
  Reset Method
  KeyBasedTreeEntriesLoadContent Properties
  KeyBasedTreeEntriesLoadResults Class
  KeyBasedTreeEntriesLoadResults Members
  KeyBasedTreeEntriesLoadResults Constructor
  KeyBasedTreeEntriesLoadResults Methods
  Dispose Method
  GetFailureMessages Method
  GetFileReadErrors Method
  GetFileSyntaxErrors Method
  GetKeyBasedTreeEntryErrors Method
  GetKeyBasedTreeEntryErrors Method
  GetKeyBasedTreeEntryErrors Method (KeyBasedTreeEntryErrorType)
  KeyBasedTreeEntriesLoadResults Properties
  IsValidObject Property
  KeyBasedTreeEntry Class
  KeyBasedTreeEntry Members
  KeyBasedTreeEntry Methods
  Dispose Method
  GetChildrenKeys Method
  KeyBasedTreeEntry Properties
  IsValidObject Property
  Key Property
  ParentKey Property
  KeyBasedTreeEntryError Class
  KeyBasedTreeEntryError Members
  KeyBasedTreeEntryError Methods
  Dispose Method
  GetEntry Method
  KeyBasedTreeEntryError Properties
  ErrorType Property
  IsValidObject Property
  KeyBasedTreeEntryErrorType Enumeration
  KeyBasedTreeEntryTable Class
  KeyBasedTreeEntryTable Members
  KeyBasedTreeEntryTable Methods
  GetKeyBasedTreeEntries Method
  LoadFrom Method
  Reload Method
  ServerSupports Method
  KeyBasedTreeEntryTable Properties
  Parameter Property
  KeynoteEntries Class
  KeynoteEntries Members
  KeynoteEntries Methods
  LoadKeynoteEntriesFromFile Method
  KeynoteEntries Properties
  KeynoteEntry Class
  KeynoteEntry Members
  KeynoteEntry Constructor
  KeynoteEntry Constructor (String, String)
  KeynoteEntry Constructor (String, String, String)
  KeynoteEntry Methods
  KeynoteEntry Properties
  KeynoteText Property
  KeynoteTable Class
  KeynoteTable Members
  KeynoteTable Methods
  GetKeynoteTable Method
  KeynoteTable Properties
  Parameter Property
  LabelUtils Class
  LabelUtils Members
  LabelUtils Methods
  Dispose Method
  GetLabelFor Method
  GetLabelFor Method (BuiltInParameter)
  GetLabelFor Method (BuiltInParameterGroup)
  GetLabelFor Method (DisplayUnitType)
  GetLabelFor Method (ParameterType)
  GetLabelFor Method (UnitSymbolType)
  GetLabelFor Method (UnitType)
  GetLabelFor Method (DuctLossMethodType, Document)
  GetLabelFor Method (gbXMLBuildingType, Document)
  GetLabelFor Method (PipeFlowState, Document)
  GetLabelFor Method (PipeLossMethodType, Document)
  GetStructuralSectionShapeName Method
  LabelUtils Properties
  IsValidObject Property
  LayerCategoryType Enumeration
  LayerModifier Class
  LayerModifier Members
  LayerModifier Constructor
  LayerModifier Constructor
  LayerModifier Constructor (ModifierType, String)
  LayerModifier Methods
  Dispose Method
  LayerModifier Properties
  IsValidObject Property
  ModifierType Property
  Separator Property
  Seperator Property
  LayoutRule Class
  LayoutRule Members
  LayoutRule Methods
  LayoutRule Properties
  LayoutRuleClearSpacing Class
  LayoutRuleClearSpacing Members
  LayoutRuleClearSpacing Constructor
  LayoutRuleClearSpacing Methods
  LayoutRuleClearSpacing Properties
  JustifyType Property
  Spacing Property
  LayoutRuleFixedDistance Class
  LayoutRuleFixedDistance Members
  LayoutRuleFixedDistance Constructor
  LayoutRuleFixedDistance Methods
  LayoutRuleFixedDistance Properties
  JustifyType Property
  Spacing Property
  LayoutRuleFixedNumber Class
  LayoutRuleFixedNumber Members
  LayoutRuleFixedNumber Constructor
  LayoutRuleFixedNumber Methods
  LayoutRuleFixedNumber Properties
  NumberOfLines Property
  LayoutRuleMaximumSpacing Class
  LayoutRuleMaximumSpacing Members
  LayoutRuleMaximumSpacing Constructor
  LayoutRuleMaximumSpacing Methods
  LayoutRuleMaximumSpacing Properties
  Spacing Property
  Leader Class
  Leader Members
  Leader Methods
  Leader Properties
  Elbow Property
  End Property
  LeaderArray Class
  LeaderArray Members
  LeaderArray Constructor
  LeaderArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  LeaderArray Properties
  IsEmpty Property
  Item Property
  Size Property
  LeaderArrayIterator Class
  LeaderArrayIterator Members
  LeaderArrayIterator Constructor
  LeaderArrayIterator Methods
  MoveNext Method
  Reset Method
  LeaderArrayIterator Properties
  Current Property
  LeaderEndCondition Enumeration
  Level Class
  Level Members
  Level Methods
  Level Properties
  Elevation Property
  LevelType Property
  Parameter Property
  PlaneReference Property
  ProjectElevation Property
  LevelType Class
  LevelType Members
  LevelType Methods
  LevelType Properties
  Parameter Property
  LevelTypeSet Class
  LevelTypeSet Members
  LevelTypeSet Constructor
  LevelTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  LevelTypeSet Properties
  IsEmpty Property
  Size Property
  LevelTypeSetIterator Class
  LevelTypeSetIterator Members
  LevelTypeSetIterator Constructor
  LevelTypeSetIterator Methods
  MoveNext Method
  Reset Method
  LevelTypeSetIterator Properties
  Current Property
  LightingSource Enumeration
  LightNode Class
  LightNode Members
  LightNode Methods
  LightNode Properties
  Line Class
  Line Members
  Line Methods
  CreateBound Method
  CreateUnbound Method
  Intersect Method
  IsInside Method
  Line Properties
  Bound Property
  Direction Property
  Origin Property
  Unbound Property
  LineAndTextAttrSymbol Class
  LineAndTextAttrSymbol Members
  LineAndTextAttrSymbol Methods
  LineAndTextAttrSymbol Properties
  Parameter Property
  LinearArray Class
  LinearArray Members
  LinearArray Methods
  ArrayElementsWithoutAssociation Method
  ArrayElementWithoutAssociation Method
  Create Method
  Create Method (Document, View, ElementId, Int32, XYZ, ArrayAnchorMember)
  Create Method (Document, View, ICollection(ElementId), Int32, XYZ, ArrayAnchorMember)
  GetCopiedMemberIds Method
  GetOriginalMemberIds Method
  IsElementArrayable Method
  IsValidArraySize Method
  LinearArray Properties
  NumMembers Property
  Parameter Property
  LinePattern Class
  LinePattern Members
  LinePattern Constructor
  LinePattern Constructor
  LinePattern Constructor (String)
  LinePattern Methods
  Dispose Method
  GetSegments Method
  SetSegments Method
  LinePattern Properties
  IsValidObject Property
  Name Property
  LinePatternElement Class
  LinePatternElement Members
  LinePatternElement Methods
  Create Method
  GetLinePattern Method
  GetLinePattern Method
  GetLinePattern Method (Document, ElementId)
  GetLinePatternElementByName Method
  GetSolidPatternId Method
  SetLinePattern Method
  LinePatternElement Properties
  Parameter Property
  LinePatternSegment Class
  LinePatternSegment Members
  LinePatternSegment Constructor
  LinePatternSegment Constructor
  LinePatternSegment Constructor (LinePatternSegmentType, Double)
  LinePatternSegment Methods
  Dispose Method
  LinePatternSegment Properties
  IsValidObject Property
  Length Property
  Type Property
  LinePatternSegmentType Enumeration
  LineScaling Enumeration
  LinkConversionData Class
  LinkConversionData Members
  LinkConversionData Methods
  Dispose Method
  GetOptions Method
  LinkConversionData Properties
  IsValidObject Property
  Path Property
  ServerId Property
  LinkedFileStatus Enumeration
  LinkElementId Class
  LinkElementId Members
  LinkElementId Constructor
  LinkElementId Constructor (ElementId)
  LinkElementId Constructor (ElementId, ElementId)
  LinkElementId Methods
  Equals Method
  LinkElementId Operators
  Equality Operator
  Inequality Operator
  LinkElementId Properties
  HostElementId Property
  LinkedElementId Property
  LinkInstanceId Property
  LinkLoadContent Class
  LinkLoadContent Members
  LinkLoadContent Methods
  GetLinkDataPath Method
  GetLinkLoadResult Method
  SetLinkDataPath Method
  LinkLoadContent Properties
  LinkNode Class
  LinkNode Members
  LinkNode Methods
  GetDocument Method
  LinkNode Properties
  LoadOperationType Enumeration
  Location Class
  Location Members
  Location Methods
  Move Method
  Rotate Method
  Location Properties
  LocationCurve Class
  LocationCurve Members
  LocationCurve Methods
  LocationCurve Properties
  Curve Property
  ElementsAtJoin Property
  JoinType Property
  LocationPoint Class
  LocationPoint Members
  LocationPoint Methods
  LocationPoint Properties
  Point Property
  Rotation Property
  LogicalAndFilter Class
  LogicalAndFilter Members
  LogicalAndFilter Constructor
  LogicalAndFilter Constructor (IList(ElementFilter))
  LogicalAndFilter Constructor (ElementFilter, ElementFilter)
  LogicalAndFilter Methods
  PassesFilter Method
  LogicalAndFilter Properties
  LogicalOrFilter Class
  LogicalOrFilter Members
  LogicalOrFilter Constructor
  LogicalOrFilter Constructor (IList(ElementFilter))
  LogicalOrFilter Constructor (ElementFilter, ElementFilter)
  LogicalOrFilter Methods
  PassesFilter Method
  LogicalOrFilter Properties
  MarginType Enumeration
  MassDisplayTemporaryOverrideType Enumeration
  MassInstanceUtils Class
  MassInstanceUtils Members
  MassInstanceUtils Methods
  AddMassLevelDataToMassInstance Method
  Dispose Method
  GetGrossFloorArea Method
  GetGrossSurfaceArea Method
  GetGrossVolume Method
  GetJoinedElementIds Method
  GetMassLevelDataIds Method
  GetMassLevelIds Method
  RemoveMassLevelDataFromMassInstance Method
  MassInstanceUtils Properties
  IsValidObject Property
  Material Class
  Material Members
  Material Methods
  ClearMaterialAspect Method
  Create Method
  Duplicate Method
  IsMaterialOrValidDefault Method
  IsNameUnique Method
  SetMaterialAspectByPropertySet Method
  Material Properties
  AppearanceAssetId Property
  Color Property
  CutPatternColor Property
  CutPatternId Property
  Glow Property
  MaterialCagtegory Property
  MaterialCategory Property
  MaterialClass Property
  Parameter Property
  Shininess Property
  Smoothness Property
  StructuralAssetId Property
  SurfacePatternColor Property
  SurfacePatternId Property
  ThermalAssetId Property
  Transparency Property
  UseRenderAppearanceForShading Property
  MaterialAspect Enumeration
  MaterialFunctionAssignment Enumeration
  MaterialNode Class
  MaterialNode Members
  MaterialNode Methods
  GetAppearance Method
  GetAppearanceOverride Method
  MaterialNode Properties
  Color Property
  Glossiness Property
  HasOverriddenAppearance Property
  MaterialId Property
  Smoothness Property
  ThumbnailFile Property
  Transparency Property
  MaterialPropertyPathType Enumeration
  MaterialSet Class
  MaterialSet Members
  MaterialSet Constructor
  MaterialSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  MaterialSet Properties
  IsEmpty Property
  Size Property
  MaterialSetIterator Class
  MaterialSetIterator Members
  MaterialSetIterator Constructor
  MaterialSetIterator Methods
  MoveNext Method
  Reset Method
  MaterialSetIterator Properties
  Current Property
  MEPCalculationServerInfo Class
  MEPCalculationServerInfo Members
  MEPCalculationServerInfo Constructor
  MEPCalculationServerInfo Constructor
  MEPCalculationServerInfo Constructor (IExternalServer)
  MEPCalculationServerInfo Constructor (MEPCalculationServerInfo)
  MEPCalculationServerInfo Methods
  Dispose Method
  GetMEPCalculationServerInfo Method
  MEPCalculationServerInfo Properties
  Description Property
  IsValidObject Property
  PipeUseDefinitionOnTypeGUID Property
  ServerId Property
  ServerName Property
  MEPCurve Class
  MEPCurve Members
  MEPCurve Methods
  MEPCurve Properties
  ConnectorManager Property
  Diameter Property
  Height Property
  LevelOffset Property
  MEPSystem Property
  Parameter Property
  ReferenceLevel Property
  Width Property
  MEPCurveType Class
  MEPCurveType Members
  MEPCurveType Methods
  MEPCurveType Properties
  Cross Property
  Elbow Property
  MultiShapeTransition Property
  Parameter Property
  PreferredJunctionType Property
  Roughness Property
  RoutingPreferenceManager Property
  Tap Property
  Tee Property
  Transition Property
  Union Property
  MEPModel Class
  MEPModel Members
  MEPModel Methods
  MEPModel Properties
  AssignedElectricalSystems Property
  ConnectorManager Property
  ElectricalSystems Property
  MEPSize Class
  MEPSize Members
  MEPSize Constructor
  MEPSize Methods
  Dispose Method
  MEPSize Properties
  InnerDiameter Property
  IsValidObject Property
  NominalDiameter Property
  OuterDiameter Property
  UsedInSizeLists Property
  UsedInSizing Property
  MEPSystem Class
  MEPSystem Members
  MEPSystem Methods
  Add Method
  DivideSystem Method
  GetCriticalPathSectionNumbers Method
  GetPhysicalNetworksNumber Method
  GetSectionByIndex Method
  GetSectionByNumber Method
  IsSystemDividable Method
  Remove Method
  Remove Method (ConnectorSet)
  Remove Method (ICollection(ElementId))
  MEPSystem Properties
  BaseEquipment Property
  BaseEquipmentConnector Property
  ConnectorManager Property
  Elements Property
  HasDesignParts Property
  HasPlaceholders Property
  IsEmpty Property
  IsMultipleNetwork Property
  IsValid Property
  Parameter Property
  PressureLossOfCriticalPath Property
  SectionsCount Property
  MEPSystemClassification Enumeration
  MEPSystemType Class
  MEPSystemType Members
  MEPSystemType Methods
  MEPSystemType Properties
  Abbreviation Property
  CalculationLevel Property
  LineColor Property
  LinePatternId Property
  LineWeight Property
  MaterialId Property
  Parameter Property
  SystemClassification Property
  Mesh Class
  Mesh Members
  Mesh Methods
  Mesh Properties
  MaterialElementId Property
  NumTriangles Property
  Transformed Property
  Triangle Property
  Vertices Property
  MeshArray Class
  MeshArray Members
  MeshArray Constructor
  MeshArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  MeshArray Properties
  IsEmpty Property
  Item Property
  Size Property
  MeshArrayIterator Class
  MeshArrayIterator Members
  MeshArrayIterator Constructor
  MeshArrayIterator Methods
  MoveNext Method
  Reset Method
  MeshArrayIterator Properties
  Current Property
  MeshFromGeometryOperationIssue Enumeration
  MeshFromGeometryOperationResult Class
  MeshFromGeometryOperationResult Members
  MeshFromGeometryOperationResult Methods
  Dispose Method
  GetIssues Method
  GetMesh Method
  MeshFromGeometryOperationResult Properties
  HasInvalidData Property
  IsMeshAvailable Property
  IsValidObject Property
  Tessellated Property
  MeshTriangle Class
  MeshTriangle Members
  MeshTriangle Methods
  MeshTriangle Properties
  Index Property
  Vertex Property
  ModelArc Class
  ModelArc Members
  ModelArc Methods
  ModelArc Properties
  Parameter Property
  ModelCurve Class
  ModelCurve Members
  ModelCurve Methods
  ChangeToReferenceLine Method
  GetVisibility Method
  SetVisibility Method
  ModelCurve Properties
  IsReferenceLine Property
  Parameter Property
  Subcategory Property
  TrussCurveType Property
  ModelCurveArrArray Class
  ModelCurveArrArray Members
  ModelCurveArrArray Constructor
  ModelCurveArrArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ModelCurveArrArray Properties
  IsEmpty Property
  Item Property
  Size Property
  ModelCurveArrArrayIterator Class
  ModelCurveArrArrayIterator Members
  ModelCurveArrArrayIterator Constructor
  ModelCurveArrArrayIterator Methods
  MoveNext Method
  Reset Method
  ModelCurveArrArrayIterator Properties
  Current Property
  ModelCurveArray Class
  ModelCurveArray Members
  ModelCurveArray Constructor
  ModelCurveArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ModelCurveArray Properties
  IsEmpty Property
  Item Property
  Size Property
  ModelCurveArrayIterator Class
  ModelCurveArrayIterator Members
  ModelCurveArrayIterator Constructor
  ModelCurveArrayIterator Methods
  MoveNext Method
  Reset Method
  ModelCurveArrayIterator Properties
  Current Property
  ModelEllipse Class
  ModelEllipse Members
  ModelEllipse Methods
  ModelEllipse Properties
  Parameter Property
  ModelHermiteSpline Class
  ModelHermiteSpline Members
  ModelHermiteSpline Methods
  ModelHermiteSpline Properties
  Parameter Property
  ModelLine Class
  ModelLine Members
  ModelLine Methods
  ModelLine Properties
  Parameter Property
  ModelNurbSpline Class
  ModelNurbSpline Members
  ModelNurbSpline Methods
  ModelNurbSpline Properties
  Parameter Property
  ModelPath Class
  ModelPath Members
  ModelPath Methods
  Compare Method
  Dispose Method
  GetModelGUID Method
  GetProjectGUID Method
  ModelPath Properties
  CentralServerPath Property
  Empty Property
  IsValidObject Property
  ServerPath Property
  ModelPathUtils Class
  ModelPathUtils Members
  ModelPathUtils Methods
  ConvertModelPathToUserVisiblePath Method
  ConvertUserVisiblePathToModelPath Method
  IsValidUserVisibleFullServerPath Method
  ModelText Class
  ModelText Members
  ModelText Methods
  GetVisibility Method
  SetVisibility Method
  ModelText Properties
  Depth Property
  HorizontalAlignment Property
  Location Property
  ModelTextType Property
  Parameter Property
  Subcategory Property
  Text Property
  ModelTextType Class
  ModelTextType Members
  ModelTextType Methods
  ModelTextType Properties
  Parameter Property
  ModelUpdatesStatus Enumeration
  ModifierType Enumeration
  Mullion Class
  Mullion Members
  Mullion Methods
  BreakMullion Method
  JoinMullion Method
  Mullion Properties
  FromRoom Property
  LocationCurve Property
  Lock Property
  Lockable Property
  MullionType Property
  Parameter Property
  Room Property
  Space Property
  ToRoom Property
  MullionType Class
  MullionType Members
  MullionType Methods
  MullionType Properties
  Parameter Property
  MullionTypeSet Class
  MullionTypeSet Members
  MullionTypeSet Constructor
  MullionTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  MullionTypeSet Properties
  IsEmpty Property
  Size Property
  MullionTypeSetIterator Class
  MullionTypeSetIterator Members
  MullionTypeSetIterator Constructor
  MullionTypeSetIterator Methods
  MoveNext Method
  Reset Method
  MullionTypeSetIterator Properties
  Current Property
  MultiReferenceAnnotation Class
  MultiReferenceAnnotation Members
  MultiReferenceAnnotation Methods
  AreReferencesValidForLinearDimension Method
  AreReferencesValidForLinearFixedDimension Method
  Create Method
  IsLinearFixedDimensionDirectionValid Method
  MultiReferenceAnnotation Properties
  DimensionId Property
  Parameter Property
  TagId Property
  MultiReferenceAnnotationOptions Class
  MultiReferenceAnnotationOptions Members
  MultiReferenceAnnotationOptions Constructor
  MultiReferenceAnnotationOptions Methods
  Dispose Method
  ElementsMatchReferenceCategory Method
  GetElementsToDimension Method
  IsAllowedDimensionStyleType Method
  SetElementsToDimension Method
  MultiReferenceAnnotationOptions Properties
  DimensionLineDirection Property
  DimensionLineOrigin Property
  DimensionPlaneNormal Property
  DimensionStyleType Property
  IsValidObject Property
  MultiReferenceAnnotationType Property
  TagHasLeader Property
  TagHeadPosition Property
  MultiReferenceAnnotationType Class
  MultiReferenceAnnotationType Members
  MultiReferenceAnnotationType Methods
  CreateDefault Method
  GetAllowedTagCategory Method
  IsAllowedDimensionStyle Method
  IsAllowedReferenceCategory Method
  IsAllowedTagCategory Method
  IsAllowedTagType Method
  MultiReferenceAnnotationType Properties
  DimensionStyleId Property
  GroupTagHeads Property
  Parameter Property
  ReferenceCategoryId Property
  ShowDimensionText Property
  TagTypeId Property
  MultiSegmentGrid Class
  MultiSegmentGrid Members
  MultiSegmentGrid Methods
  AreGridsInSameMultiSegmentGrid Method
  Create Method
  GetGridIds Method
  GetMultiSegementGridId Method
  IsValidCurveLoop Method
  IsValidSketchPlaneId Method
  MultiSegmentGrid Properties
  Parameter Property
  Text Property
  NamingUtils Class
  NamingUtils Members
  NamingUtils Methods
  CompareNames Method
  IsValidName Method
  NavisworksCoordinates Enumeration
  NavisworksExportOptions Class
  NavisworksExportOptions Members
  NavisworksExportOptions Constructor
  NavisworksExportOptions Methods
  Dispose Method
  GetSelectedElementIds Method
  SetSelectedElementIds Method
  NavisworksExportOptions Properties
  ConvertElementProperties Property
  Coordinates Property
  DivideFileIntoLevels Property
  ExportElementIds Property
  ExportLinks Property
  ExportParts Property
  ExportRoomAsAttribute Property
  ExportRoomGeometry Property
  ExportScope Property
  ExportUrls Property
  FindMissingMaterials Property
  IsValidObject Property
  Parameters Property
  ViewId Property
  NavisworksExportScope Enumeration
  NavisworksParameters Enumeration
  NumberingSchema Class
  NumberingSchema Members
  NumberingSchema Methods
  AppendSequence Method
  AssignElementsToSequence Method
  ChangeNumber Method
  GetMinimumNumberOfDigits Method
  GetNumberingSchema Method
  GetNumberingSequences Method
  GetNumbers Method
  GetSchemasInDocument Method
  IsValidPartitionName Method
  MergeSequences Method
  MoveSequence Method
  RemoveGaps Method
  SetMinimumNumberOfDigits Method
  ShiftNumbers Method
  NumberingSchema Properties
  MaximumStartingNumber Property
  NumberingParameterId Property
  Parameter Property
  SchemaType Property
  NumberingSchemaType Class
  NumberingSchemaType Members
  NumberingSchemaType Constructor
  NumberingSchemaType Methods
  NumberingSchemaType Operators
  Equality Operator
  Inequality Operator
  NumberingSchemaType Properties
  NumberingSchemaTypes Class
  NumberingSchemaTypes.StructuralNumberingSchemas Class
  NumberingSchemaTypes.StructuralNumberingSchemas Members
  NumberingSchemaTypes.StructuralNumberingSchemas Properties
  Rebar Property
  ReinforcementFabric Property
  NumberSystem Class
  NumberSystem Members
  NumberSystem Methods
  GetReferencePick Method
  SetReferencePick Method
  NumberSystem Properties
  JustifyOffset Property
  JustifyOption Property
  NumberDisplayRule Property
  NumberedElementId Property
  NumberOrientation Property
  Parameter Property
  ReferenceOffset Property
  NumberSystemDisplayRule Enumeration
  NumberSystemJustifyOption Enumeration
  NurbSpline Class
  NurbSpline Members
  NurbSpline Methods
  Create Method
  Create Method (IList(XYZ), IList(Double))
  Create Method (IList(XYZ), IList(Double), IList(Double), Int32, Boolean, Boolean)
  Intersect Method
  IsInside Method
  SetControlPointsAndWeights Method
  NurbSpline Properties
  CtrlPoints Property
  Degree Property
  isClosed Property
  isRational Property
  Knots Property
  Weights Property
  ObjectFactory Class
  ObjectFactory Members
  ObjectFactory Constructor
  ObjectFactory Methods
  Dispose Method
  Opening Class
  Opening Members
  Opening Methods
  Opening Properties
  BoundaryCurves Property
  BoundaryRect Property
  Host Property
  IsRectBoundary Property
  IsTransparentIn3D Property
  IsTransparentInElevation Property
  Parameter Property
  OpeningWrappingCondition Enumeration
  OpenOptions Class
  OpenOptions Members
  OpenOptions Constructor
  OpenOptions Methods
  Dispose Method
  GetOpenWorksetsConfiguration Method
  SetOpenWorksetsConfiguration Method
  OpenOptions Properties
  AllowOpeningLocalByWrongUser Property
  Audit Property
  DetachFromCentralOption Property
  IsValidObject Property
  OptionalFunctionalityUtils Class
  OptionalFunctionalityUtils Members
  OptionalFunctionalityUtils Methods
  IsDGNExportAvailable Method
  IsDGNImportLinkAvailable Method
  IsDWFExportAvailable Method
  IsDWGExportAvailable Method
  IsDWGImportLinkAvailable Method
  IsDXFExportAvailable Method
  IsFBXExportAvailable Method
  IsGraphicsAvailable Method
  IsIFCAvailable Method
  IsNavisworksExporterAvailable Method
  IsSATImportLinkAvailable Method
  IsSKPImportLinkAvailable Method
  Options Class
  Options Members
  Options Constructor
  Options Constructor
  Options Constructor (Options)
  Options Methods
  Options Properties
  ComputeReferences Property
  DetailLevel Property
  IncludeNonVisibleObjects Property
  View Property
  Outline Class
  Outline Members
  Outline Constructor
  Outline Constructor (Outline)
  Outline Constructor (XYZ, XYZ)
  Outline Methods
  AddPoint Method
  Contains Method
  ContainsOtherOutline Method
  Dispose Method
  GetDiagonalLength Method
  Intersects Method
  IsScaleValid Method
  Scale Method
  Outline Properties
  IsEmpty Property
  IsValidObject Property
  MaximumPoint Property
  MinimumPoint Property
  OverrideGraphicSettings Class
  OverrideGraphicSettings Members
  OverrideGraphicSettings Constructor
  OverrideGraphicSettings Constructor
  OverrideGraphicSettings Constructor (OverrideGraphicSettings)
  OverrideGraphicSettings Methods
  Dispose Method
  SetCutFillColor Method
  SetCutFillPatternId Method
  SetCutFillPatternVisible Method
  SetCutLineColor Method
  SetCutLinePatternId Method
  SetCutLineWeight Method
  SetDetailLevel Method
  SetHalftone Method
  SetProjectionFillColor Method
  SetProjectionFillPatternId Method
  SetProjectionFillPatternVisible Method
  SetProjectionLineColor Method
  SetProjectionLinePatternId Method
  SetProjectionLineWeight Method
  SetSurfaceTransparency Method
  OverrideGraphicSettings Properties
  CutFillColor Property
  CutFillPatternId Property
  CutLineColor Property
  CutLinePatternId Property
  CutLineWeight Property
  DetailLevel Property
  Halftone Property
  InvalidPenNumber Property
  IsCutFillPatternVisible Property
  IsProjectionFillPatternVisible Property
  IsValidObject Property
  ProjectionFillColor Property
  ProjectionFillPatternId Property
  ProjectionLineColor Property
  ProjectionLinePatternId Property
  ProjectionLineWeight Property
  Transparency Property
  OverridePermissions Enumeration
  PageOrientationType Enumeration
  Panel Class
  Panel Members
  Panel Methods
  FindHostPanel Method
  GetRefGridLines Method
  Panel Properties
  FromRoom Property
  Lockable Property
  PanelType Property
  Parameter Property
  Room Property
  Space Property
  ToRoom Property
  Transform Property
  PanelType Class
  PanelType Members
  PanelType Methods
  PanelType Properties
  Parameter Property
  PanelTypeSet Class
  PanelTypeSet Members
  PanelTypeSet Constructor
  PanelTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  PanelTypeSet Properties
  IsEmpty Property
  Size Property
  PanelTypeSetIterator Class
  PanelTypeSetIterator Members
  PanelTypeSetIterator Constructor
  PanelTypeSetIterator Methods
  MoveNext Method
  Reset Method
  PanelTypeSetIterator Properties
  Current Property
  PaperPlacementType Enumeration
  PaperSize Class
  PaperSize Members
  PaperSize Methods
  PaperSize Properties
  Name Property
  PaperSizeSet Class
  PaperSizeSet Members
  PaperSizeSet Constructor
  PaperSizeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  PaperSizeSet Properties
  IsEmpty Property
  Size Property
  PaperSizeSetIterator Class
  PaperSizeSetIterator Members
  PaperSizeSetIterator Constructor
  PaperSizeSetIterator Methods
  MoveNext Method
  Reset Method
  PaperSizeSetIterator Properties
  Current Property
  PaperSource Class
  PaperSource Members
  PaperSource Methods
  PaperSource Properties
  Name Property
  PaperSourceSet Class
  PaperSourceSet Members
  PaperSourceSet Constructor
  PaperSourceSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  PaperSourceSet Properties
  IsEmpty Property
  Size Property
  PaperSourceSetIterator Class
  PaperSourceSetIterator Members
  PaperSourceSetIterator Constructor
  PaperSourceSetIterator Methods
  MoveNext Method
  Reset Method
  PaperSourceSetIterator Properties
  Current Property
  Parameter Class
  Parameter Members
  Parameter Methods
  AsDouble Method
  AsElementId Method
  AsInteger Method
  AsString Method
  AsValueString Method
  AsValueString Method
  AsValueString Method (FormatOptions)
  Set Method
  Set Method (Double)
  Set Method (Int32)
  Set Method (String)
  Set Method (ElementId)
  SetValueString Method
  Parameter Properties
  Definition Property
  DisplayUnitType Property
  Element Property
  GUID Property
  HasValue Property
  Id Property
  IsReadOnly Property
  IsShared Property
  StorageType Property
  UserModifiable Property
  ParameterFilterElement Class
  ParameterFilterElement Members
  ParameterFilterElement Methods
  AllRuleParametersApplicable Method
  AllRuleParametersApplicable Method (IList(FilterRule))
  AllRuleParametersApplicable Method (Document, ICollection(ElementId), IList(FilterRule))
  ClearRules Method
  Create Method
  Create Method (Document, String, ICollection(ElementId))
  Create Method (Document, String, ICollection(ElementId), IList(FilterRule))
  GetCategories Method
  GetRuleParameter Method
  GetRuleParameters Method
  GetRules Method
  SetCategories Method
  SetRules Method
  ParameterFilterElement Properties
  Parameter Property
  ParameterFilterRuleFactory Class
  ParameterFilterRuleFactory Members
  ParameterFilterRuleFactory Methods
  CreateBeginsWithRule Method
  CreateContainsRule Method
  CreateEndsWithRule Method
  CreateEqualsRule Method
  CreateEqualsRule Method (ElementId, ElementId)
  CreateEqualsRule Method (ElementId, Int32)
  CreateEqualsRule Method (ElementId, Double, Double)
  CreateEqualsRule Method (ElementId, String, Boolean)
  CreateGreaterOrEqualRule Method
  CreateGreaterOrEqualRule Method (ElementId, ElementId)
  CreateGreaterOrEqualRule Method (ElementId, Int32)
  CreateGreaterOrEqualRule Method (ElementId, Double, Double)
  CreateGreaterOrEqualRule Method (ElementId, String, Boolean)
  CreateGreaterRule Method
  CreateGreaterRule Method (ElementId, ElementId)
  CreateGreaterRule Method (ElementId, Int32)
  CreateGreaterRule Method (ElementId, Double, Double)
  CreateGreaterRule Method (ElementId, String, Boolean)
  CreateLessOrEqualRule Method
  CreateLessOrEqualRule Method (ElementId, ElementId)
  CreateLessOrEqualRule Method (ElementId, Int32)
  CreateLessOrEqualRule Method (ElementId, Double, Double)
  CreateLessOrEqualRule Method (ElementId, String, Boolean)
  CreateLessRule Method
  CreateLessRule Method (ElementId, ElementId)
  CreateLessRule Method (ElementId, Int32)
  CreateLessRule Method (ElementId, Double, Double)
  CreateLessRule Method (ElementId, String, Boolean)
  CreateNotBeginsWithRule Method
  CreateNotContainsRule Method
  CreateNotEndsWithRule Method
  CreateNotEqualsRule Method
  CreateNotEqualsRule Method (ElementId, ElementId)
  CreateNotEqualsRule Method (ElementId, Int32)
  CreateNotEqualsRule Method (ElementId, Double, Double)
  CreateNotEqualsRule Method (ElementId, String, Boolean)
  CreateSharedParameterApplicableRule Method
  Dispose Method
  ParameterFilterRuleFactory Properties
  IsValidObject Property
  ParameterFilterUtilities Class
  ParameterFilterUtilities Members
  ParameterFilterUtilities Methods
  GetAllFilterableCategories Method
  GetFilterableParametersInCommon Method
  GetInapplicableParameters Method
  IsParameterApplicable Method
  RemoveUnfilterableCategories Method
  ParameterMap Class
  ParameterMap Members
  ParameterMap Constructor
  ParameterMap Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ParameterMap Properties
  IsEmpty Property
  Item Property
  Size Property
  ParameterMapIterator Class
  ParameterMapIterator Members
  ParameterMapIterator Constructor
  ParameterMapIterator Methods
  MoveNext Method
  Reset Method
  ParameterMapIterator Properties
  Current Property
  Key Property
  ParameterSet Class
  ParameterSet Members
  ParameterSet Constructor
  ParameterSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ParameterSet Properties
  IsEmpty Property
  Size Property
  ParameterSetIterator Class
  ParameterSetIterator Members
  ParameterSetIterator Constructor
  ParameterSetIterator Methods
  MoveNext Method
  Reset Method
  ParameterSetIterator Properties
  Current Property
  ParametersOrder Enumeration
  ParameterType Enumeration
  ParameterValueProvider Class
  ParameterValueProvider Members
  ParameterValueProvider Constructor
  ParameterValueProvider Methods
  ParameterValueProvider Properties
  Parameter Property
  Part Class
  Part Members
  Part Methods
  CanOffsetFace Method
  GetSourceElementIds Method
  GetSourceElementOriginalCategoryIds Method
  ResetPartShape Method
  SetFaceOffset Method
  Part Properties
  Excluded Property
  OriginalCategoryId Property
  Parameter Property
  PartMaker Property
  PartEdgeConditionOrientation Enumeration
  PartMaker Class
  PartMaker Members
  PartMaker Methods
  GetSourceElementIds Method
  IsSourceElement Method
  SetSourceElementIds Method
  PartMaker Properties
  Parameter Property
  PartMakerMethodToDivideVolumes Class
  PartMakerMethodToDivideVolumes Members
  PartMakerMethodToDivideVolumes Methods
  AddIntersectingReference Method
  AreElementsValidIntersectingReferences Method
  AreElementsValidIntersectingReferences Method (ICollection(ElementId))
  AreElementsValidIntersectingReferences Method (Document, ICollection(ElementId))
  CanBeDivisionProfile Method
  CanBeDivisionProfile Method (ElementId)
  CanBeDivisionProfile Method (ElementId, Document)
  Dispose Method
  GetOffsetForIntersectingReference Method
  GetPlaneOfSketch Method
  GetSketchCurves Method
  GetSplitRefsOffsets Method
  IsElementValidIntersectingReference Method
  IsElementValidIntersectingReference Method (ElementId)
  IsElementValidIntersectingReference Method (Document, ElementId)
  IsValidSketchPlane Method
  RemoveIntersectingReference Method
  SetOffsetForIntersectingReference Method
  UsesReference Method
  PartMakerMethodToDivideVolumes Properties
  DivisionGap Property
  DivisionPatternMirror Property
  DivisionRotationAngle Property
  DivisionRuleId Property
  IsValidObject Property
  ProfileFlipAcross Property
  ProfileFlipAlong Property
  ProfileMatch Property
  ProfileOffset Property
  ProfileType Property
  UConstDivisionIndent Property
  VConstDivisionIndent Property
  PartsVisibility Enumeration
  PartType Enumeration
  PartUtils Class
  PartUtils Members
  PartUtils Methods
  AreElementsValidForCreateParts Method
  ArePartsValidForDivide Method
  ArePartsValidForMerge Method
  CreateMergedPart Method
  CreateParts Method
  CreateParts Method (Document, ICollection(ElementId))
  CreateParts Method (Document, ICollection(LinkElementId))
  DivideParts Method
  FindMergeableClusters Method
  GetAssociatedPartMaker Method
  GetAssociatedPartMaker Method (Document, ElementId)
  GetAssociatedPartMaker Method (Document, LinkElementId)
  GetAssociatedParts Method
  GetAssociatedParts Method (Document, ElementId, Boolean, Boolean)
  GetAssociatedParts Method (Document, LinkElementId, Boolean, Boolean)
  GetChainLengthToOriginal Method
  GetMergedParts Method
  GetPartMakerMethodToDivideVolumeFW Method
  HasAssociatedParts Method
  HasAssociatedParts Method (Document, ElementId)
  HasAssociatedParts Method (Document, LinkElementId)
  IsMergedPart Method
  IsPartDerivedFromLink Method
  IsValidForCreateParts Method
  Path3d Class
  Path3d Members
  Path3d Methods
  Path3d Properties
  AllCurveLoops Property
  CurveLoop Property
  NumCurveLoops Property
  Parameter Property
  PathType Enumeration
  PerformanceAdviser Class
  PerformanceAdviser Members
  PerformanceAdviser Methods
  AddRule Method
  DeleteRule Method
  Dispose Method
  ExecuteAllRules Method
  ExecuteRules Method
  ExecuteRules Method (Document, IList(PerformanceAdviserRuleId))
  ExecuteRules Method (Document, IList(Int32))
  GetAllRuleIds Method
  GetElementFilterFromRule Method
  GetElementFilterFromRule Method (Int32, Document)
  GetElementFilterFromRule Method (PerformanceAdviserRuleId, Document)
  GetNumberOfRules Method
  GetPerformanceAdviser Method
  GetRuleDescription Method
  GetRuleDescription Method (Int32)
  GetRuleDescription Method (PerformanceAdviserRuleId)
  GetRuleId Method
  GetRuleName Method
  GetRuleName Method (Int32)
  GetRuleName Method (PerformanceAdviserRuleId)
  IsRuleEnabled Method
  IsRuleEnabled Method (Int32)
  IsRuleEnabled Method (PerformanceAdviserRuleId)
  PostWarning Method
  SetRuleEnabled Method
  SetRuleEnabled Method (Int32, Boolean)
  SetRuleEnabled Method (PerformanceAdviserRuleId, Boolean)
  WillRuleCheckElements Method
  WillRuleCheckElements Method (Int32)
  WillRuleCheckElements Method (PerformanceAdviserRuleId)
  PerformanceAdviser Properties
  IsValidObject Property
  PerformanceAdviserRuleId Class
  PerformanceAdviserRuleId Members
  PerformanceAdviserRuleId Constructor
  PerformanceAdviserRuleId Methods
  PerformanceAdviserRuleId Operators
  Equality Operator
  Inequality Operator
  PerformanceAdviserRuleId Properties
  PerformanceAdviserRules Class
  Phase Class
  Phase Members
  Phase Methods
  Phase Properties
  Parameter Property
  PhaseArray Class
  PhaseArray Members
  PhaseArray Constructor
  PhaseArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  PhaseArray Properties
  IsEmpty Property
  Item Property
  Size Property
  PhaseArrayIterator Class
  PhaseArrayIterator Members
  PhaseArrayIterator Constructor
  PhaseArrayIterator Methods
  MoveNext Method
  Reset Method
  PhaseArrayIterator Properties
  Current Property
  PhaseFilter Class
  PhaseFilter Members
  PhaseFilter Methods
  Create Method
  GetPhaseStatusPresentation Method
  SetPhaseStatusPresentation Method
  PhaseFilter Properties
  IsDefault Property
  Parameter Property
  PhaseStatusPresentation Enumeration
  PlanarFace Class
  PlanarFace Members
  PlanarFace Methods
  Intersect Method
  IsInside Method
  Triangulate Method
  PlanarFace Properties
  Normal Property
  Origin Property
  Vector Property
  PlanCircuit Class
  PlanCircuit Members
  PlanCircuit Methods
  GetPointInside Method
  PlanCircuit Properties
  Area Property
  IsRoomLocated Property
  SideNum Property
  PlanCircuitSet Class
  PlanCircuitSet Members
  PlanCircuitSet Constructor
  PlanCircuitSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  PlanCircuitSet Properties
  IsEmpty Property
  Size Property
  PlanCircuitSetIterator Class
  PlanCircuitSetIterator Members
  PlanCircuitSetIterator Constructor
  PlanCircuitSetIterator Methods
  MoveNext Method
  Reset Method
  PlanCircuitSetIterator Properties
  Current Property
  Plane Class
  Plane Members
  Plane Constructor
  Plane Constructor (XYZ, XYZ)
  Plane Constructor (XYZ, XYZ, XYZ)
  Plane Methods
  Plane Properties
  Normal Property
  Origin Property
  XVec Property
  YVec Property
  PlanTopology Class
  PlanTopology Members
  PlanTopology Methods
  GetRoomIds Method
  PlanTopology Properties
  Circuits Property
  Level Property
  Phase Property
  PlanTopologySet Class
  PlanTopologySet Members
  PlanTopologySet Constructor
  PlanTopologySet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  PlanTopologySet Properties
  IsEmpty Property
  Size Property
  PlanTopologySetIterator Class
  PlanTopologySetIterator Members
  PlanTopologySetIterator Constructor
  PlanTopologySetIterator Methods
  MoveNext Method
  Reset Method
  PlanTopologySetIterator Properties
  Current Property
  PlanViewDirection Enumeration
  PlanViewPlane Enumeration
  PlanViewRange Class
  PlanViewRange Members
  PlanViewRange Methods
  Dispose Method
  GetLevelId Method
  GetOffset Method
  SetLevelId Method
  SetOffset Method
  PlanViewRange Properties
  Current Property
  IsValidObject Property
  LevelAbove Property
  LevelBelow Property
  Unlimited Property
  PlanViewRangeError Enumeration
  PlanViewRangeLevel Enumeration
  Point Class
  Point Members
  Point Methods
  Point Properties
  Coord Property
  Reference Property
  PointCloudColorMode Enumeration
  PointCloudFoundStatus Enumeration
  PointCloudInstance Class
  PointCloudInstance Members
  PointCloudInstance Methods
  ContainsScan Method
  Create Method
  GetPoints Method
  GetScanOrigin Method
  GetScans Method
  GetSelectionFilter Method
  HasColor Method
  SetSelectionFilter Method
  PointCloudInstance Properties
  FilterAction Property
  Parameter Property
  SupportsOverrides Property
  PointCloudType Class
  PointCloudType Members
  PointCloudType Methods
  Create Method
  PointCloudType Properties
  ColorEncoding Property
  EngineIdentifier Property
  FoundStatus Property
  Offset Property
  Parameter Property
  Scale Property
  PointElementReference Class
  PointElementReference Members
  PointElementReference Constructor
  PointElementReference Methods
  PointLocationOnCurve Class
  PointLocationOnCurve Members
  PointLocationOnCurve Constructor
  PointLocationOnCurve Methods
  Dispose Method
  PointLocationOnCurve Properties
  IsValidObject Property
  MeasureFrom Property
  MeasurementType Property
  MeasurementValue Property
  PointOnCurveMeasureFrom Enumeration
  PointOnCurveMeasurementType Enumeration
  PointOnEdge Class
  PointOnEdge Members
  PointOnEdge Methods
  GetEdgeReference Method
  SetEdgeReference Method
  PointOnEdge Properties
  LocationOnCurve Property
  PointOnEdgeEdgeIntersection Class
  PointOnEdgeEdgeIntersection Members
  PointOnEdgeEdgeIntersection Methods
  GetEdgeReference1 Method
  GetEdgeReference2 Method
  SetEdgeReference1 Method
  SetEdgeReference2 Method
  PointOnEdgeFaceIntersection Class
  PointOnEdgeFaceIntersection Members
  PointOnEdgeFaceIntersection Methods
  GetEdgeReference Method
  GetFaceReference Method
  SetEdgeReference Method
  SetFaceReference Method
  PointOnEdgeFaceIntersection Properties
  OrientWithEdge Property
  PointOnFace Class
  PointOnFace Members
  PointOnFace Methods
  GetFaceReference Method
  SetFaceReference Method
  PointOnFace Properties
  UV Property
  PointOnPlane Class
  PointOnPlane Members
  PointOnPlane Methods
  GetPlaneReference Method
  IsValidPlaneReference Method
  NewPointOnPlane Method
  SetPlaneReference Method
  PointOnPlane Properties
  Offset Property
  Position Property
  XVec Property
  PointRelativeToPoint Class
  PointRelativeToPoint Members
  PointRelativeToPoint Methods
  GetHostPointReference Method
  SetHostPointReference Method
  PolyLine Class
  PolyLine Members
  PolyLine Methods
  Clone Method
  Create Method
  Evaluate Method
  GetCoordinate Method
  GetCoordinates Method
  GetOutline Method
  GetTransformed Method
  PolyLine Properties
  NumberOfCoordinates Property
  PolymeshFacet Class
  PolymeshFacet Members
  PolymeshFacet Methods
  GetVertices Method
  ToString Method
  PolymeshFacet Properties
  IsValidObject Property
  V1 Property
  V2 Property
  V3 Property
  PolymeshTopology Class
  PolymeshTopology Members
  PolymeshTopology Methods
  Dispose Method
  GetFacet Method
  GetFacets Method
  GetNormal Method
  GetNormals Method
  GetPoint Method
  GetPoints Method
  GetUV Method
  GetUVs Method
  PolymeshTopology Properties
  DistributionOfNormals Property
  IsValidObject Property
  NumberOfFacets Property
  NumberOfNormals Property
  NumberOfPoints Property
  NumberOfUVs Property
  PreferredJunctionType Enumeration
  PrimaryDesignOptionMemberFilter Class
  PrimaryDesignOptionMemberFilter Members
  PrimaryDesignOptionMemberFilter Constructor
  PrimaryDesignOptionMemberFilter Constructor
  PrimaryDesignOptionMemberFilter Constructor (Boolean)
  PrimaryDesignOptionMemberFilter Methods
  PassesFilter Method
  PrimaryDesignOptionMemberFilter Properties
  PrimarySizeCriterion Class
  PrimarySizeCriterion Members
  PrimarySizeCriterion Constructor
  PrimarySizeCriterion Methods
  All Method
  None Method
  PrimarySizeCriterion Properties
  MaximumSize Property
  MinimumSize Property
  PrinterResolution Enumeration
  PrintManager Class
  PrintManager Members
  PrintManager Methods
  Apply Method
  SelectNewPrintDriver Method
  SubmitPrint Method
  SubmitPrint Method
  SubmitPrint Method (View)
  PrintManager Properties
  Collate Property
  CombinedFile Property
  CopyNumber Property
  IsVirtual Property
  PaperSizes Property
  PaperSources Property
  PrinterName Property
  PrintOrderReverse Property
  PrintRange Property
  PrintSetup Property
  PrintToFile Property
  PrintToFileName Property
  ViewSheetSetting Property
  PrintParameters Class
  PrintParameters Members
  PrintParameters Methods
  PrintParameters Properties
  ColorDepth Property
  HiddenLineViews Property
  HideCropBoundaries Property
  HideReforWorkPlanes Property
  HideScopeBoxes Property
  HideUnreferencedViewTags Property
  MarginType Property
  MaskCoincidentLines Property
  PageOrientation Property
  PaperPlacement Property
  PaperSize Property
  PaperSource Property
  RasterQuality Property
  ReplaceHalftoneWithThinLines Property
  UserDefinedMarginX Property
  UserDefinedMarginY Property
  ViewLinksinBlue Property
  Zoom Property
  ZoomType Property
  PrintRange Enumeration
  PrintSetting Class
  PrintSetting Members
  PrintSetting Methods
  PrintSetting Properties
  Name Property
  Parameter Property
  PrintParameters Property
  PrintSetup Class
  PrintSetup Members
  PrintSetup Methods
  Delete Method
  Rename Method
  Revert Method
  Save Method
  SaveAs Method
  PrintSetup Properties
  CurrentPrintSetting Property
  InSession Property
  Profile Class
  Profile Members
  Profile Methods
  Clone Method
  Profile Properties
  Curves Property
  Filled Property
  Transformed Property
  ProfileFamilyUsage Enumeration
  ProfilePlaneLocation Enumeration
  ProjectInfo Class
  ProjectInfo Members
  ProjectInfo Methods
  ProjectInfo Properties
  Address Property
  Author Property
  BuildingName Property
  ClientName Property
  IssueDate Property
  Name Property
  Number Property
  OrganizationDescription Property
  OrganizationName Property
  Parameter Property
  Status Property
  ProjectLocation Class
  ProjectLocation Members
  ProjectLocation Methods
  Duplicate Method
  ProjectLocation Properties
  Name Property
  Parameter Property
  ProjectPosition Property
  SiteLocation Property
  ProjectLocationSet Class
  ProjectLocationSet Members
  ProjectLocationSet Constructor
  ProjectLocationSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ProjectLocationSet Properties
  IsEmpty Property
  Size Property
  ProjectLocationSetIterator Class
  ProjectLocationSetIterator Members
  ProjectLocationSetIterator Constructor
  ProjectLocationSetIterator Methods
  MoveNext Method
  Reset Method
  ProjectLocationSetIterator Properties
  Current Property
  ProjectPosition Class
  ProjectPosition Members
  ProjectPosition Constructor
  ProjectPosition Methods
  ProjectPosition Properties
  Angle Property
  EastWest Property
  Elevation Property
  NorthSouth Property
  PropertyLine Class
  PropertyLine Members
  PropertyLine Methods
  PropertyLine Properties
  Parameter Property
  PropertySetElement Class
  PropertySetElement Members
  PropertySetElement Methods
  Create Method
  Create Method (Document, StructuralAsset)
  Create Method (Document, ThermalAsset)
  Duplicate Method
  GetStructuralAsset Method
  GetThermalAsset Method
  SetStructuralAsset Method
  SetThermalAsset Method
  PropertySetElement Properties
  Parameter Property
  PropertySetLibrary Class
  PropertySetLibrary Members
  PropertySetLibrary Methods
  AddPropertySet Method
  AddPropertySetWithName Method
  AddToDocument Method
  AddToDocumentWithName Method
  Create Method
  ExportXml Method
  Find Method
  GetName Method
  HasPropertySet Method
  ImportXml Method
  RemovePropertySet Method
  RenamePropertySet Method
  RenameSubclass Method
  SetName Method
  PropertySetLibrary Properties
  Locked Property
  Parameter Property
  ReadOnly Property
  PropOverrideMode Enumeration
  RadialArray Class
  RadialArray Members
  RadialArray Methods
  ArrayElementsWithoutAssociation Method
  ArrayElementWithoutAssociation Method
  Create Method
  Create Method (Document, View, ElementId, Int32, Line, Double, ArrayAnchorMember)
  Create Method (Document, View, ICollection(ElementId), Int32, Line, Double, ArrayAnchorMember)
  GetCopiedMemberIds Method
  GetOriginalMemberIds Method
  IsValidArraySize Method
  RadialArray Properties
  NumMembers Property
  Parameter Property
  RasterQualityType Enumeration
  RectangularGridSegmentOrientation Enumeration
  Reference Class
  Reference Members
  Reference Constructor
  Reference Methods
  ConvertToStableRepresentation Method
  CreateLinkReference Method
  CreateReferenceInLink Method
  ParseFromStableRepresentation Method
  Reference Properties
  ElementId Property
  ElementReferenceType Property
  GlobalPoint Property
  LinkedElementId Property
  UVPoint Property
  ReferenceableViewUtils Class
  ReferenceableViewUtils Members
  ReferenceableViewUtils Methods
  ChangeReferencedView Method
  GetReferencedViewId Method
  ReferenceArray Class
  ReferenceArray Members
  ReferenceArray Constructor
  ReferenceArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ReferenceArray Properties
  IsEmpty Property
  Item Property
  Size Property
  ReferenceArrayArray Class
  ReferenceArrayArray Members
  ReferenceArrayArray Constructor
  ReferenceArrayArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ReferenceArrayArray Properties
  IsEmpty Property
  Item Property
  Size Property
  ReferenceArrayArrayIterator Class
  ReferenceArrayArrayIterator Members
  ReferenceArrayArrayIterator Constructor
  ReferenceArrayArrayIterator Methods
  MoveNext Method
  Reset Method
  ReferenceArrayArrayIterator Properties
  Current Property
  ReferenceArrayIterator Class
  ReferenceArrayIterator Members
  ReferenceArrayIterator Constructor
  ReferenceArrayIterator Methods
  MoveNext Method
  Reset Method
  ReferenceArrayIterator Properties
  Current Property
  ReferenceIntersector Class
  ReferenceIntersector Members
  ReferenceIntersector Constructor
  ReferenceIntersector Constructor (View3D)
  ReferenceIntersector Constructor (ElementFilter, FindReferenceTarget, View3D)
  ReferenceIntersector Constructor (ElementId, FindReferenceTarget, View3D)
  ReferenceIntersector Constructor (ICollection(ElementId), FindReferenceTarget, View3D)
  ReferenceIntersector Methods
  Dispose Method
  Find Method
  FindNearest Method
  GetFilter Method
  GetTargetElementIds Method
  SetFilter Method
  SetTargetElementIds Method
  ReferenceIntersector Properties
  FindReferencesInRevitLinks Property
  IsValidObject Property
  TargetType Property
  ViewId Property
  ReferencePlane Class
  ReferencePlane Members
  ReferencePlane Methods
  Flip Method
  ReferencePlane Properties
  BubbleEnd Property
  Direction Property
  FreeEnd Property
  Name Property
  Normal Property
  Parameter Property
  Plane Property
  Reference Property
  ReferencePoint Class
  ReferencePoint Members
  ReferencePoint Methods
  GetCoordinatePlaneReferenceXY Method
  GetCoordinatePlaneReferenceXZ Method
  GetCoordinatePlaneReferenceYZ Method
  GetCoordinateSystem Method
  GetHubId Method
  GetInterpolatingCurves Method
  GetPointElementReference Method
  GetVisibility Method
  SetCoordinateSystem Method
  SetPointElementReference Method
  SetVisibility Method
  ReferencePoint Properties
  CoordinatePlaneVisibility Property
  Name Property
  Parameter Property
  Position Property
  ShowNormalReferencePlaneOnly Property
  Visible Property
  ReferencePointArray Class
  ReferencePointArray Members
  ReferencePointArray Constructor
  ReferencePointArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ReferencePointArray Properties
  IsEmpty Property
  Item Property
  Size Property
  ReferencePointArrayIterator Class
  ReferencePointArrayIterator Members
  ReferencePointArrayIterator Constructor
  ReferencePointArrayIterator Methods
  MoveNext Method
  Reset Method
  ReferencePointArrayIterator Properties
  Current Property
  ReferenceType Enumeration
  ReferenceWithContext Class
  ReferenceWithContext Members
  ReferenceWithContext Methods
  Dispose Method
  GetInstanceTransform Method
  GetReference Method
  ReferenceWithContext Properties
  IsValidObject Property
  Proximity Property
  RelinquishedItems Class
  RelinquishedItems Members
  RelinquishedItems Methods
  Dispose Method
  GetRelinquishedElements Method
  GetRelinquishedWorksets Method
  RelinquishedItems Properties
  IsValidObject Property
  RelinquishOptions Class
  RelinquishOptions Members
  RelinquishOptions Constructor
  RelinquishOptions Methods
  Dispose Method
  RelinquishOptions Properties
  CheckedOutElements Property
  FamilyWorksets Property
  IsValidObject Property
  StandardWorksets Property
  UserWorksets Property
  ViewWorksets Property
  ReloadLatestOptions Class
  ReloadLatestOptions Members
  ReloadLatestOptions Constructor
  ReloadLatestOptions Methods
  Dispose Method
  ReloadLatestOptions Properties
  IsValidObject Property
  RenderEngine Enumeration
  RenderingImageExposureSettings Class
  RenderingImageExposureSettings Members
  RenderingImageExposureSettings Methods
  Dispose Method
  RenderingImageExposureSettings Properties
  ExposureValue Property
  Highlights Property
  IsValidObject Property
  MidTones Property
  Saturation Property
  Shadows Property
  WhitePoint Property
  RenderingQuality Enumeration
  RenderingQualitySettings Class
  RenderingQualitySettings Members
  RenderingQualitySettings Methods
  Dispose Method
  RenderingQualitySettings Properties
  AreCurtainWallsDaylightPortals Property
  AreDoorsDaylightPortals Property
  AreShadowsEnabled Property
  AreWindowsDaylightPortals Property
  BlurredReflectionPrecision Property
  BlurredRefractionPrecision Property
  ImagePrecision Property
  IndirectIlluminationBounces Property
  IndirectIlluminationPrecision Property
  IndirectIlluminationSmoothness Property
  IsValidObject Property
  MaxReflections Property
  MaxRefractions Property
  RenderingQuality Property
  ShouldComputeIndirectAndSkyIllumination Property
  SoftShadowsPrecision Property
  RenderingSettings Class
  RenderingSettings Members
  RenderingSettings Methods
  Dispose Method
  GetBackgroundSettings Method
  GetRenderingImageExposureSettings Method
  GetRenderingQualitySettings Method
  GetRenderingRegionOutline Method
  SetBackgroundSettings Method
  SetRenderingImageExposureSettings Method
  SetRenderingQualitySettings Method
  RenderingSettings Properties
  BackgroundStyle Property
  IsValidObject Property
  LightingSource Property
  PrinterResolution Property
  ResolutionTarget Property
  ResolutionValue Property
  UsesRegionRendering Property
  RenderNode Class
  RenderNode Members
  RenderNode Methods
  Dispose Method
  RenderNode Properties
  IsValidObject Property
  NodeName Property
  RenderNodeAction Enumeration
  RepeaterBounds Class
  RepeaterBounds Members
  RepeaterBounds Methods
  AdjustForCyclicalBounds Method
  AreCoordinatesInBounds Method
  Dispose Method
  GetLowerBound Method
  GetUpperBound Method
  IsCyclical Method
  RepeaterBounds Properties
  DimensionCount Property
  IsValidObject Property
  RepeaterCoordinates Class
  RepeaterCoordinates Members
  RepeaterCoordinates Constructor
  RepeaterCoordinates Constructor
  RepeaterCoordinates Constructor (Int32)
  RepeaterCoordinates Constructor (Int32, Int32)
  RepeaterCoordinates Methods
  Dispose Method
  GetCoordinate Method
  RepeaterCoordinates Properties
  DimensionCount Property
  IsValidObject Property
  RepeatingReferenceSource Class
  RepeatingReferenceSource Members
  RepeatingReferenceSource Methods
  Dispose Method
  GetBounds Method
  GetDefaultRepeatingReferenceSource Method
  GetReference Method
  HasRepeatingReferenceSource Method
  RepeatingReferenceSource Properties
  DimensionCount Property
  IsValidObject Property
  ResolutionTarget Enumeration
  ResourceVersionStatus Enumeration
  Revision Class
  Revision Members
  Revision Methods
  CombineWithNext Method
  CombineWithPrevious Method
  Create Method
  GetAllRevisionIds Method
  ReorderRevisionSequence Method
  Revision Properties
  Description Property
  Issued Property
  IssuedBy Property
  IssuedTo Property
  NumberType Property
  Parameter Property
  RevisionDate Property
  RevisionNumber Property
  SequenceNumber Property
  Visibility Property
  RevisionCloud Class
  RevisionCloud Members
  RevisionCloud Methods
  Create Method
  GetSheetIds Method
  GetSketchCurves Method
  IsRevisionIssued Method
  RevisionCloud Properties
  Parameter Property
  RevisionId Property
  RevisionNumbering Enumeration
  RevisionNumberType Enumeration
  RevisionSettings Class
  RevisionSettings Members
  RevisionSettings Methods
  GetRevisionSettings Method
  IsAcceptableRevisionCloudSpacing Method
  RoundRevisionCloudSpacing Method
  RevisionSettings Properties
  Parameter Property
  RevisionAlphabet Property
  RevisionCloudSpacing Property
  RevisionNumbering Property
  RevisionVisibility Enumeration
  RevitLinkInstance Class
  RevitLinkInstance Members
  RevitLinkInstance Methods
  Create Method
  GetLinkDocument Method
  RevitLinkInstance Properties
  Parameter Property
  RevitLinkLoadResult Class
  RevitLinkLoadResult Members
  RevitLinkLoadResult Constructor
  RevitLinkLoadResult Methods
  Dispose Method
  GetCentralModelName Method
  GetExternalResourceReference Method
  GetExternalResourceReferencesFromFailedLoads Method
  GetLinkLoadResult Method
  GetModelName Method
  GetNestedLinkLoadResults Method
  GetParentModelName Method
  IsCodeSuccess Method
  RevitLinkLoadResult Properties
  ElementId Property
  IsCircularLink Property
  IsNested Property
  IsValidObject Property
  LoadResult Property
  RevitLinkLoadResultType Enumeration
  RevitLinkOperations Class
  RevitLinkOperations Members
  RevitLinkOperations Methods
  Dispose Method
  SetGetLocalPathForOpenCallback Method
  SetOnLocalLinkSharedCoordinatesSavedCallback Method
  RevitLinkOperations Properties
  IsValidObject Property
  RevitLinkOptions Class
  RevitLinkOptions Members
  RevitLinkOptions Constructor
  RevitLinkOptions Constructor (Boolean)
  RevitLinkOptions Constructor (RevitLinkOptions)
  RevitLinkOptions Constructor (Boolean, WorksetConfiguration)
  RevitLinkOptions Methods
  Dispose Method
  GetWorksetConfiguration Method
  SetWorksetConfiguration Method
  RevitLinkOptions Properties
  IsRelative Property
  IsValidObject Property
  RevitLinkType Class
  RevitLinkType Members
  RevitLinkType Methods
  Create Method
  Create Method (Document, ExternalResourceReference, RevitLinkOptions)
  Create Method (Document, ModelPath, RevitLinkOptions)
  CreateFromIFC Method
  GetChildIds Method
  GetConversionData Method
  GetParentId Method
  GetRootId Method
  GetTopLevelLink Method
  GetTopLevelLink Method (Document, ExternalResourceReference)
  GetTopLevelLink Method (Document, ModelPath)
  HasSaveablePositions Method
  IsFromLocalPath Method
  IsFromRevitServer Method
  IsLoaded Method
  IsNotLoadedIntoMultipleOpenDocuments Method
  Load Method
  LoadFrom Method
  LoadFrom Method (ExternalResourceReference, WorksetConfiguration)
  LoadFrom Method (ModelPath, WorksetConfiguration)
  Reload Method
  SavePositions Method
  Unload Method
  UpdateFromIFC Method
  RevitLinkType Properties
  AttachmentType Property
  IsNestedLink Property
  Parameter Property
  PathType Property
  Revolution Class
  Revolution Members
  Revolution Methods
  Revolution Properties
  Axis Property
  EndAngle Property
  Parameter Property
  Sketch Property
  StartAngle Property
  RevolvedFace Class
  RevolvedFace Members
  RevolvedFace Methods
  Intersect Method
  IsInside Method
  Triangulate Method
  RevolvedFace Properties
  Axis Property
  Curve Property
  Origin Property
  Radius Property
  RoofBase Class
  RoofBase Members
  RoofBase Methods
  RoofBase Properties
  EaveCuts Property
  FasciaDepth Property
  Parameter Property
  RoofType Property
  SlabShapeEditor Property
  RoofType Class
  RoofType Members
  RoofType Methods
  RoofType Properties
  Parameter Property
  ThermalProperties Property
  RoofTypeSet Class
  RoofTypeSet Members
  RoofTypeSet Constructor
  RoofTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  RoofTypeSet Properties
  IsEmpty Property
  Size Property
  RoofTypeSetIterator Class
  RoofTypeSetIterator Members
  RoofTypeSetIterator Constructor
  RoofTypeSetIterator Methods
  MoveNext Method
  Reset Method
  RoofTypeSetIterator Properties
  Current Property
  RoutingCondition Class
  RoutingCondition Members
  RoutingCondition Constructor
  RoutingCondition Methods
  Dispose Method
  RoutingCondition Properties
  Diameter Property
  IsValidObject Property
  RoutingConditions Class
  RoutingConditions Members
  RoutingConditions Constructor
  RoutingConditions Methods
  AppendCondition Method
  Clear Method
  Dispose Method
  GetConditionAt Method
  GetNumberOfConditions Method
  RoutingConditions Properties
  ErrorLevel Property
  IsValidObject Property
  PreferredJunctionType Property
  RoutingCriterionBase Class
  RoutingCriterionBase Members
  RoutingCriterionBase Methods
  Dispose Method
  IsEqual Method
  RoutingCriterionBase Properties
  IsValidObject Property
  RoutingPreferenceErrorLevel Enumeration
  RoutingPreferenceManager Class
  RoutingPreferenceManager Members
  RoutingPreferenceManager Methods
  AddRule Method
  AddRule Method (RoutingPreferenceRuleGroupType, RoutingPreferenceRule)
  AddRule Method (RoutingPreferenceRuleGroupType, RoutingPreferenceRule, Int32)
  Dispose Method
  GetMEPPartId Method
  GetNumberOfRules Method
  GetRule Method
  GetSharedSizes Method
  RemoveRule Method
  RoutingPreferenceManager Properties
  IsValidObject Property
  OwnerId Property
  PreferredJunctionType Property
  RoutingPreferenceRule Class
  RoutingPreferenceRule Members
  RoutingPreferenceRule Constructor
  RoutingPreferenceRule Methods
  AddCriterion Method
  Dispose Method
  GetCriterion Method
  RemoveCriteron Method
  RoutingPreferenceRule Properties
  Description Property
  IsValidObject Property
  MEPPartId Property
  NumberOfCriteria Property
  RoutingPreferenceManager Property
  RoutingPreferenceRuleGroupType Enumeration
  RPCNode Class
  RPCNode Members
  RPCNode Methods
  RPCNode Properties
  RuledFace Class
  RuledFace Members
  RuledFace Methods
  Intersect Method
  IsInside Method
  Triangulate Method
  RuledFace Properties
  Curve Property
  Point Property
  RulingsAreParallel Property
  SATExportOptions Class
  SATExportOptions Members
  SATExportOptions Constructor
  SATExportOptions Constructor
  SATExportOptions Constructor (SATExportOptions)
  SATExportOptions Methods
  Dispose Method
  SATExportOptions Properties
  IsValidObject Property
  SATImportOptions Class
  SATImportOptions Members
  SATImportOptions Constructor
  SATImportOptions Constructor
  SATImportOptions Constructor (SATImportOptions)
  SATImportOptions Methods
  SATImportOptions Properties
  SaveAsOptions Class
  SaveAsOptions Members
  SaveAsOptions Constructor
  SaveAsOptions Methods
  Dispose Method
  GetWorksharingOptions Method
  SetWorksharingOptions Method
  SaveAsOptions Properties
  Compact Property
  IsValidObject Property
  MaximumBackups Property
  OverwriteExistingFile Property
  PreviewViewId Property
  SaveModifiedLinksOptions Enumeration
  SaveOptions Class
  SaveOptions Members
  SaveOptions Constructor
  SaveOptions Methods
  Dispose Method
  SaveOptions Properties
  Compact Property
  IsValidObject Property
  PreviewViewId Property
  SchedulableField Class
  SchedulableField Members
  SchedulableField Constructor
  SchedulableField Constructor
  SchedulableField Constructor (ScheduleFieldType)
  SchedulableField Constructor (ScheduleFieldType, ElementId)
  SchedulableField Methods
  Dispose Method
  Equals Method
  GetHashCode Method
  GetName Method
  SchedulableField Operators
  Equality Operator
  Inequality Operator
  SchedulableField Properties
  FieldType Property
  IsValidObject Property
  ParameterId Property
  ScheduleDefinition Class
  ScheduleDefinition Members
  ScheduleDefinition Methods
  AddEmbeddedSchedule Method
  AddField Method
  AddField Method (SchedulableField)
  AddField Method (ScheduleFieldType)
  AddField Method (ScheduleFieldType, ElementId)
  AddFilter Method
  AddSortGroupField Method
  CanFilter Method
  CanFilterByParameterExistence Method
  CanFilterBySubstring Method
  CanFilterByValue Method
  CanHaveEmbeddedSchedule Method
  CanIncludeLinkedFiles Method
  CanSortByField Method
  ClearFields Method
  ClearFilters Method
  ClearSortGroupFields Method
  Dispose Method
  GetField Method
  GetField Method (Int32)
  GetField Method (ScheduleFieldId)
  GetFieldCount Method
  GetFieldId Method
  GetFieldIndex Method
  GetFieldOrder Method
  GetFilter Method
  GetFilterCount Method
  GetFilters Method
  GetSchedulableFields Method
  GetSortGroupField Method
  GetSortGroupFieldCount Method
  GetSortGroupFields Method
  GetValidCategoriesForEmbeddedSchedule Method
  InsertField Method
  InsertField Method (SchedulableField, Int32)
  InsertField Method (ScheduleFieldType, Int32)
  InsertField Method (ScheduleFieldType, ElementId, Int32)
  InsertFilter Method
  InsertSortGroupField Method
  IsSchedulableField Method
  IsValidCategoryForEmbeddedSchedule Method
  IsValidFieldId Method
  IsValidFieldIndex Method
  RemoveEmbeddedSchedule Method
  RemoveField Method
  RemoveField Method (Int32)
  RemoveField Method (ScheduleFieldId)
  RemoveFilter Method
  RemoveSortGroupField Method
  SetFieldOrder Method
  SetFilter Method
  SetFilters Method
  SetSortGroupField Method
  SetSortGroupFields Method
  ScheduleDefinition Properties
  AreaSchemeId Property
  CategoryId Property
  EmbeddedDefinition Property
  FamilyId Property
  GrandTotalTitle Property
  HasEmbeddedSchedule Property
  IncludeLinkedFiles Property
  IsEmbedded Property
  IsItemized Property
  IsKeySchedule Property
  IsMaterialTakeoff Property
  IsValidObject Property
  ShowGrandTotal Property
  ShowGrandTotalCount Property
  ShowGrandTotalTitle Property
  ScheduleField Class
  ScheduleField Members
  ScheduleField Methods
  CanTotal Method
  CanTotalByAssemblyType Method
  CreatesCircularReferences Method
  Dispose Method
  GetFormatOptions Method
  GetName Method
  GetSchedulableField Method
  GetStyle Method
  ResetOverride Method
  SetFormatOptions Method
  SetStyle Method
  ScheduleField Properties
  ColumnHeading Property
  Definition Property
  FieldId Property
  FieldIndex Property
  FieldType Property
  GridColumnWidth Property
  HasSchedulableField Property
  HasTotals Property
  HeadingOrientation Property
  HorizontalAlignment Property
  IsCalculatedField Property
  IsHidden Property
  IsOverridden Property
  IsValidObject Property
  ParameterId Property
  PercentageBy Property
  PercentageOf Property
  Schedule Property
  SheetColumnWidth Property
  TotalByAssemblyType Property
  UnitType Property
  ScheduleFieldId Class
  ScheduleFieldId Members
  ScheduleFieldId Constructor
  ScheduleFieldId Methods
  Equals Method
  GetHashCode Method
  ToString Method
  ScheduleFieldId Operators
  Equality Operator
  Inequality Operator
  ScheduleFieldId Properties
  IntegerValue Property
  InvalidScheduleFieldId Property
  ScheduleFieldType Enumeration
  ScheduleFilter Class
  ScheduleFilter Members
  ScheduleFilter Constructor
  ScheduleFilter Constructor
  ScheduleFilter Constructor (ScheduleFieldId, ScheduleFilterType)
  ScheduleFilter Constructor (ScheduleFieldId, ScheduleFilterType, ElementId)
  ScheduleFilter Constructor (ScheduleFieldId, ScheduleFilterType, Double)
  ScheduleFilter Constructor (ScheduleFieldId, ScheduleFilterType, Int32)
  ScheduleFilter Constructor (ScheduleFieldId, ScheduleFilterType, String)
  ScheduleFilter Methods
  Dispose Method
  GetDoubleValue Method
  GetElementIdValue Method
  GetIntegerValue Method
  GetStringValue Method
  SetNullValue Method
  SetValue Method
  SetValue Method (Double)
  SetValue Method (Int32)
  SetValue Method (String)
  SetValue Method (ElementId)
  ScheduleFilter Properties
  FieldId Property
  FilterType Property
  IsDoubleValue Property
  IsElementIdValue Property
  IsIntegerValue Property
  IsNullValue Property
  IsStringValue Property
  IsValidObject Property
  ScheduleFilterType Enumeration
  ScheduleHeadingOrientation Enumeration
  ScheduleHorizontalAlignment Enumeration
  ScheduleSheetInstance Class
  ScheduleSheetInstance Members
  ScheduleSheetInstance Methods
  Create Method
  ScheduleSheetInstance Properties
  IsTitleblockRevisionSchedule Property
  Parameter Property
  Point Property
  Rotation Property
  ScheduleId Property
  ScheduleSortGroupField Class
  ScheduleSortGroupField Members
  ScheduleSortGroupField Constructor
  ScheduleSortGroupField Constructor
  ScheduleSortGroupField Constructor (ScheduleFieldId)
  ScheduleSortGroupField Constructor (ScheduleFieldId, ScheduleSortOrder)
  ScheduleSortGroupField Methods
  Dispose Method
  ScheduleSortGroupField Properties
  FieldId Property
  IsValidObject Property
  ShowBlankLine Property
  ShowFooter Property
  ShowFooterCount Property
  ShowFooterTitle Property
  ShowHeader Property
  SortOrder Property
  ScheduleSortOrder Enumeration
  SectionType Enumeration
  Segment Class
  Segment Members
  Segment Methods
  AddSize Method
  GetSizes Method
  RemoveSize Method
  Segment Properties
  Description Property
  MaterialId Property
  Parameter Property
  Roughness Property
  SizeCount Property
  SelectionFilterAction Enumeration
  SelectionFilterElement Class
  SelectionFilterElement Members
  SelectionFilterElement Methods
  AddSet Method
  AddSingle Method
  Clear Method
  Contains Method
  Create Method
  GetElementIds Method
  IsEmpty Method
  RemoveSet Method
  RemoveSingle Method
  SetElementIds Method
  SelectionFilterElement Properties
  Parameter Property
  ServerPath Class
  ServerPath Members
  ServerPath Constructor
  ServerPath Methods
  ServerPath Properties
  ServiceType Enumeration
  SetComparisonResult Enumeration
  Settings Class
  Settings Members
  Settings Methods
  Settings Properties
  Categories Property
  ElectricalSetting Property
  TilePatterns Property
  SharedParameterApplicableRule Class
  SharedParameterApplicableRule Members
  SharedParameterApplicableRule Constructor
  SharedParameterApplicableRule Methods
  SharedParameterApplicableRule Properties
  ParameterName Property
  ShellLayerType Enumeration
  ShowHiddenLinesValues Enumeration
  SimpleWorksetConfiguration Enumeration
  SiteLocation Class
  SiteLocation Members
  SiteLocation Methods
  ConvertFromProjectTime Method
  ConvertToProjectTime Method
  SiteLocation Properties
  Elevation Property
  Latitude Property
  Longitude Property
  Parameter Property
  PlaceName Property
  TimeZone Property
  WeatherStationName Property
  Sketch Class
  Sketch Members
  Sketch Methods
  Sketch Properties
  Parameter Property
  Profile Property
  SketchPlane Property
  SketchBase Class
  SketchBase Members
  SketchBase Methods
  SketchBase Properties
  Parameter Property
  SketchPlane Class
  SketchPlane Members
  SketchPlane Methods
  Create Method
  Create Method (Document, ElementId)
  Create Method (Document, Plane)
  Create Method (Document, Reference)
  GetPlane Method
  GetPlaneReference Method
  SketchPlane Properties
  IsSuitableForModelElements Property
  Parameter Property
  SKPImportOptions Class
  SKPImportOptions Members
  SKPImportOptions Constructor
  SKPImportOptions Constructor
  SKPImportOptions Constructor (SKPImportOptions)
  SKPImportOptions Methods
  SKPImportOptions Properties
  SkyBackgroundSettings Class
  SkyBackgroundSettings Members
  SkyBackgroundSettings Methods
  SkyBackgroundSettings Properties
  VisibilityDistance Property
  SlabEdge Class
  SlabEdge Members
  SlabEdge Methods
  AddSegment Method
  SlabEdge Properties
  Parameter Property
  SlabEdgeType Property
  SlabEdgeType Class
  SlabEdgeType Members
  SlabEdgeType Methods
  SlabEdgeType Properties
  Parameter Property
  SlabEdgeTypeSet Class
  SlabEdgeTypeSet Members
  SlabEdgeTypeSet Constructor
  SlabEdgeTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  SlabEdgeTypeSet Properties
  IsEmpty Property
  Size Property
  SlabEdgeTypeSetIterator Class
  SlabEdgeTypeSetIterator Members
  SlabEdgeTypeSetIterator Constructor
  SlabEdgeTypeSetIterator Methods
  MoveNext Method
  Reset Method
  SlabEdgeTypeSetIterator Properties
  Current Property
  SlabShapeCrease Class
  SlabShapeCrease Members
  SlabShapeCrease Methods
  SlabShapeCrease Properties
  CreaseType Property
  Curve Property
  EndPoints Property
  SlabShapeCreaseArray Class
  SlabShapeCreaseArray Members
  SlabShapeCreaseArray Constructor
  SlabShapeCreaseArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  SlabShapeCreaseArray Properties
  IsEmpty Property
  Item Property
  Size Property
  SlabShapeCreaseArrayIterator Class
  SlabShapeCreaseArrayIterator Members
  SlabShapeCreaseArrayIterator Constructor
  SlabShapeCreaseArrayIterator Methods
  MoveNext Method
  Reset Method
  SlabShapeCreaseArrayIterator Properties
  Current Property
  SlabShapeCreaseType Enumeration
  SlabShapeEditor Class
  SlabShapeEditor Members
  SlabShapeEditor Methods
  DrawPoint Method
  DrawSplitLine Method
  Enable Method
  ModifySubElement Method
  ModifySubElement Method (SlabShapeCrease, Double)
  ModifySubElement Method (SlabShapeVertex, Double)
  PickSupport Method
  ResetSlabShape Method
  SlabShapeEditor Properties
  IsEnabled Property
  SlabShapeCreases Property
  SlabShapeVertices Property
  SlabShapeVertex Class
  SlabShapeVertex Members
  SlabShapeVertex Methods
  SlabShapeVertex Properties
  Position Property
  VertexType Property
  SlabShapeVertexArray Class
  SlabShapeVertexArray Members
  SlabShapeVertexArray Constructor
  SlabShapeVertexArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  SlabShapeVertexArray Properties
  IsEmpty Property
  Item Property
  Size Property
  SlabShapeVertexArrayIterator Class
  SlabShapeVertexArrayIterator Members
  SlabShapeVertexArrayIterator Constructor
  SlabShapeVertexArrayIterator Methods
  MoveNext Method
  Reset Method
  SlabShapeVertexArrayIterator Properties
  Current Property
  SlabShapeVertexType Enumeration
  SlantedOrVerticalColumnType Enumeration
  Solid Class
  Solid Members
  Solid Methods
  ComputeCentroid Method
  GetBoundingBox Method
  IntersectWithCurve Method
  Solid Properties
  Edges Property
  Faces Property
  SurfaceArea Property
  Volume Property
  SolidArray Class
  SolidArray Members
  SolidArray Constructor
  SolidArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  SolidArray Properties
  IsEmpty Property
  Item Property
  Size Property
  SolidArrayIterator Class
  SolidArrayIterator Members
  SolidArrayIterator Constructor
  SolidArrayIterator Methods
  MoveNext Method
  Reset Method
  SolidArrayIterator Properties
  Current Property
  SolidCurveIntersection Class
  SolidCurveIntersection Members
  SolidCurveIntersection Methods
  Dispose Method
  GetBasicIEnumerator Method
  GetCurveSegment Method
  GetCurveSegmentExtents Method
  GetEnumerator Method
  SolidCurveIntersection Properties
  IsValidObject Property
  ResultType Property
  SegmentCount Property
  SolidCurveIntersectionMode Enumeration
  SolidCurveIntersectionOptions Class
  SolidCurveIntersectionOptions Members
  SolidCurveIntersectionOptions Constructor
  SolidCurveIntersectionOptions Methods
  Dispose Method
  SolidCurveIntersectionOptions Properties
  IsValidObject Property
  ResultType Property
  SolidGeometry Enumeration
  SolidOptions Class
  SolidOptions Members
  SolidOptions Constructor
  SolidOptions Methods
  Dispose Method
  SolidOptions Properties
  GraphicsStyleId Property
  IsValidObject Property
  MaterialId Property
  SolidOrShellTessellationControls Class
  SolidOrShellTessellationControls Members
  SolidOrShellTessellationControls Constructor
  SolidOrShellTessellationControls Methods
  DisableLevelOfDetail Method
  Dispose Method
  UseLevelOfDetail Method
  SolidOrShellTessellationControls Properties
  Accuracy Property
  IsValidObject Property
  LevelOfDetail Property
  MinAngleInTriangle Property
  MinExternalAngleBetweenTriangles Property
  SolidSolidCutUtils Class
  SolidSolidCutUtils Members
  SolidSolidCutUtils Methods
  AddCutBetweenSolids Method
  AddCutBetweenSolids Method (Document, Element, Element)
  AddCutBetweenSolids Method (Document, Element, Element, Boolean)
  CanElementCutElement Method
  CutExistsBetweenElements Method
  GetCuttingSolids Method
  GetSolidsBeingCut Method
  IsAllowedForSolidCut Method
  IsElementFromAppropriateContext Method
  RemoveCutBetweenSolids Method
  SplitFacesOfCuttingSolid Method
  SolidUtils Class
  SolidUtils Members
  SolidUtils Methods
  IsValidForTessellation Method
  SplitVolumes Method
  TessellateSolidOrShell Method
  SortingOrder Enumeration
  SpacingRule Class
  SpacingRule Members
  SpacingRule Methods
  SetLayoutFixedDistance Method
  SetLayoutFixedNumber Method
  SetLayoutMaximumSpacing Method
  SetLayoutMinimumSpacing Method
  SetLayoutNone Method
  SpacingRule Properties
  BeltMeasurement Property
  Distance Property
  GridlinesRotation Property
  HasBeltMeasurement Property
  Justification Property
  Layout Property
  Number Property
  Offset Property
  SpacingRuleJustification Enumeration
  SpacingRuleLayout Enumeration
  SpatialElement Class
  SpatialElement Members
  SpatialElement Methods
  GetBoundarySegments Method
  SpatialElement Properties
  Area Property
  Level Property
  Location Property
  Name Property
  Number Property
  Parameter Property
  Perimeter Property
  SpatialElementBoundaryLocation Enumeration
  SpatialElementBoundaryOptions Class
  SpatialElementBoundaryOptions Members
  SpatialElementBoundaryOptions Constructor
  SpatialElementBoundaryOptions Methods
  Dispose Method
  SpatialElementBoundaryOptions Properties
  IsValidObject Property
  SpatialElementBoundaryLocation Property
  StoreFreeBoundaryFaces Property
  SpatialElementBoundarySubface Class
  SpatialElementBoundarySubface Members
  SpatialElementBoundarySubface Methods
  Dispose Method
  GetBoundingElementFace Method
  GetSpatialElementFace Method
  GetSubface Method
  SpatialElementBoundarySubface Properties
  IsValidObject Property
  SpatialBoundaryElement Property
  SubfaceArisesFromElementFace Property
  SubfaceType Property
  SpatialElementCalculationLocation Class
  SpatialElementCalculationLocation Members
  SpatialElementCalculationLocation Methods
  SpatialElementCalculationLocation Properties
  MarkerPosition Property
  Parameter Property
  SpatialElementCalculationPoint Class
  SpatialElementCalculationPoint Members
  SpatialElementCalculationPoint Methods
  SpatialElementCalculationPoint Properties
  Parameter Property
  Position Property
  SpatialElementFromToCalculationPoints Class
  SpatialElementFromToCalculationPoints Members
  SpatialElementFromToCalculationPoints Methods
  Flip Method
  IsAcceptableFromPosition Method
  IsAcceptableToPosition Method
  MakeFromPositionAcceptable Method
  MakeToPositionAcceptable Method
  SpatialElementFromToCalculationPoints Properties
  FromPosition Property
  Parameter Property
  ToPosition Property
  SpatialElementGeometryCalculator Class
  SpatialElementGeometryCalculator Members
  SpatialElementGeometryCalculator Constructor
  SpatialElementGeometryCalculator Constructor (Document)
  SpatialElementGeometryCalculator Constructor (Document, SpatialElementBoundaryOptions)
  SpatialElementGeometryCalculator Methods
  CalculateSpatialElementGeometry Method
  CanCalculateGeometry Method
  Dispose Method
  GetOptions Method
  IsRoomOrSpace Method
  SpatialElementGeometryCalculator Properties
  IsValidObject Property
  SpatialElementGeometryResults Class
  SpatialElementGeometryResults Members
  SpatialElementGeometryResults Methods
  Dispose Method
  GetBoundaryFaceInfo Method
  GetGeometry Method
  SpatialElementGeometryResults Properties
  IsValidObject Property
  SpatialElementTag Class
  SpatialElementTag Members
  SpatialElementTag Methods
  SpatialElementTag Properties
  HasLeader Property
  Location Property
  Name Property
  Parameter Property
  View Property
  SpatialElementType Enumeration
  SpecialType Enumeration
  SpotDimension Class
  SpotDimension Members
  SpotDimension Methods
  SpotDimension Properties
  Location Property
  Parameter Property
  SpotDimensionType Property
  SpotDimensionType Class
  SpotDimensionType Members
  SpotDimensionType Methods
  SpotDimensionType Properties
  Parameter Property
  SpotDimensionTypeSet Class
  SpotDimensionTypeSet Members
  SpotDimensionTypeSet Constructor
  SpotDimensionTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  SpotDimensionTypeSet Properties
  IsEmpty Property
  Size Property
  SpotDimensionTypeSetIterator Class
  SpotDimensionTypeSetIterator Members
  SpotDimensionTypeSetIterator Constructor
  SpotDimensionTypeSetIterator Methods
  MoveNext Method
  Reset Method
  SpotDimensionTypeSetIterator Properties
  Current Property
  StairsEditScope Class
  StairsEditScope Members
  StairsEditScope Constructor
  StairsEditScope Methods
  Start Method
  Start Method (ElementId)
  Start Method (ElementId, ElementId)
  StairsEditScope Properties
  IsPermitted Property
  StartingViewSettings Class
  StartingViewSettings Members
  StartingViewSettings Methods
  GetStartingViewSettings Method
  IsAcceptableStartingView Method
  StartingViewSettings Properties
  Parameter Property
  ViewId Property
  StickSymbolLocation Enumeration
  StorageType Enumeration
  StructDeckEmbeddingType Enumeration
  StructuralAsset Class
  StructuralAsset Members
  StructuralAsset Constructor
  StructuralAsset Methods
  Copy Method
  Dispose Method
  Equals Method
  Equals Method (StructuralAsset)
  SetPoissonRatio Method
  SetShearModulus Method
  SetThermalExpansionCoefficient Method
  SetYoungModulus Method
  StructuralAsset Properties
  Behavior Property
  ConcreteBendingReinforcement Property
  ConcreteCompression Property
  ConcreteShearReinforcement Property
  ConcreteShearStrengthReduction Property
  DampingRatio Property
  Density Property
  IsValidObject Property
  Lightweight Property
  MetalReductionFactor Property
  MetalResistanceCalculationStrength Property
  MinimumTensileStrength Property
  MinimumYieldStress Property
  Name Property
  PoissonRatio Property
  ShearModulus Property
  StructuralAssetClass Property
  SubClass Property
  ThermalExpansionCoefficient Property
  WoodBendingStrength Property
  WoodGrade Property
  WoodParallelCompressionStrength Property
  WoodParallelShearStrength Property
  WoodPerpendicularCompressionStrength Property
  WoodPerpendicularShearStrength Property
  WoodSpecies Property
  YoungModulus Property
  StructuralAssetClass Enumeration
  StructuralBehavior Enumeration
  StructuralReleaseType Enumeration
  SubfaceType Enumeration
  SubTransaction Class
  SubTransaction Members
  SubTransaction Constructor
  SubTransaction Methods
  Commit Method
  Dispose Method
  GetStatus Method
  HasEnded Method
  HasStarted Method
  RollBack Method
  Start Method
  SubTransaction Properties
  IsValidObject Property
  SunAndShadowSettings Class
  SunAndShadowSettings Members
  SunAndShadowSettings Methods
  CalculateTimeZone Method
  FitToModel Method
  GetActiveSunAndShadowSettings Method
  GetFrameAltitude Method
  GetFrameAzimuth Method
  GetFrameTime Method
  GetMatchingPreset Method
  GetSunrise Method
  GetSunset Method
  IsAfterStartDateAndTime Method
  IsBeforeEndDateAndTime Method
  IsFrameValid Method
  IsGroundPlaneLevelValid Method
  IsTimeIntervalValid Method
  SunAndShadowSettings Properties
  ActiveFrame Property
  ActiveFrameTime Property
  Altitude Property
  Azimuth Property
  EndDateAndTime Property
  GroundPlaneHeight Property
  GroundPlaneLevelId Property
  Latitude Property
  Longitude Property
  NumberOfFrames Property
  Parameter Property
  ProjectLocationId Property
  ProjectLocationName Property
  RelativeToView Property
  SharesSettings Property
  StartDateAndTime Property
  SunAndShadowType Property
  SunriseToSunset Property
  TimeInterval Property
  TimeZone Property
  UsesDST Property
  UsesGroundPlane Property
  Visible Property
  SunAndShadowType Enumeration
  SunStudyTimeInterval Enumeration
  Sweep Class
  Sweep Members
  Sweep Methods
  Sweep Properties
  IsTrajectorySegmentationEnabled Property
  MaxSegmentAngle Property
  Parameter Property
  Path3d Property
  PathSketch Property
  ProfileSketch Property
  ProfileSymbol Property
  SweepProfile Class
  SweepProfile Members
  SweepProfile Methods
  SweepProfile Properties
  SweptBlend Class
  SweptBlend Members
  SweptBlend Methods
  GetVertexConnectionMap Method
  SetVertexConnectionMap Method
  SweptBlend Properties
  BottomProfile Property
  BottomProfileSymbol Property
  BottomSketch Property
  Parameter Property
  PathSketch Property
  SelectedPath Property
  TopProfile Property
  TopProfileSymbol Property
  TopSketch Property
  SymbolicCurve Class
  SymbolicCurve Members
  SymbolicCurve Methods
  GetVisibility Method
  SetVisibility Method
  SymbolicCurve Properties
  IsDrawnInForeground Property
  Parameter Property
  ReferenceType Property
  Subcategory Property
  SymbolicCurveArray Class
  SymbolicCurveArray Members
  SymbolicCurveArray Constructor
  SymbolicCurveArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  SymbolicCurveArray Properties
  IsEmpty Property
  Item Property
  Size Property
  SymbolicCurveArrayIterator Class
  SymbolicCurveArrayIterator Members
  SymbolicCurveArrayIterator Constructor
  SymbolicCurveArrayIterator Methods
  MoveNext Method
  Reset Method
  SymbolicCurveArrayIterator Properties
  Current Property
  SynchronizeWithCentralOptions Class
  SynchronizeWithCentralOptions Members
  SynchronizeWithCentralOptions Constructor
  SynchronizeWithCentralOptions Methods
  Dispose Method
  GetRelinquishOptions Method
  SetRelinquishOptions Method
  SynchronizeWithCentralOptions Properties
  Comment Property
  Compact Property
  IsValidObject Property
  RelinquishBorrowedElements Property
  RelinquishFamilyWorksets Property
  RelinquishProjectStandardWorksets Property
  RelinquishUserCreatedWorksets Property
  RelinquishViewWorksets Property
  SaveLocalAfter Property
  SaveLocalBefore Property
  SaveLocalFile Property
  TableCellCalculatedValueData Class
  TableCellCalculatedValueData Members
  TableCellCalculatedValueData Methods
  Dispose Method
  GetName Method
  TableCellCalculatedValueData Properties
  IsValidObject Property
  TableCellCombinedParameterData Class
  TableCellCombinedParameterData Members
  TableCellCombinedParameterData Methods
  Dispose Method
  TableCellCombinedParameterData Properties
  CategoryId Property
  IsValidObject Property
  ParamId Property
  Prefix Property
  SampleValue Property
  Separator Property
  Suffix Property
  TableCellStyle Class
  TableCellStyle Members
  TableCellStyle Constructor
  TableCellStyle Constructor
  TableCellStyle Constructor (TableCellStyle)
  TableCellStyle Methods
  Dispose Method
  GetCellStyleOverrideOptions Method
  ResetOverride Method
  SetCellStyleOverrideOptions Method
  TableCellStyle Properties
  BackgroundColor Property
  BorderBottomLineStyle Property
  BorderLeftLineStyle Property
  BorderRightLineStyle Property
  BorderTopLineStyle Property
  FontHorizontalAlignment Property
  FontName Property
  FontVerticalAlignment Property
  IsEnabled Property
  IsFontBold Property
  IsFontItalic Property
  IsFontUnderline Property
  IsInactivePhaseload Property
  IsOverridden Property
  IsReadOnly Property
  IsValidObject Property
  SheetBackgroundColor Property
  TextColor Property
  TextOrientation Property
  TextSize Property
  TableCellStyleOverrideOptions Class
  TableCellStyleOverrideOptions Members
  TableCellStyleOverrideOptions Constructor
  TableCellStyleOverrideOptions Constructor
  TableCellStyleOverrideOptions Constructor (TableCellStyleOverrideOptions)
  TableCellStyleOverrideOptions Methods
  Dispose Method
  SetAllOverrides Method
  TableCellStyleOverrideOptions Properties
  BackgroundColor Property
  Bold Property
  BorderBottomLineStyle Property
  BorderLeftLineStyle Property
  BorderLineStyle Property
  BorderRightLineStyle Property
  BorderTopLineStyle Property
  Font Property
  FontColor Property
  FontSize Property
  HorizontalAlignment Property
  IsValidObject Property
  Italics Property
  TextOrientation Property
  Underline Property
  VerticalAlignment Property
  TableData Class
  TableData Members
  TableData Methods
  Dispose Method
  GetSectionData Method
  GetSectionData Method (Int32)
  GetSectionData Method (SectionType)
  IsEqual Method
  TableData Properties
  FreezeColumnsAndRows Property
  IsValidObject Property
  NumberOfSections Property
  Width Property
  WidthInPixels Property
  TableMergedCell Class
  TableMergedCell Members
  TableMergedCell Constructor
  TableMergedCell Constructor
  TableMergedCell Constructor (Int32, Int32, Int32, Int32)
  TableMergedCell Methods
  Dispose Method
  TableMergedCell Properties
  Bottom Property
  IsValidObject Property
  Left Property
  Right Property
  Top Property
  TableSectionData Class
  TableSectionData Members
  TableSectionData Methods
  AllowOverrideCellStyle Method
  CanInsertColumn Method
  CanInsertRow Method
  CanRemoveColumn Method
  CanRemoveRow Method
  ClearCell Method
  Dispose Method
  GetCellCalculatedValue Method
  GetCellCalculatedValue Method (Int32)
  GetCellCalculatedValue Method (Int32, Int32)
  GetCellCategoryId Method
  GetCellCategoryId Method (Int32)
  GetCellCategoryId Method (Int32, Int32)
  GetCellCombinedParameters Method
  GetCellCombinedParameters Method (Int32)
  GetCellCombinedParameters Method (Int32, Int32)
  GetCellFormatOptions Method
  GetCellFormatOptions Method (Int32, Document)
  GetCellFormatOptions Method (Int32, Int32, Document)
  GetCellParamId Method
  GetCellParamId Method (Int32)
  GetCellParamId Method (Int32, Int32)
  GetCellText Method
  GetCellType Method
  GetCellType Method (Int32)
  GetCellType Method (Int32, Int32)
  GetCellUnitType Method
  GetColumnWidth Method
  GetColumnWidthInPixels Method
  GetMergedCell Method
  GetRowHeight Method
  GetRowHeightInPixels Method
  GetTableCellStyle Method
  InsertColumn Method
  InsertColumn Method (Int32)
  InsertColumn Method (Int32, Boolean)
  InsertImage Method
  InsertRow Method
  IsAcceptableParamIdAndCategoryId Method
  IsAcceptableParamIdAndCategoryId Method (ElementId, ElementId)
  IsAcceptableParamIdAndCategoryId Method (Int32, ElementId, ElementId)
  IsCellFormattable Method
  IsCellOverridden Method
  IsCellOverridden Method (Int32)
  IsCellOverridden Method (Int32, Int32)
  IsDataOutOfDate Method
  IsValidColumnNumber Method
  IsValidImageSymbolId Method
  IsValidRowNumber Method
  MergeCells Method
  RefreshData Method
  RemoveColumn Method
  RemoveRow Method
  ResetCellOverride Method
  ResetCellOverride Method (Int32)
  ResetCellOverride Method (Int32, Int32)
  SetCellCalculatedValue Method
  SetCellCalculatedValue Method (Int32, TableCellCalculatedValueData)
  SetCellCalculatedValue Method (Int32, Int32, TableCellCalculatedValueData)
  SetCellCombinedParameters Method
  SetCellCombinedParameters Method (Int32, IList(TableCellCombinedParameterData))
  SetCellCombinedParameters Method (Int32, Int32, IList(TableCellCombinedParameterData))
  SetCellFormatOptions Method
  SetCellParamIdAndCategoryId Method
  SetCellParamIdAndCategoryId Method (Int32, ElementId, ElementId)
  SetCellParamIdAndCategoryId Method (Int32, Int32, ElementId, ElementId)
  SetCellStyle Method
  SetCellStyle Method (TableCellStyle)
  SetCellStyle Method (Int32, TableCellStyle)
  SetCellStyle Method (Int32, Int32, TableCellStyle)
  SetCellText Method
  SetCellType Method
  SetCellType Method (Int32, CellType)
  SetCellType Method (Int32, Int32, CellType)
  SetColumnWidth Method
  SetColumnWidthInPixels Method
  SetMergedCell Method
  SetRowHeight Method
  SetRowHeightInPixels Method
  TableSectionData Properties
  FirstColumnNumber Property
  FirstRowNumber Property
  HideSection Property
  IsValidObject Property
  LastColumnNumber Property
  LastRowNumber Property
  NeedsRefresh Property
  NumberOfColumns Property
  NumberOfRows Property
  TableView Class
  TableView Members
  TableView Methods
  GetAvailableParameterCategories Method
  GetAvailableParameters Method
  GetCalculatedValueName Method
  GetCalculatedValueText Method
  GetCellText Method
  IsOkToEditParam Method
  IsValidSectionType Method
  Print Method
  TableView Properties
  MaximumColumnWidth Property
  MaximumGridWidth Property
  MaximumRowHeight Property
  MinimumColumnWidth Property
  MinimumRowHeight Property
  Parameter Property
  TargetId Property
  TagMode Enumeration
  TagOrientation Enumeration
  TemporaryViewMode Enumeration
  TessellatedBuildIssue Class
  TessellatedBuildIssue Members
  TessellatedBuildIssue Methods
  Dispose Method
  GetIssueDescription Method
  IsValidIssue Method
  MakesDataUnusable Method
  ReportIssueToDataSource Method
  TessellatedBuildIssue Properties
  IsValidObject Property
  NumberEncountered Property
  TessellatedBuildIssueType Enumeration
  TessellatedFace Class
  TessellatedFace Members
  TessellatedFace Constructor
  TessellatedFace Constructor (IList(XYZ), ElementId)
  TessellatedFace Constructor (IList(IList(XYZ)), ElementId)
  TessellatedFace Methods
  Dispose Method
  GetBoundaryLoops Method
  TessellatedFace Properties
  IsValidObject Property
  MaterialId Property
  TessellatedShapeBuilder Class
  TessellatedShapeBuilder Members
  TessellatedShapeBuilder Constructor
  TessellatedShapeBuilder Methods
  AddFace Method
  AreTargetAndFallbackCompatible Method
  Build Method
  CancelConnectedFaceSet Method
  Clear Method
  CloseConnectedFaceSet Method
  CreateMeshByExtrusion Method
  Dispose Method
  DoesFaceHaveEnoughLoopsAndVertices Method
  OpenConnectedFaceSet Method
  TessellatedShapeBuilder Properties
  IsFaceSetOpen Property
  IsValidObject Property
  LogInteger Property
  LogString Property
  NumberOfCompletedFaceSets Property
  OwnerInfo Property
  TessellatedShapeBuilderFallback Enumeration
  TessellatedShapeBuilderOutcome Enumeration
  TessellatedShapeBuilderResult Class
  TessellatedShapeBuilderResult Members
  TessellatedShapeBuilderResult Methods
  Dispose Method
  GetGeometricalObjects Method
  GetIssuesForFaceSet Method
  GetNumberOfFaceSets Method
  TessellatedShapeBuilderResult Properties
  AreObjectsAvailable Property
  HasInvalidData Property
  IsValidObject Property
  Outcome Property
  TessellatedShapeBuilderTarget Enumeration
  TextAlignFlags Enumeration
  TextAlignMask Enumeration
  TextElement Class
  TextElement Members
  TextElement Methods
  TextElement Properties
  Align Property
  BaseDirection Property
  Height Property
  LineWidth Property
  Parameter Property
  Symbol Property
  Text Property
  UpDirection Property
  TextElementBackground Enumeration
  TextElementType Class
  TextElementType Members
  TextElementType Methods
  TextElementType Properties
  Parameter Property
  TextNote Class
  TextNote Members
  TextNote Methods
  AddLeader Method
  RemoveLeaders Method
  TextNote Properties
  Coord Property
  Leaders Property
  Parameter Property
  TextNoteType Property
  Width Property
  TextNoteLeaderStyles Enumeration
  TextNoteLeaderTypes Enumeration
  TextNoteType Class
  TextNoteType Members
  TextNoteType Methods
  TextNoteType Properties
  Parameter Property
  TextNoteTypeSet Class
  TextNoteTypeSet Members
  TextNoteTypeSet Constructor
  TextNoteTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  TextNoteTypeSet Properties
  IsEmpty Property
  Size Property
  TextNoteTypeSetIterator Class
  TextNoteTypeSetIterator Members
  TextNoteTypeSetIterator Constructor
  TextNoteTypeSetIterator Methods
  MoveNext Method
  Reset Method
  TextNoteTypeSetIterator Properties
  Current Property
  TextTreatment Enumeration
  ThermalAsset Class
  ThermalAsset Members
  ThermalAsset Constructor
  ThermalAsset Methods
  Copy Method
  Dispose Method
  Equals Method
  Equals Method (ThermalAsset)
  ThermalAsset Properties
  Behavior Property
  Compressibility Property
  Density Property
  ElectricalResistivity Property
  Emissivity Property
  GasViscosity Property
  IsValidObject Property
  LiquidViscosity Property
  Name Property
  Permeability Property
  Porosity Property
  Reflectivity Property
  SpecificHeat Property
  SpecificHeatOfVaporization Property
  ThermalConductivity Property
  ThermalMaterialType Property
  TransmitsLight Property
  VaporPressure Property
  ThermalMaterialType Enumeration
  ThermalProperties Class
  ThermalProperties Members
  ThermalProperties Methods
  ThermalProperties Properties
  Absorptance Property
  HeatTransferCoefficient Property
  IsValidObject Property
  Roughness Property
  ThermalMass Property
  ThermalResistance Property
  TilePattern Class
  TilePattern Members
  TilePattern Methods
  TilePattern Properties
  Parameter Property
  TilePatternType Property
  TilesPerSeedNode Property
  TilePatterns Class
  TilePatterns Members
  TilePatterns Methods
  GetTilePattern Method
  TilePatterns Properties
  TilePatternsBuiltIn Enumeration
  Transaction Class
  Transaction Members
  Transaction Constructor
  Transaction Constructor (Document)
  Transaction Constructor (Document, String)
  Transaction Methods
  Commit Method
  Commit Method
  Commit Method (FailureHandlingOptions)
  Dispose Method
  GetFailureHandlingOptions Method
  GetName Method
  GetStatus Method
  HasEnded Method
  HasStarted Method
  RollBack Method
  RollBack Method
  RollBack Method (FailureHandlingOptions)
  SetFailureHandlingOptions Method
  SetName Method
  Start Method
  Start Method
  Start Method (String)
  Transaction Properties
  IsValidObject Property
  TransactionGroup Class
  TransactionGroup Members
  TransactionGroup Constructor
  TransactionGroup Constructor (Document)
  TransactionGroup Constructor (Document, String)
  TransactionGroup Methods
  Assimilate Method
  Commit Method
  Dispose Method
  GetName Method
  GetStatus Method
  HasEnded Method
  HasStarted Method
  RollBack Method
  SetName Method
  Start Method
  Start Method
  Start Method (String)
  TransactionGroup Properties
  IsFailureHandlingForcedModal Property
  IsValidObject Property
  TransactionStatus Enumeration
  TransactWithCentralOptions Class
  TransactWithCentralOptions Members
  TransactWithCentralOptions Constructor
  TransactWithCentralOptions Methods
  Dispose Method
  GetLockCallback Method
  SetLockCallback Method
  TransactWithCentralOptions Properties
  IsValidObject Property
  Transform Class
  Transform Members
  Transform Constructor
  Transform Methods
  AlmostEqual Method
  CreateReflection Method
  CreateRotation Method
  CreateRotationAtPoint Method
  CreateTranslation Method
  Multiply Method
  OfPoint Method
  OfVector Method
  ScaleBasis Method
  ScaleBasisAndOrigin Method
  Transform Operators
  Multiply Operator
  Transform Properties
  Basis Property
  BasisX Property
  BasisY Property
  BasisZ Property
  Determinant Property
  HasReflection Property
  Identity Property
  Inverse Property
  IsConformal Property
  IsIdentity Property
  IsTranslation Property
  Origin Property
  Scale Property
  TransmissionData Class
  TransmissionData Members
  TransmissionData Constructor
  TransmissionData Methods
  Dispose Method
  DocumentIsNotTransmitted Method
  GetAllExternalFileReferenceIds Method
  GetDesiredReferenceData Method
  GetLastSavedReferenceData Method
  IsDocumentTransmitted Method
  ReadTransmissionData Method
  SetDesiredReferenceData Method
  WriteTransmissionData Method
  TransmissionData Properties
  IsTransmitted Property
  IsValidObject Property
  UserData Property
  Version Property
  TransmittedModelOptions Enumeration
  TriangleInShellComponent Class
  TriangleInShellComponent Members
  TriangleInShellComponent Constructor
  TriangleInShellComponent Methods
  Dispose Method
  TriangleInShellComponent Properties
  IsValidObject Property
  VertexIndex0 Property
  VertexIndex1 Property
  VertexIndex2 Property
  TriangulatedShellComponent Class
  TriangulatedShellComponent Members
  TriangulatedShellComponent Methods
  Clear Method
  Dispose Method
  GetTriangle Method
  GetVertex Method
  TriangulatedShellComponent Properties
  IsClosed Property
  IsValidObject Property
  TriangleCount Property
  VertexCount Property
  TriangulatedSolidOrShell Class
  TriangulatedSolidOrShell Members
  TriangulatedSolidOrShell Methods
  Dispose Method
  GetShellComponent Method
  TriangulatedSolidOrShell Properties
  IsValidObject Property
  ShellComponentCount Property
  TriangulationInterface Class
  TriangulationInterface Members
  TriangulationInterface Methods
  Dispose Method
  TriangulationInterface Properties
  IsValidObject Property
  TriangulationInterfaceForTriangulatedShellComponent Class
  TriangulationInterfaceForTriangulatedShellComponent Members
  TriangulationInterfaceForTriangulatedShellComponent Constructor
  TriangulationInterfaceForTriangulatedShellComponent Methods
  TriangulationInterfaceForTriangulatedShellComponent Properties
  TriangulationInterfaceForTriangulatedSolidOrShell Class
  TriangulationInterfaceForTriangulatedSolidOrShell Members
  TriangulationInterfaceForTriangulatedSolidOrShell Constructor
  TriangulationInterfaceForTriangulatedSolidOrShell Methods
  TriangulationInterfaceForTriangulatedSolidOrShell Properties
  TriOrQuadFacet Class
  TriOrQuadFacet Members
  TriOrQuadFacet Methods
  Dispose Method
  GetVertexIndex Method
  TriOrQuadFacet Properties
  IsValidObject Property
  Normal Property
  NumberOfVertices Property
  TypeBinding Class
  TypeBinding Members
  TypeBinding Constructor
  TypeBinding Constructor
  TypeBinding Constructor (CategorySet)
  TypeBinding Methods
  TypeBinding Properties
  UnitFormatUtils Class
  UnitFormatUtils Members
  UnitFormatUtils Methods
  Format Method
  Format Method (Units, UnitType, Double, Boolean, Boolean)
  Format Method (Units, UnitType, Double, Boolean, Boolean, FormatValueOptions)
  FormatValueToString Method
  FormatValueToString Method (Units, UnitType, Double, Boolean, Boolean)
  FormatValueToString Method (Units, UnitType, Double, Boolean, Boolean, FormatValueOptions)
  TryParse Method
  TryParse Method (Units, UnitType, String, Double)
  TryParse Method (Units, UnitType, String, ValueParsingOptions, Double)
  TryParse Method (Units, UnitType, String, Double, String)
  TryParse Method (Units, UnitType, String, ValueParsingOptions, Double, String)
  UnitGroup Enumeration
  Units Class
  Units Members
  Units Constructor
  Units Methods
  Dispose Method
  GetDisplayUnitType Method
  GetFormatOptions Method
  GetModifiableUnitTypes Method
  IsModifiableUnitType Method
  IsValidDecimalSymbolAndGrouping Method
  SetDecimalSymbolAndGrouping Method
  SetFormatOptions Method
  Units Properties
  DecimalSymbol Property
  DigitGroupingAmount Property
  DigitGroupingSymbol Property
  IsValidObject Property
  UnitSymbolType Enumeration
  UnitSystem Enumeration
  UnitType Enumeration
  UnitUtils Class
  UnitUtils Members
  UnitUtils Methods
  Convert Method
  ConvertFromInternalUnits Method
  ConvertToInternalUnits Method
  GetTypeCatalogString Method
  GetTypeCatalogString Method (DisplayUnitType)
  GetTypeCatalogString Method (UnitType)
  GetUnitGroup Method
  GetValidDisplayUnits Method
  GetValidDisplayUnits Method
  GetValidDisplayUnits Method (UnitType)
  GetValidUnitTypes Method
  IsValidDisplayUnit Method
  IsValidDisplayUnit Method (DisplayUnitType)
  IsValidDisplayUnit Method (UnitType, DisplayUnitType)
  IsValidUnitType Method
  UpdaterData Class
  UpdaterData Members
  UpdaterData Methods
  Dispose Method
  GetAddedElementIds Method
  GetDeletedElementIds Method
  GetDocument Method
  GetModifiedElementIds Method
  IsChangeTriggered Method
  UpdaterData Properties
  IsValidObject Property
  UpdaterId Class
  UpdaterId Members
  UpdaterId Constructor
  UpdaterId Methods
  Dispose Method
  GetAddInId Method
  GetGUID Method
  UpdaterId Properties
  IsValidObject Property
  UpdaterInfo Class
  UpdaterInfo Members
  UpdaterInfo Methods
  Dispose Method
  UpdaterInfo Properties
  AdditionalInformation Property
  ApplicationName Property
  IsOptional Property
  IsValidObject Property
  UpdaterName Property
  UpdaterRegistry Class
  UpdaterRegistry Members
  UpdaterRegistry Methods
  AddTrigger Method
  AddTrigger Method (UpdaterId, ElementFilter, ChangeType)
  AddTrigger Method (UpdaterId, Document, ElementFilter, ChangeType)
  AddTrigger Method (UpdaterId, Document, ICollection(ElementId), ChangeType)
  DisableUpdater Method
  Dispose Method
  EnableUpdater Method
  GetIsUpdaterOptional Method
  GetRegisteredUpdaterInfos Method
  GetRegisteredUpdaterInfos Method
  GetRegisteredUpdaterInfos Method (Document)
  IsUpdaterEnabled Method
  IsUpdaterRegistered Method
  IsUpdaterRegistered Method (UpdaterId)
  IsUpdaterRegistered Method (UpdaterId, Document)
  RegisterUpdater Method
  RegisterUpdater Method (IUpdater)
  RegisterUpdater Method (IUpdater, Document)
  RegisterUpdater Method (IUpdater, Boolean)
  RegisterUpdater Method (IUpdater, Document, Boolean)
  RemoveAllTriggers Method
  RemoveDocumentTriggers Method
  SetExecutionOrder Method
  SetIsUpdaterOptional Method
  UnregisterUpdater Method
  UnregisterUpdater Method (UpdaterId)
  UnregisterUpdater Method (UpdaterId, Document)
  UpdaterRegistry Properties
  IsValidObject Property
  UV Class
  UV Members
  UV Constructor
  UV Constructor
  UV Constructor (Double, Double)
  UV Methods
  Add Method
  AngleTo Method
  CrossProduct Method
  DistanceTo Method
  Divide Method
  DotProduct Method
  GetLength Method
  IsAlmostEqualTo Method
  IsAlmostEqualTo Method (UV)
  IsAlmostEqualTo Method (UV, Double)
  IsUnitLength Method
  IsZeroLength Method
  Multiply Method
  Negate Method
  Normalize Method
  Subtract Method
  ToString Method
  UV Operators
  Addition Operator
  Division Operator
  Multiply Operator
  Multiply Operator (Double, UV)
  Multiply Operator (UV, Double)
  Subtraction Operator
  UnaryNegation Operator
  UV Properties
  BasisU Property
  BasisV Property
  Item Property
  U Property
  V Property
  Zero Property
  UVGridlineType Enumeration
  ValueAtPointBase Class
  ValueAtPointBase Members
  ValueAtPointBase Methods
  ClearAllFlags Method
  ClearFlagsAt Method
  Dispose Method
  GetFlags Method
  SetFlags Method
  SetFlags Method (IList(Int32))
  SetFlags Method (Int32)
  SetFlags Method (Int32, Int32)
  ValueAtPointBase Properties
  IsValidObject Property
  ValueAtPointFlags Enumeration
  ValueParsingOptions Class
  ValueParsingOptions Members
  ValueParsingOptions Constructor
  ValueParsingOptions Methods
  Dispose Method
  GetFormatOptions Method
  SetFormatOptions Method
  ValueParsingOptions Properties
  AllowedValues Property
  FormatOptions Property
  IsValidObject Property
  VertexIndexPair Class
  VertexIndexPair Members
  VertexIndexPair Constructor
  VertexIndexPair Methods
  VertexIndexPair Properties
  Bottom Property
  Top Property
  VertexIndexPairArray Class
  VertexIndexPairArray Members
  VertexIndexPairArray Constructor
  VertexIndexPairArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  VertexIndexPairArray Properties
  IsEmpty Property
  Item Property
  Size Property
  VertexIndexPairArrayIterator Class
  VertexIndexPairArrayIterator Members
  VertexIndexPairArrayIterator Constructor
  VertexIndexPairArrayIterator Methods
  MoveNext Method
  Reset Method
  VertexIndexPairArrayIterator Properties
  Current Property
  VertexPair Class
  VertexPair Members
  VertexPair Constructor
  VertexPair Methods
  Dispose Method
  VertexPair Properties
  First Property
  IsValidObject Property
  Second Property
  VerticalAlignmentStyle Enumeration
  View Class
  View Members
  View Methods
  AddFilter Method
  AllowsAnalysisDisplay Method
  ApplyViewTemplateParameters Method
  CanCategoryBeHiddenTemporary Method
  CanEnableTemporaryViewPropertiesMode Method
  CanModifyDetailLevel Method
  CanModifyDisplayStyle Method
  CanModifyViewDiscipline Method
  CanUseTemporaryVisibilityModes Method
  CanViewBeDuplicated Method
  ConvertTemporaryHideIsolateToPermanent Method
  DisableTemporaryViewMode Method
  Duplicate Method
  EnableRevealHiddenMode Method
  EnableTemporaryViewPropertiesMode Method
  GetBackground Method
  GetCategoryOverrides Method
  GetCropRegionShapeManager Method
  GetCropRegionShapeManagerForReferenceCallout Method
  GetDependentViewIds Method
  GetElementOverrides Method
  GetFilterOverrides Method
  GetFilters Method
  GetFilterVisibility Method
  GetNonControlledTemplateParameterIds Method
  GetPointCloudOverrides Method
  GetPrimaryViewId Method
  GetReferenceCallouts Method
  GetReferenceElevations Method
  GetReferenceSections Method
  GetSketchyLines Method
  GetTemplateParameterIds Method
  GetTemporaryViewPropertiesId Method
  GetTemporaryViewPropertiesName Method
  GetViewDisplayModel Method
  GetVisibility Method
  GetWorksetVisibility Method
  GetWorksharingDisplayMode Method
  HasDetailLevel Method
  HasDisplayStyle Method
  HasViewDiscipline Method
  HideActiveWorkPlane Method
  HideCategoriesTemporary Method
  HideCategoryTemporary Method
  HideElements Method
  HideElementsTemporary Method
  HideElementTemporary Method
  IsCategoryOverridable Method
  IsElementVisibleInTemporaryViewMode Method
  IsFilterApplied Method
  IsInTemporaryViewMode Method
  IsolateCategoriesTemporary Method
  IsolateCategoryTemporary Method
  IsolateElementsTemporary Method
  IsolateElementTemporary Method
  IsTemporaryHideIsolateActive Method
  IsTemporaryViewPropertiesModeEnabled Method
  IsValidViewScale Method
  IsValidViewTemplate Method
  IsWorksetVisible Method
  Print Method
  Print Method
  Print Method (Boolean)
  Print Method (View)
  Print Method (View, Boolean)
  RemoveFilter Method
  SetBackground Method
  SetCategoryOverrides Method
  SetElementOverrides Method
  SetFilterOverrides Method
  SetFilterVisibility Method
  SetNonControlledTemplateParameterIds Method
  SetSketchyLines Method
  SetViewDisplayModel Method
  SetVisibility Method
  SetWorksetVisibility Method
  SetWorksharingDisplayMode Method
  ShowActiveWorkPlane Method
  SupportsWorksharingDisplayMode Method
  UnhideElements Method
  View Properties
  AnalysisDisplayStyleId Property
  AreAnalyticalModelCategoriesHidden Property
  AreAnnotationCategoriesHidden Property
  AreImportCategoriesHidden Property
  AreModelCategoriesHidden Property
  ArePointCloudsHidden Property
  AssociatedAssemblyInstanceId Property
  CanBePrinted Property
  CropBox Property
  CropBoxActive Property
  CropBoxVisible Property
  DetailLevel Property
  Discipline Property
  DisplayStyle Property
  GenLevel Property
  IsAssemblyView Property
  IsTemplate Property
  Origin Property
  Outline Property
  Parameter Property
  PartsVisibility Property
  RightDirection Property
  Scale Property
  ShadowIntensity Property
  ShowEdges Property
  ShowSilhouettes Property
  SilhouetteLineStyleId Property
  SketchPlane Property
  SunAndShadowSettings Property
  SunlightIntensity Property
  SurfaceTransparency Property
  Title Property
  UpDirection Property
  ViewDirection Property
  ViewName Property
  ViewTemplateId Property
  ViewType Property
  View3D Class
  View3D Members
  View3D Methods
  CanSaveOrientation Method
  CreateIsometric Method
  CreatePerspective Method
  GetOrientation Method
  GetRenderingSettings Method
  GetSavedOrientation Method
  GetSectionBox Method
  HasBeenLocked Method
  OrientTo Method
  Print Method
  RestoreOrientationAndLock Method
  SaveOrientation Method
  SaveOrientationAndLock Method
  SetOrientation Method
  SetRenderingSettings Method
  SetSectionBox Method
  Unlock Method
  View3D Properties
  IsLocked Property
  IsPerspective Property
  IsSectionBoxActive Property
  Parameter Property
  ViewCropRegionShapeManager Class
  ViewCropRegionShapeManager Members
  ViewCropRegionShapeManager Methods
  Dispose Method
  GetCropRegionShape Method
  IsCropRegionShapeValid Method
  RemoveCropRegionShape Method
  RemoveSplit Method
  SetCropRegionEmptyShape Method
  SetCropRegionShape Method
  ViewCropRegionShapeManager Properties
  IsValidObject Property
  ShapeSet Property
  Split Property
  Valid Property
  ViewDetailLevel Enumeration
  ViewDiscipline Enumeration
  ViewDisplayBackground Class
  ViewDisplayBackground Members
  ViewDisplayBackground Methods
  CreateGradient Method
  CreateImage Method
  CreateSky Method
  Dispose Method
  ViewDisplayBackground Properties
  BackgroundColor Property
  GroundColor Property
  HorizontalImageOffset Property
  HorizontalImageScale Property
  ImageFlags Property
  ImagePath Property
  IsValidObject Property
  SkyColor Property
  Type Property
  VerticalImageOffset Property
  VerticalImageScale Property
  ViewDisplayBackgroundImageFlags Enumeration
  ViewDisplayBackgroundType Enumeration
  ViewDisplayEdges Enumeration
  ViewDisplayModel Class
  ViewDisplayModel Members
  ViewDisplayModel Methods
  Dispose Method
  ViewDisplayModel Properties
  EnableSilhouettes Property
  IsValidObject Property
  ShowHiddenLines Property
  SilhouetteEdgesGStyleId Property
  SmoothEdges Property
  Transparency Property
  ViewDisplaySketchyLines Class
  ViewDisplaySketchyLines Members
  ViewDisplaySketchyLines Methods
  Dispose Method
  ViewDisplaySketchyLines Properties
  EnableSketchyLines Property
  Extension Property
  IsValidObject Property
  Jitter Property
  ViewDrafting Class
  ViewDrafting Members
  ViewDrafting Methods
  Create Method
  Print Method
  ViewDrafting Properties
  Parameter Property
  ViewDuplicateOption Enumeration
  ViewFamily Enumeration
  ViewFamilyType Class
  ViewFamilyType Members
  ViewFamilyType Methods
  IsValidDefaultTemplate Method
  ViewFamilyType Properties
  DefaultTemplateId Property
  Parameter Property
  PlanViewDirection Property
  ViewFamily Property
  ViewNode Class
  ViewNode Members
  ViewNode Methods
  GetCameraInfo Method
  ViewNode Properties
  LevelOfDetail Property
  ViewId Property
  ViewOrientation3D Class
  ViewOrientation3D Members
  ViewOrientation3D Constructor
  ViewOrientation3D Methods
  Dispose Method
  ViewOrientation3D Properties
  EyePosition Property
  ForwardDirection Property
  IsValidObject Property
  UpDirection Property
  ViewPlan Class
  ViewPlan Members
  ViewPlan Methods
  CheckPlanViewRangeValidity Method
  Create Method
  CreateAreaPlan Method
  GetViewRange Method
  Print Method
  SetViewRange Method
  ViewPlan Properties
  AreaScheme Property
  Parameter Property
  ViewPlanType Enumeration
  Viewport Class
  Viewport Members
  Viewport Methods
  CanAddViewToSheet Method
  Create Method
  GetBoxCenter Method
  GetBoxOutline Method
  GetLabelOutline Method
  SetBoxCenter Method
  Viewport Properties
  Parameter Property
  Rotation Property
  SheetId Property
  ViewId Property
  ViewportRotation Enumeration
  ViewSchedule Class
  ViewSchedule Members
  ViewSchedule Methods
  CanGroupHeaders Method
  CanUngroupHeaders Method
  CreateKeynoteLegend Method
  CreateKeySchedule Method
  CreateMaterialTakeoff Method
  CreateNoteBlock Method
  CreateRevisionSchedule Method
  CreateSchedule Method
  CreateSchedule Method (Document, ElementId)
  CreateSchedule Method (Document, ElementId, ElementId)
  CreateSheetList Method
  CreateViewList Method
  Export Method
  GetDefaultNameForKeynoteLegend Method
  GetDefaultNameForKeySchedule Method
  GetDefaultNameForMaterialTakeoff Method
  GetDefaultNameForNoteBlock Method
  GetDefaultNameForRevisionSchedule Method
  GetDefaultNameForSchedule Method
  GetDefaultNameForSchedule Method (Document, ElementId)
  GetDefaultNameForSchedule Method (Document, ElementId, ElementId)
  GetDefaultNameForSheetList Method
  GetDefaultNameForViewList Method
  GetDefaultParameterNameForKeySchedule Method
  GetTableData Method
  GetValidCategoriesForKeySchedule Method
  GetValidCategoriesForMaterialTakeoff Method
  GetValidCategoriesForSchedule Method
  GetValidFamiliesForNoteBlock Method
  GroupHeaders Method
  GroupHeaders Method (Int32, Int32, Int32, Int32)
  GroupHeaders Method (Int32, Int32, Int32, Int32, String)
  HasImageField Method
  IsDataOutOfDate Method
  IsValidCategoryForKeySchedule Method
  IsValidCategoryForMaterialTakeoff Method
  IsValidCategoryForSchedule Method
  IsValidFamilyForNoteBlock Method
  IsValidTextTypeId Method
  Print Method
  RefreshData Method
  RestoreImageSize Method
  UngroupHeaders Method
  ViewSchedule Properties
  BodyTextTypeId Property
  Definition Property
  EmbeddedDefinition Property
  HeaderTextTypeId Property
  ImageRowHeight Property
  IsInternalKeynoteSchedule Property
  IsTitleblockRevisionSchedule Property
  KeyScheduleParameterName Property
  Parameter Property
  TitleTextTypeId Property
  ViewScheduleExportOptions Class
  ViewScheduleExportOptions Members
  ViewScheduleExportOptions Constructor
  ViewScheduleExportOptions Constructor
  ViewScheduleExportOptions Constructor (ViewScheduleExportOptions)
  ViewScheduleExportOptions Methods
  Dispose Method
  ViewScheduleExportOptions Properties
  ColumnHeaders Property
  FieldDelimiter Property
  HeadersFootersBlanks Property
  IsValidObject Property
  TextQualifier Property
  Title Property
  ViewSection Class
  ViewSection Members
  ViewSection Methods
  CreateCallout Method
  CreateDetail Method
  CreateReferenceCallout Method
  CreateReferenceSection Method
  CreateSection Method
  IsParentViewValidForCallout Method
  IsViewFamilyTypeValidForCallout Method
  Print Method
  ViewSection Properties
  Parameter Property
  ViewSet Class
  ViewSet Members
  ViewSet Constructor
  ViewSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ViewSet Properties
  IsEmpty Property
  Size Property
  ViewSetIterator Class
  ViewSetIterator Members
  ViewSetIterator Constructor
  ViewSetIterator Methods
  MoveNext Method
  Reset Method
  ViewSetIterator Properties
  Current Property
  ViewShapeBuilder Class
  ViewShapeBuilder Members
  ViewShapeBuilder Constructor
  ViewShapeBuilder Constructor
  ViewShapeBuilder Constructor (DirectShapeTargetViewType)
  ViewShapeBuilder Methods
  AddCurve Method
  Dispose Method
  Reset Method
  SetShape Method
  SetShape Method (DirectShape)
  SetShape Method (DirectShapeType)
  ValidateCurve Method
  ValidateViewType Method
  ViewShapeBuilder Properties
  IsValidObject Property
  ViewNormal Property
  ViewType Property
  ViewSheet Class
  ViewSheet Members
  ViewSheet Methods
  ConvertToRealSheet Method
  Create Method
  CreatePlaceholder Method
  DeleteViewport Method
  GetAdditionalProjectRevisionIds Method
  GetAdditionalRevisionIds Method
  GetAllPlacedViews Method
  GetAllProjectRevisionIds Method
  GetAllRevisionIds Method
  GetAllViewports Method
  GetCurrentRevision Method
  GetRevisionCloudNumberOnSheet Method
  GetRevisionNumberOnSheet Method
  Print Method
  SetAdditionalProjectRevisionIds Method
  SetAdditionalRevisionIds Method
  ViewSheet Properties
  IsPlaceholder Property
  Parameter Property
  SheetNumber Property
  Views Property
  ViewSheetSet Class
  ViewSheetSet Members
  ViewSheetSet Methods
  ViewSheetSet Properties
  Name Property
  Parameter Property
  Views Property
  ViewSheetSets Class
  ViewSheetSets Members
  ViewSheetSets Constructor
  ViewSheetSets Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ViewSheetSets Properties
  IsEmpty Property
  Size Property
  ViewSheetSetsIterator Class
  ViewSheetSetsIterator Members
  ViewSheetSetsIterator Constructor
  ViewSheetSetsIterator Methods
  MoveNext Method
  Reset Method
  ViewSheetSetsIterator Properties
  Current Property
  ViewSheetSetting Class
  ViewSheetSetting Members
  ViewSheetSetting Methods
  Delete Method
  Rename Method
  Revert Method
  Save Method
  SaveAs Method
  ViewSheetSetting Properties
  AvailableViews Property
  CurrentViewSheetSet Property
  InSession Property
  ViewTemplateApplicationOption Enumeration
  ViewType Enumeration
  VirtualPrinterType Enumeration
  Visibility Enumeration
  Wall Class
  Wall Members
  Wall Methods
  Create Method
  Create Method (Document, IList(Curve), Boolean)
  Create Method (Document, Curve, ElementId, Boolean)
  Create Method (Document, IList(Curve), ElementId, ElementId, Boolean)
  Create Method (Document, IList(Curve), ElementId, ElementId, Boolean, XYZ)
  Create Method (Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean)
  Flip Method
  GetStackedWallMemberIds Method
  Wall Properties
  CurtainGrid Property
  Flipped Property
  IsStackedWall Property
  IsStackedWallMember Property
  Orientation Property
  Parameter Property
  StackedWallOwnerId Property
  StructuralUsage Property
  WallType Property
  Width Property
  WallFunction Enumeration
  WallKind Enumeration
  WallLocationLine Enumeration
  WallSide Enumeration
  WallSweep Class
  WallSweep Members
  WallSweep Methods
  Create Method
  GetHostIds Method
  GetWallSweepInfo Method
  WallAllowsWallSweep Method
  WallSweep Properties
  Parameter Property
  WallSweepInfo Class
  WallSweepInfo Members
  WallSweepInfo Constructor
  WallSweepInfo Constructor (Boolean, WallSweepType)
  WallSweepInfo Constructor (WallSweepType, Boolean)
  WallSweepInfo Methods
  Dispose Method
  IsEqual Method
  WallSweepInfo Properties
  CutsWall Property
  DefaultSetback Property
  Distance Property
  DistanceMeasuredFrom Property
  Id Property
  IsCutByInserts Property
  IsFixed Property
  IsProfileFlipped Property
  IsValidObject Property
  IsVertical Property
  MaterialId Property
  ProfileId Property
  WallOffset Property
  WallSide Property
  WallSweepType Property
  WallSweepType Enumeration
  WallType Class
  WallType Members
  WallType Methods
  WallType Properties
  Function Property
  Kind Property
  Parameter Property
  ThermalProperties Property
  Width Property
  WallTypeSet Class
  WallTypeSet Members
  WallTypeSet Constructor
  WallTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  WallTypeSet Properties
  IsEmpty Property
  Size Property
  WallTypeSetIterator Class
  WallTypeSetIterator Members
  WallTypeSetIterator Constructor
  WallTypeSetIterator Methods
  MoveNext Method
  Reset Method
  WallTypeSetIterator Properties
  Current Property
  WallUtils Class
  WallUtils Members
  WallUtils Methods
  AllowWallJoinAtEnd Method
  DisallowWallJoinAtEnd Method
  IsWallJoinAllowedAtEnd Method
  Workset Class
  Workset Members
  Workset Methods
  Workset Properties
  IsEditable Property
  IsOpen Property
  IsVisibleByDefault Property
  Kind Property
  WorksetConfiguration Class
  WorksetConfiguration Members
  WorksetConfiguration Constructor
  WorksetConfiguration Constructor
  WorksetConfiguration Constructor (WorksetConfiguration)
  WorksetConfiguration Constructor (WorksetConfigurationOption)
  WorksetConfiguration Methods
  Close Method
  CloseAll Method
  Dispose Method
  Open Method
  OpenLastViewed Method
  WorksetConfiguration Properties
  IsValidObject Property
  WorksetConfigurationOption Enumeration
  WorksetDefaultVisibilitySettings Class
  WorksetDefaultVisibilitySettings Members
  WorksetDefaultVisibilitySettings Methods
  GetWorksetDefaultVisibilitySettings Method
  IsWorksetVisible Method
  SetWorksetVisibility Method
  WorksetDefaultVisibilitySettings Properties
  Parameter Property
  WorksetFilter Class
  WorksetFilter Members
  WorksetFilter Methods
  Dispose Method
  WorksetFilter Properties
  IncludeStandaloneWorksetsOnly Property
  Inverted Property
  IsValidObject Property
  WorksetId Class
  WorksetId Members
  WorksetId Constructor
  WorksetId Methods
  Compare Method
  Equals Method
  GetHashCode Method
  ToString Method
  WorksetId Operators
  Equality Operator
  GreaterThan Operator
  GreaterThanOrEqual Operator
  Inequality Operator
  LessThan Operator
  LessThanOrEqual Operator
  WorksetId Properties
  IntegerValue Property
  InvalidWorksetId Property
  WorksetKind Enumeration
  WorksetKindFilter Class
  WorksetKindFilter Members
  WorksetKindFilter Constructor
  WorksetKindFilter Constructor (WorksetKind)
  WorksetKindFilter Constructor (WorksetKind, Boolean)
  WorksetKindFilter Methods
  WorksetKindFilter Properties
  WorksetKind Property
  WorksetPreview Class
  WorksetPreview Members
  WorksetPreview Methods
  Dispose Method
  WorksetPreview Properties
  Id Property
  IsDefaultWorkset Property
  IsValidObject Property
  Name Property
  Owner Property
  UniqueId Property
  WorksetTable Class
  WorksetTable Members
  WorksetTable Methods
  Dispose Method
  GetActiveWorksetId Method
  GetWorkset Method
  GetWorkset Method (Guid)
  GetWorkset Method (WorksetId)
  WorksetTable Properties
  IsValidObject Property
  WorksetVisibility Enumeration
  WorksharingDisplayGraphicSettings Class
  WorksharingDisplayGraphicSettings Members
  WorksharingDisplayGraphicSettings Constructor
  WorksharingDisplayGraphicSettings Methods
  Dispose Method
  WorksharingDisplayGraphicSettings Properties
  FillColor Property
  IsApplied Property
  IsValidObject Property
  LineColor Property
  WorksharingDisplayMode Enumeration
  WorksharingDisplaySettings Class
  WorksharingDisplaySettings Members
  WorksharingDisplaySettings Methods
  CanUserHaveOverrides Method
  GetAllUsersWithGraphicOverrides Method
  GetGraphicOverrides Method
  GetGraphicOverrides Method (String)
  GetGraphicOverrides Method (CheckoutStatus)
  GetGraphicOverrides Method (ModelUpdatesStatus)
  GetGraphicOverrides Method (WorksetId)
  GetOrCreateWorksharingDisplaySettings Method
  GetRemovedUsers Method
  RemoveUsers Method
  RestoreUsers Method
  SetGraphicOverrides Method
  SetGraphicOverrides Method (String, WorksharingDisplayGraphicSettings)
  SetGraphicOverrides Method (CheckoutStatus, WorksharingDisplayGraphicSettings)
  SetGraphicOverrides Method (ModelUpdatesStatus, WorksharingDisplayGraphicSettings)
  SetGraphicOverrides Method (WorksetId, WorksharingDisplayGraphicSettings)
  UserHasGraphicOverrides Method
  WorksharingDisplaySettings Properties
  Parameter Property
  WorksharingSaveAsOptions Class
  WorksharingSaveAsOptions Members
  WorksharingSaveAsOptions Constructor
  WorksharingSaveAsOptions Methods
  Dispose Method
  WorksharingSaveAsOptions Properties
  ClearTransmitted Property
  IsValidObject Property
  OpenWorksetsDefault Property
  SaveAsCentral Property
  WorksharingTooltipInfo Class
  WorksharingTooltipInfo Members
  WorksharingTooltipInfo Methods
  Dispose Method
  GetRequesters Method
  WorksharingTooltipInfo Properties
  Creator Property
  IsValidObject Property
  LastChangedBy Property
  Owner Property
  WorksharingUtils Class
  WorksharingUtils Members
  WorksharingUtils Methods
  CheckoutElements Method
  CheckoutElements Method (Document, ICollection(ElementId))
  CheckoutElements Method (Document, ISet(ElementId), TransactWithCentralOptions)
  CheckoutWorksets Method
  CheckoutWorksets Method (Document, ICollection(WorksetId))
  CheckoutWorksets Method (Document, ISet(WorksetId), TransactWithCentralOptions)
  CreateNewLocal Method
  Dispose Method
  GetCheckoutStatus Method
  GetCheckoutStatus Method (Document, ElementId)
  GetCheckoutStatus Method (Document, ElementId, String)
  GetModelUpdatesStatus Method
  GetUserWorksetInfo Method
  GetWorksharingTooltipInfo Method
  RelinquishOwnership Method
  WorksharingUtils Properties
  IsValidObject Property
  XYZ Class
  XYZ Members
  XYZ Constructor
  XYZ Constructor
  XYZ Constructor (Double, Double, Double)
  XYZ Methods
  Add Method
  AngleOnPlaneTo Method
  AngleTo Method
  CrossProduct Method
  DistanceTo Method
  Divide Method
  DotProduct Method
  GetLength Method
  IsAlmostEqualTo Method
  IsAlmostEqualTo Method (XYZ)
  IsAlmostEqualTo Method (XYZ, Double)
  IsUnitLength Method
  IsZeroLength Method
  Multiply Method
  Negate Method
  Normalize Method
  Subtract Method
  ToString Method
  TripleProduct Method
  XYZ Operators
  Addition Operator
  Division Operator
  Multiply Operator
  Multiply Operator (Double, XYZ)
  Multiply Operator (XYZ, Double)
  Subtraction Operator
  UnaryNegation Operator
  XYZ Properties
  BasisX Property
  BasisY Property
  BasisZ Property
  Item Property
  X Property
  Y Property
  Z Property
  Zero Property
  ZoomFitType Enumeration
  ZoomType Enumeration
  Autodesk.Revit.DB.Analysis Namespace
  AnalysisDisplayColoredSurfaceSettings Class
  AnalysisDisplayColoredSurfaceSettings Members
  AnalysisDisplayColoredSurfaceSettings Constructor
  AnalysisDisplayColoredSurfaceSettings Constructor
  AnalysisDisplayColoredSurfaceSettings Constructor (AnalysisDisplayColoredSurfaceSettings)
  AnalysisDisplayColoredSurfaceSettings Methods
  Dispose Method
  IsEqual Method
  AnalysisDisplayColoredSurfaceSettings Properties
  GridColor Property
  GridLineWeight Property
  IsValidObject Property
  ShowContourLines Property
  ShowGridLines Property
  AnalysisDisplayColorEntry Class
  AnalysisDisplayColorEntry Members
  AnalysisDisplayColorEntry Constructor
  AnalysisDisplayColorEntry Constructor
  AnalysisDisplayColorEntry Constructor (Color)
  AnalysisDisplayColorEntry Constructor (Color, Double)
  AnalysisDisplayColorEntry Methods
  Dispose Method
  HasValue Method
  IsEqual Method
  AnalysisDisplayColorEntry Properties
  Color Property
  IsValidObject Property
  Value Property
  AnalysisDisplayColorSettings Class
  AnalysisDisplayColorSettings Members
  AnalysisDisplayColorSettings Constructor
  AnalysisDisplayColorSettings Constructor
  AnalysisDisplayColorSettings Constructor (AnalysisDisplayColorSettings)
  AnalysisDisplayColorSettings Methods
  AreIntermediateColorsValid Method
  Colors Method
  Dispose Method
  GetIntermediateColors Method
  IsEqual Method
  SetIntermediateColors Method
  AnalysisDisplayColorSettings Properties
  ColorSettingsType Property
  IsValidObject Property
  MaxColor Property
  MinColor Property
  AnalysisDisplayDeformedShapeSettings Class
  AnalysisDisplayDeformedShapeSettings Members
  AnalysisDisplayDeformedShapeSettings Constructor
  AnalysisDisplayDeformedShapeSettings Constructor
  AnalysisDisplayDeformedShapeSettings Constructor (AnalysisDisplayDeformedShapeSettings)
  AnalysisDisplayDeformedShapeSettings Methods
  Dispose Method
  IsEqual Method
  AnalysisDisplayDeformedShapeSettings Properties
  GridColor Property
  GridLineWeight Property
  IsValidObject Property
  Rounding Property
  ShowContourLines Property
  ShowGridLines Property
  TextLabelType Property
  TextTypeId Property
  Transparency Property
  AnalysisDisplayDiagramSettings Class
  AnalysisDisplayDiagramSettings Members
  AnalysisDisplayDiagramSettings Constructor
  AnalysisDisplayDiagramSettings Constructor
  AnalysisDisplayDiagramSettings Constructor (AnalysisDisplayDiagramSettings)
  AnalysisDisplayDiagramSettings Methods
  Dispose Method
  IsEqual Method
  AnalysisDisplayDiagramSettings Properties
  FenceType Property
  IsValidObject Property
  OutlineColor Property
  OutlineLineWeight Property
  Rounding Property
  TextLabelType Property
  TextTypeId Property
  Transparency Property
  AnalysisDisplayLegend Class
  AnalysisDisplayLegend Members
  AnalysisDisplayLegend Methods
  AnalysisDisplayLegend Properties
  Height Property
  Parameter Property
  AnalysisDisplayLegendSettings Class
  AnalysisDisplayLegendSettings Members
  AnalysisDisplayLegendSettings Constructor
  AnalysisDisplayLegendSettings Constructor
  AnalysisDisplayLegendSettings Constructor (AnalysisDisplayLegendSettings)
  AnalysisDisplayLegendSettings Methods
  Dispose Method
  IsEqual Method
  AnalysisDisplayLegendSettings Properties
  ColorRangeHeight Property
  ColorRangeWidth Property
  HeadingTextTypeId Property
  IsValidObject Property
  NumberForScale Property
  NumberOfSteps Property
  Rounding Property
  ScaleHeight Property
  ShowDataDescription Property
  ShowDataName Property
  ShowLegend Property
  ShowUnits Property
  TextTypeId Property
  AnalysisDisplayMarkersAndTextSettings Class
  AnalysisDisplayMarkersAndTextSettings Members
  AnalysisDisplayMarkersAndTextSettings Constructor
  AnalysisDisplayMarkersAndTextSettings Constructor
  AnalysisDisplayMarkersAndTextSettings Constructor (AnalysisDisplayMarkersAndTextSettings)
  AnalysisDisplayMarkersAndTextSettings Methods
  Dispose Method
  IsEqual Method
  AnalysisDisplayMarkersAndTextSettings Properties
  IsValidObject Property
  MarkerSize Property
  MarkerType Property
  Rounding Property
  TextLabelType Property
  TextTypeId Property
  AnalysisDisplayStyle Class
  AnalysisDisplayStyle Members
  AnalysisDisplayStyle Methods
  CreateAnalysisDisplayStyle Method
  CreateAnalysisDisplayStyle Method (Document, String, AnalysisDisplayColoredSurfaceSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings)
  CreateAnalysisDisplayStyle Method (Document, String, AnalysisDisplayDeformedShapeSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings)
  CreateAnalysisDisplayStyle Method (Document, String, AnalysisDisplayDiagramSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings)
  CreateAnalysisDisplayStyle Method (Document, String, AnalysisDisplayMarkersAndTextSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings)
  CreateAnalysisDisplayStyle Method (Document, String, AnalysisDisplayVectorSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings)
  FindByName Method
  GetColoredSurfaceSettings Method
  GetColorSettings Method
  GetDeformedShapeSettings Method
  GetDiagramSettings Method
  GetElements Method
  GetLegendSettings Method
  GetMarkersAndTextSettings Method
  GetVectorSettings Method
  HasColoredSurfaceSettings Method
  HasDeformedShapeSettings Method
  HasDiagramSettings Method
  HasMarkersAndTextSettings Method
  HasVectorSettings Method
  IsNameUnique Method
  IsTextTypeIdValid Method
  SetColoredSurfaceSettings Method
  SetColorSettings Method
  SetDeformedShapeSettings Method
  SetDiagramSettings Method
  SetLegendSettings Method
  SetMarkersAndTextSettings Method
  SetName Method
  SetVectorSettings Method
  AnalysisDisplayStyle Properties
  Parameter Property
  AnalysisDisplayStyleColorSettingsType Enumeration
  AnalysisDisplayStyleDeformedShapeTextLabelType Enumeration
  AnalysisDisplayStyleDiagramFenceType Enumeration
  AnalysisDisplayStyleDiagramTextLabelType Enumeration
  AnalysisDisplayStyleMarkerTextLabelType Enumeration
  AnalysisDisplayStyleMarkerType Enumeration
  AnalysisDisplayStyleVectorArrowheadScale Enumeration
  AnalysisDisplayStyleVectorOrientation Enumeration
  AnalysisDisplayStyleVectorPosition Enumeration
  AnalysisDisplayStyleVectorTextType Enumeration
  AnalysisDisplayVectorSettings Class
  AnalysisDisplayVectorSettings Members
  AnalysisDisplayVectorSettings Constructor
  AnalysisDisplayVectorSettings Constructor
  AnalysisDisplayVectorSettings Constructor (AnalysisDisplayVectorSettings)
  AnalysisDisplayVectorSettings Methods
  Dispose Method
  IsEqual Method
  AnalysisDisplayVectorSettings Properties
  ArrowheadScale Property
  ArrowLineWeight Property
  IsValidObject Property
  Rounding Property
  TextTypeId Property
  VectorOrientation Property
  VectorPosition Property
  VectorTextType Property
  AnalysisResultSchema Class
  AnalysisResultSchema Members
  AnalysisResultSchema Constructor
  AnalysisResultSchema Constructor (AnalysisResultSchema)
  AnalysisResultSchema Constructor (String, String)
  AnalysisResultSchema Methods
  Dispose Method
  GetNumberOfUnits Method
  GetUnitsMultiplier Method
  GetUnitsName Method
  IsEqual Method
  SetUnits Method
  AnalysisResultSchema Properties
  AnalysisDisplayStyleId Property
  CurrentUnits Property
  Description Property
  IsValidObject Property
  IsVisible Property
  Name Property
  Scale Property
  BuildingEnvelopeAnalyzer Class
  BuildingEnvelopeAnalyzer Members
  BuildingEnvelopeAnalyzer Methods
  Create Method
  Dispose Method
  GetBoundingElements Method
  GetBoundingElementsForSpaceVolume Method
  GetCenterPointsForConnectedGridCellsInSpaceVolume Method
  BuildingEnvelopeAnalyzer Properties
  IsValidObject Property
  BuildingEnvelopeAnalyzerOptions Class
  BuildingEnvelopeAnalyzerOptions Members
  BuildingEnvelopeAnalyzerOptions Constructor
  BuildingEnvelopeAnalyzerOptions Methods
  Dispose Method
  BuildingEnvelopeAnalyzerOptions Properties
  AnalyzeEnclosedSpaceVolumes Property
  GridCellSize Property
  IsValidObject Property
  OptimizeGridCellSize Property
  ConceptualConstructionFloorSlabType Enumeration
  ConceptualConstructionOpeningType Enumeration
  ConceptualConstructionRoofType Enumeration
  ConceptualConstructionShadeType Enumeration
  ConceptualConstructionType Class
  ConceptualConstructionType Members
  ConceptualConstructionType Methods
  GetAllConceptualConstructionsForCategory Method
  GetFloorOrSlabConstructionType Method
  GetGBSId Method
  GetOpeningConstructionType Method
  GetRoofConstructionType Method
  GetShadeConstructionType Method
  GetWallConstructionType Method
  GetWindowOrSkylightConstructionType Method
  IsValidConceptualConstructionId Method
  IsValidConceptualConstructionIdForCategory Method
  IsValidSubcategoryForMassSurfaceDatas Method
  IsValidSurfaceSubcategoryForConstruction Method
  ConceptualConstructionType Properties
  MassSurfaceSubCategoryId Property
  MaterialId Property
  Parameter Property
  ConceptualConstructionWallType Enumeration
  ConceptualConstructionWindowSkylightType Enumeration
  ConceptualSurfaceType Class
  ConceptualSurfaceType Members
  ConceptualSurfaceType Methods
  GetAllMassSubCategoryIds Method
  GetByMassSubCategoryId Method
  GetConstructionTypeIds Method
  ConceptualSurfaceType Properties
  DefaultConstructionTypeId Property
  MassSubCategoryId Property
  Parameter Property
  ConstructionType Enumeration
  EnergyAnalysisDetailModel Class
  EnergyAnalysisDetailModel Members
  EnergyAnalysisDetailModel Methods
  Create Method
  Destroy Method
  Dispose Method
  GetAnalyticalOpenings Method
  GetAnalyticalShadingSurfaces Method
  GetAnalyticalSpaces Method
  GetAnalyticalSurfaces Method
  TransformModel Method
  EnergyAnalysisDetailModel Properties
  ExportMullions Property
  IncludeShadingSurfaces Property
  IsValidObject Property
  SimplifyCurtainSystems Property
  Tier Property
  EnergyAnalysisDetailModelOptions Class
  EnergyAnalysisDetailModelOptions Members
  EnergyAnalysisDetailModelOptions Constructor
  EnergyAnalysisDetailModelOptions Methods
  Dispose Method
  EnergyAnalysisDetailModelOptions Properties
  ExportMullions Property
  IncludeShadingSurfaces Property
  IsValidObject Property
  SimplifyCurtainSystems Property
  Tier Property
  EnergyAnalysisDetailModelTier Enumeration
  EnergyAnalysisOpening Class
  EnergyAnalysisOpening Members
  EnergyAnalysisOpening Methods
  Dispose Method
  GetAnalyticalSurface Method
  GetPolyloop Method
  EnergyAnalysisOpening Properties
  CADLinkUniqueId Property
  CADObjectUniqueId Property
  Corner Property
  Height Property
  Id Property
  IsValidObject Property
  Name Property
  OpeningType Property
  OriginatingElementDescription Property
  OriginatingElementId Property
  Type Property
  Width Property
  EnergyAnalysisOpeningType Enumeration
  EnergyAnalysisSpace Class
  EnergyAnalysisSpace Members
  EnergyAnalysisSpace Methods
  Dispose Method
  GetAnalyticalSurfaces Method
  GetBoundary Method
  GetClosedShell Method
  EnergyAnalysisSpace Properties
  AnalyticalVolume Property
  Area Property
  CADObjectUniqueId Property
  ComposedName Property
  Description Property
  InnerVolume Property
  IsValidObject Property
  Name Property
  SpatialElementId Property
  EnergyAnalysisSurface Class
  EnergyAnalysisSurface Members
  EnergyAnalysisSurface Methods
  Dispose Method
  GetAdjacentAnalyticalSpace Method
  GetAnalyticalOpenings Method
  GetAnalyticalSpace Method
  GetPolyloop Method
  EnergyAnalysisSurface Properties
  Azimuth Property
  CADLinkUniqueId Property
  CADObjectUniqueId Property
  Corner Property
  Height Property
  Id Property
  IsValidObject Property
  Name Property
  Normal Property
  OriginatingElementDescription Property
  OriginatingElementId Property
  SurfaceType Property
  Tilt Property
  Type Property
  Width Property
  EnergyAnalysisSurfaceType Enumeration
  EnergyDataSettings Class
  EnergyDataSettings Members
  EnergyDataSettings Methods
  CheckBuildingConstructionClass Method
  CheckBuildingEnvelope Method
  CheckBuildingHVACSystem Method
  CheckBuildingOperatingSchedule Method
  CheckBuildingType Method
  CheckConstructionSetElement Method
  CheckExportCategory Method
  CheckExportComplexity Method
  CheckGroundPlane Method
  CheckGroundPlane Method (ElementId)
  CheckGroundPlane Method (Document, ElementId)
  CheckProjectPhase Method
  CheckProjectReportType Method
  CheckRangeOfMassZoneCoreOffset Method
  CheckRangeOfPercentageGlazing Method
  CheckRangeOfPercentageSkylights Method
  CheckRangeOfShadeDepth Method
  CheckRangeOfSillHeight Method
  CheckRangeOfSkylightWidth Method
  CheckRangeOfSliverSpaceTolerance Method
  CheckServiceType Method
  EnableConceptualEnergyAnalyticalModel Method
  GetBuildingConstructionSetElementId Method
  GetFromDocument Method
  IsDocumentUsingEnergyDataAnalyticalModel Method
  SetCreateAnalyticalModel Method
  EnergyDataSettings Properties
  AnalyticalGridCellSize Property
  BuildingConstructionClass Property
  BuildingEnvelopeDeterminationMethod Property
  BuildingHVACSystem Property
  BuildingOperatingSchedule Property
  BuildingType Property
  CreateAnalyticalModel Property
  EnergyModel Property
  ExportCategory Property
  ExportComplexity Property
  ExportDefaults Property
  GroundPlane Property
  IncludeThermalProperties Property
  IsExportMullionsEnabled Property
  IsExportShadingSurfacesEnabled Property
  IsExportSimplifiedCurtainSystemsEnabled Property
  IsGlazingShaded Property
  MassZoneCoreOffset Property
  MassZoneDividePerimeter Property
  OutsideAirChangesRatePerHour Property
  OutsideAirPerArea Property
  OutsideAirPerPerson Property
  Parameter Property
  PercentageGlazing Property
  PercentageSkylights Property
  ProjectPhase Property
  ProjectReportType Property
  ServiceType Property
  ShadeDepth Property
  SillHeight Property
  SkylightWidth Property
  SliverSpaceTolerance Property
  UseAirChangesPerHour Property
  UseHeatingCredits Property
  UseOutsideAirPerArea Property
  UseOutsideAirPerPerson Property
  FieldDomainPoints Class
  FieldDomainPoints Members
  FieldDomainPoints Methods
  Dispose Method
  FieldDomainPoints Properties
  IsValidObject Property
  FieldDomainPointsByParameter Class
  FieldDomainPointsByParameter Members
  FieldDomainPointsByParameter Constructor
  FieldDomainPointsByParameter Methods
  FieldDomainPointsByParameter Properties
  FieldDomainPointsByUV Class
  FieldDomainPointsByUV Members
  FieldDomainPointsByUV Constructor
  FieldDomainPointsByUV Constructor (IList(UV))
  FieldDomainPointsByUV Constructor (IList(UV), ICollection(Double), ICollection(Double))
  FieldDomainPointsByUV Methods
  SetGridCoordinates Method
  FieldDomainPointsByUV Properties
  FieldDomainPointsByXYZ Class
  FieldDomainPointsByXYZ Members
  FieldDomainPointsByXYZ Constructor
  FieldDomainPointsByXYZ Methods
  FieldDomainPointsByXYZ Properties
  FieldValues Class
  FieldValues Members
  FieldValues Constructor
  FieldValues Constructor (FieldValues)
  FieldValues Constructor (IList(ValueAtPoint))
  FieldValues Constructor (IList(VectorAtPoint))
  FieldValues Constructor (IList(ValueAtPoint), XYZ)
  FieldValues Methods
  Dispose Method
  FieldValues Properties
  IsValidObject Property
  gbXMLBuildingHVACSystem Enumeration
  gbXMLBuildingOperatingSchedule Enumeration
  gbXMLBuildingType Enumeration
  gbXMLConditionType Enumeration
  gbXMLExportBuildingEnvelope Enumeration
  gbXMLExportComplexity Enumeration
  gbXMLOpeningType Enumeration
  gbXMLServiceType Enumeration
  gbXMLSpaceType Enumeration
  gbXMLSurfaceType Enumeration
  HVACLoadConstructionClass Enumeration
  HVACLoadLoadsReportType Enumeration
  MassEnergyAnalyticalModel Class
  MassEnergyAnalyticalModel Members
  MassEnergyAnalyticalModel Methods
  GetCoincidentEnergyAnalyticalModelFaceReference Method
  GetCoincidentMassZoneFaceReferences Method
  GetJoinedMassEnergyAnalyticalModelElementIds Method
  GetMassEnergyAnalyticalModelIdForMassInstance Method
  GetMassSurfaceDataIdForReference Method
  GetMassZoneIds Method
  GetReferencesToAllFaces Method
  GetReferencesToAllShadingFaces Method
  GetValidSurfaceCategoryIdsForReference Method
  MassEnergyAnalyticalModel Properties
  MassId Property
  MassZoneCoreOffset Property
  Parameter Property
  MassGBXMLExportOptions Class
  MassGBXMLExportOptions Members
  MassGBXMLExportOptions Constructor
  MassGBXMLExportOptions Constructor (IList(ElementId))
  MassGBXMLExportOptions Constructor (IList(ElementId), IList(ElementId))
  MassGBXMLExportOptions Methods
  Dispose Method
  GetMassIds Method
  GetMassZoneIds Method
  MassGBXMLExportOptions Properties
  IsValidObject Property
  MassLevelData Class
  MassLevelData Members
  MassLevelData Methods
  IsEmpty Method
  IsMassFamilyInstance Method
  IsValidConceptualConstructionTypeElement Method
  MassLevelData Properties
  ConceptualConstructionId Property
  ConceptualConstructionIsByEnergyData Property
  MaterialId Property
  MaterialType Property
  NExteriorSurfaceArea Property
  NLevelFafArea Property
  NLevelPerimeter Property
  NVolume Property
  OwningMassId Property
  Parameter Property
  StrUsage Property
  MassSurfaceData Class
  MassSurfaceData Members
  MassSurfaceData Methods
  GetFaceReferences Method
  MassSurfaceData Properties
  Area Property
  CategoryIdForConceptualSurfaceType Property
  ConceptualConstructionId Property
  IsConceptualConstructionByEnergyData Property
  IsGlazingShaded Property
  IsSlab Property
  IsUnderground Property
  MassLevelDataId Property
  MaterialId Property
  MaterialType Property
  Parameter Property
  PercentageGlazing Property
  PercentageSkylights Property
  ReferenceElementId Property
  ShadeDepth Property
  SillHeight Property
  SkylightWidth Property
  SurfaceDataSource Property
  MassSurfaceDataMaterialType Enumeration
  MassSurfaceDataSource Enumeration
  MassZone Class
  MassZone Members
  MassZone Methods
  GetCoincidentReferenceFromAdjacentZone Method
  GetEquivalentReferenceFromMassOrLevel Method
  GetMassDataElementIdForZoneFaceReference Method
  GetReferencesToEnergyAnalysisFaces Method
  IsEmpty Method
  MassZone Properties
  ConditionType Property
  CutByLowerLevel Property
  CutByUpperLevel Property
  FloorArea Property
  IsZoneOccupiable Property
  LowerLevelId Property
  MassEnergyAnalyticalModelId Property
  MaterialId Property
  MaterialType Property
  Parameter Property
  SpaceType Property
  UpperLevelId Property
  Volume Property
  MassZoneLevelCutState Enumeration
  MassZoneMaterialType Enumeration
  Polyloop Class
  Polyloop Members
  Polyloop Methods
  ComputeArea Method
  Dispose Method
  GetPoints Method
  Polyloop Properties
  Centroid Property
  Direction Property
  IsValidObject Property
  SpatialFieldManager Class
  SpatialFieldManager Members
  SpatialFieldManager Methods
  AddSpatialFieldPrimitive Method
  AddSpatialFieldPrimitive Method
  AddSpatialFieldPrimitive Method (Reference)
  AddSpatialFieldPrimitive Method (Curve, Transform)
  AddSpatialFieldPrimitive Method (Face, Transform)
  AddSpatialFieldPrimitive Method (Reference, SpatialFieldPrimitiveHideMode)
  Clear Method
  CreateSpatialFieldManager Method
  GetLegend Method
  GetMaximum Method
  GetMinimum Method
  GetRegisteredResults Method
  GetResultSchema Method
  GetSpatialFieldManager Method
  IsResultSchemaNameUnique Method
  IsTextTypeIdValid Method
  RegisterResult Method
  RemoveSpatialFieldPrimitive Method
  SetMeasurementDescriptions Method
  SetMeasurementNames Method
  SetResultSchema Method
  UpdateSpatialFieldPrimitive Method
  SpatialFieldManager Properties
  CurrentMeasurement Property
  LegendPosition Property
  LegendShowConfigurationName Property
  LegendShowDescription Property
  LegendTextTypeId Property
  NumberOfMeasurements Property
  Parameter Property
  ResultsVisibleInView Property
  UseRangeForAllMeasurements Property
  SpatialFieldPrimitiveHideMode Enumeration
  ValueAtPoint Class
  ValueAtPoint Members
  ValueAtPoint Constructor
  ValueAtPoint Constructor (IList(Double))
  ValueAtPoint Constructor (ValueAtPoint)
  ValueAtPoint Methods
  SetFlags Method
  ValueAtPoint Properties
  VectorAtPoint Class
  VectorAtPoint Members
  VectorAtPoint Constructor
  VectorAtPoint Constructor (VectorAtPoint)
  VectorAtPoint Constructor (IList(XYZ))
  VectorAtPoint Methods
  SetFlags Method
  VectorAtPoint Properties
  Autodesk.Revit.DB.Architecture Namespace
  BoundarySegment Class
  BoundarySegment Members
  BoundarySegment Methods
  BoundarySegment Properties
  Curve Property
  Document Property
  Element Property
  BoundarySegmentArray Class
  BoundarySegmentArray Members
  BoundarySegmentArray Constructor
  BoundarySegmentArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  BoundarySegmentArray Properties
  IsEmpty Property
  Item Property
  Size Property
  BoundarySegmentArrayArray Class
  BoundarySegmentArrayArray Members
  BoundarySegmentArrayArray Constructor
  BoundarySegmentArrayArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  BoundarySegmentArrayArray Properties
  IsEmpty Property
  Item Property
  Size Property
  BoundarySegmentArrayArrayIterator Class
  BoundarySegmentArrayArrayIterator Members
  BoundarySegmentArrayArrayIterator Constructor
  BoundarySegmentArrayArrayIterator Methods
  MoveNext Method
  Reset Method
  BoundarySegmentArrayArrayIterator Properties
  Current Property
  BoundarySegmentArrayIterator Class
  BoundarySegmentArrayIterator Members
  BoundarySegmentArrayIterator Constructor
  BoundarySegmentArrayIterator Methods
  MoveNext Method
  Reset Method
  BoundarySegmentArrayIterator Properties
  Current Property
  BuildingPad Class
  BuildingPad Members
  BuildingPad Methods
  Create Method
  GetBoundary Method
  SetBoundary Method
  BuildingPad Properties
  AssociatedTopographySurfaceId Property
  HostId Property
  Parameter Property
  ContinuousRail Class
  ContinuousRail Members
  ContinuousRail Methods
  GetEndExtensionPath Method
  GetPath Method
  GetStartExtensionPath Method
  GetSupports Method
  ContinuousRail Properties
  HostRailingId Property
  Length Property
  Parameter Property
  ContinuousRailType Class
  ContinuousRailType Members
  ContinuousRailType Methods
  ContinuousRailType Properties
  DefaultJoinOption Property
  EndOrTopExtensionLength Property
  EndOrTopExtensionStyle Property
  EndOrTopTermination Property
  FilletRadius Property
  HandClearance Property
  Parameter Property
  ProfileId Property
  Projection Property
  StartOrBottomExtensionLength Property
  StartOrBottomExtensionStyle Property
  StartOrBottomTermination Property
  Transition Property
  CutLineType Enumeration
  CutMarkSymbol Enumeration
  CutMarkType Class
  CutMarkType Members
  CutMarkType Methods
  CutMarkType Properties
  CutLineAngle Property
  CutLineDistance Property
  CutLineExtension Property
  CutLineType Property
  CutMarkSymbol Property
  CutMarkSymbolSize Property
  Parameter Property
  Fascia Class
  Fascia Members
  Fascia Methods
  AddSegment Method
  Fascia Properties
  FasciaType Property
  Parameter Property
  FasciaType Class
  FasciaType Members
  FasciaType Methods
  FasciaType Properties
  Parameter Property
  FasciaTypeSet Class
  FasciaTypeSet Members
  FasciaTypeSet Constructor
  FasciaTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  FasciaTypeSet Properties
  IsEmpty Property
  Size Property
  FasciaTypeSetIterator Class
  FasciaTypeSetIterator Members
  FasciaTypeSetIterator Constructor
  FasciaTypeSetIterator Methods
  MoveNext Method
  Reset Method
  FasciaTypeSetIterator Properties
  Current Property
  Gutter Class
  Gutter Members
  Gutter Methods
  AddSegment Method
  Gutter Properties
  GutterType Property
  Parameter Property
  GutterType Class
  GutterType Members
  GutterType Methods
  GutterType Properties
  Parameter Property
  GutterTypeSet Class
  GutterTypeSet Members
  GutterTypeSet Constructor
  GutterTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  GutterTypeSet Properties
  IsEmpty Property
  Size Property
  GutterTypeSetIterator Class
  GutterTypeSetIterator Members
  GutterTypeSetIterator Constructor
  GutterTypeSetIterator Methods
  MoveNext Method
  Reset Method
  GutterTypeSetIterator Properties
  Current Property
  HandRail Class
  HandRail Members
  HandRail Methods
  HandRail Properties
  Parameter Property
  HandRailPosition Enumeration
  HandRailType Class
  HandRailType Members
  HandRailType Methods
  HandRailType Properties
  Height Property
  Parameter Property
  SupportJustification Property
  SupportLayout Property
  SupportNumber Property
  SupportSpacing Property
  SupportTypeId Property
  RailAngledJoinOption Enumeration
  RailConnectionOption Enumeration
  RailExtensionStyle Enumeration
  RailIndex Enumeration
  Railing Class
  Railing Members
  Railing Methods
  Create Method
  Flip Method
  GetHandRails Method
  GetPath Method
  IsValidHostForNewRailing Method
  RemoveHost Method
  Reset Method
  Railing Properties
  CanReset Property
  Flipped Property
  HasHost Property
  HostId Property
  IsDefault Property
  Parameter Property
  TopRail Property
  RailingHeightCorrectionOption Enumeration
  RailingPathCurveJoinOption Enumeration
  RailingPlacementPosition Enumeration
  RailingSlopeOption Enumeration
  RailingType Class
  RailingType Members
  RailingType Methods
  RailingType Properties
  Parameter Property
  PrimaryHandrailHeight Property
  PrimaryHandrailLateralOffset Property
  PrimaryHandRailPosition Property
  PrimaryHandrailType Property
  SecondaryHandrailHeight Property
  SecondaryHandrailLateralOffset Property
  SecondaryHandRailPosition Property
  SecondaryHandrailType Property
  TopRailHeight Property
  TopRailType Property
  RailJoinOption Enumeration
  RailSupportJustification Enumeration
  RailSupportsLayout Enumeration
  RailTagentJoinOption Enumeration
  RailTransitionOption Enumeration
  RailTypeDefaultJoinOption Enumeration
  RiserToTreadConnectionOption Enumeration
  Room Class
  Room Members
  Room Methods
  IsPointInRoom Method
  Unplace Method
  Room Properties
  BaseOffset Property
  ClosedShell Property
  LimitOffset Property
  Parameter Property
  UnboundedHeight Property
  UpperLimit Property
  Volume Property
  RoomFilter Class
  RoomFilter Members
  RoomFilter Constructor
  RoomFilter Methods
  PassesFilter Method
  RoomFilter Properties
  RoomTag Class
  RoomTag Members
  RoomTag Methods
  RoomTag Properties
  Parameter Property
  Room Property
  RoomTagType Property
  RoomTagFilter Class
  RoomTagFilter Members
  RoomTagFilter Constructor
  RoomTagFilter Methods
  PassesFilter Method
  RoomTagFilter Properties
  RoomTagType Class
  RoomTagType Members
  RoomTagType Methods
  RoomTagType Properties
  Parameter Property
  RoomTagTypeSet Class
  RoomTagTypeSet Members
  RoomTagTypeSet Constructor
  RoomTagTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  RoomTagTypeSet Properties
  IsEmpty Property
  Size Property
  RoomTagTypeSetIterator Class
  RoomTagTypeSetIterator Members
  RoomTagTypeSetIterator Constructor
  RoomTagTypeSetIterator Methods
  MoveNext Method
  Reset Method
  RoomTagTypeSetIterator Properties
  Current Property
  SiteSubRegion Class
  SiteSubRegion Members
  SiteSubRegion Methods
  Create Method
  Create Method (Document, IList(CurveLoop))
  Create Method (Document, IList(CurveLoop), ElementId)
  Dispose Method
  GetBoundary Method
  IsValidBoundary Method
  SetBoundary Method
  SiteSubRegion Properties
  HostId Property
  IsValidObject Property
  TopographySurface Property
  Stairs Class
  Stairs Members
  Stairs Methods
  GetAssociatedRailings Method
  GetStairsLandings Method
  GetStairsRuns Method
  GetStairsSupports Method
  IsByComponent Method
  IsInEditMode Method
  Stairs Properties
  ActualRiserHeight Property
  ActualRisersNumber Property
  ActualTreadDepth Property
  ActualTreadsNumber Property
  BaseElevation Property
  DesiredRisersNumber Property
  Height Property
  NumberOfStories Property
  Parameter Property
  TopElevation Property
  StairsComponentConnection Class
  StairsComponentConnection Members
  StairsComponentConnection Methods
  Dispose Method
  StairsComponentConnection Properties
  ConnectionType Property
  ElementId Property
  IsValidObject Property
  PeerConnectionType Property
  PeerElementId Property
  StairsComponentConnectionEndType Enumeration
  StairsConstructionMethod Enumeration
  StairsEndConnectionType Enumeration
  StairsEndNotchOption Enumeration
  StairsLanding Class
  StairsLanding Members
  StairsLanding Methods
  CanCreateAutomaticLanding Method
  CreateAutomaticLanding Method
  CreateSketchedLanding Method
  GetAllSupports Method
  GetConnections Method
  GetFootprintBoundary Method
  GetStairs Method
  GetStairsPath Method
  StairsLanding Properties
  BaseElevation Property
  IsAutomaticLanding Property
  Parameter Property
  Thickness Property
  StairsLandingType Class
  StairsLandingType Members
  StairsLandingType Methods
  StairsLandingType Properties
  IsMonolithic Property
  Parameter Property
  Thickness Property
  StairsNumberSystemReferenceOption Enumeration
  StairsPath Class
  StairsPath Members
  StairsPath Methods
  Create Method
  StairsPath Properties
  DownText Property
  DownTextOffset Property
  Parameter Property
  ShowDownText Property
  ShowUpText Property
  StairsId Property
  StairsPathOffset Property
  TextOrientation Property
  UpText Property
  UpTextOffset Property
  StairsPathDirection Enumeration
  StairsPathLineShapeAtCorner Enumeration
  StairsPathType Class
  StairsPathType Members
  StairsPathType Methods
  StairsPathType Properties
  ArrowheadTypeId Property
  DistanceToCutMark Property
  DrawForEachRun Property
  EndAtRiser Property
  FullStepArrow Property
  LineShapeAtCorner Property
  Parameter Property
  ShowArrowheadToCutMark Property
  StairsPathDirection Property
  StartExtension Property
  StartFromRiser Property
  StartSymbolTypeId Property
  StairsRun Class
  StairsRun Members
  StairsRun Methods
  CreateSketchedRun Method
  CreateSpiralRun Method
  CreateStraightRun Method
  GetAllSupports Method
  GetConnections Method
  GetFootprintBoundary Method
  GetLeftSupports Method
  GetNumberSystemReference Method
  GetRightSupports Method
  GetStairs Method
  GetStairsPath Method
  StairsRun Properties
  ActualRisersNumber Property
  ActualRunWidth Property
  ActualTreadsNumber Property
  BaseElevation Property
  BeginsWithRiser Property
  EndsWithRiser Property
  ExtensionBelowRiserBase Property
  ExtensionBelowTreadBase Property
  Height Property
  LocationLineJustification Property
  Parameter Property
  StairsRunStyle Property
  TopElevation Property
  StairsRunJustification Enumeration
  StairsRunStyle Enumeration
  StairsRunType Class
  StairsRunType Members
  StairsRunType Methods
  StairsRunType Properties
  HasRisers Property
  HasTreads Property
  IsMonolithic Property
  IsSlanted Property
  MaterialId Property
  NosingLength Property
  NosingProfile Property
  Parameter Property
  RiserProfile Property
  RiserThickness Property
  RiserToTreadConnect Property
  StructuralDepth Property
  TotalDepth Property
  TreadNosingPosition Property
  TreadProfile Property
  TreadThickness Property
  UndersideSurfaceStyle Property
  StairsSupportTopsideSurfaceType Enumeration
  StairsTextOrientation Enumeration
  StairsType Class
  StairsType Members
  StairsType Methods
  StairsType Properties
  ConstructionMethod Property
  EndConnectionType Property
  HasMiddleSupports Property
  LandingType Property
  LeftLateralOffset Property
  LeftSideSupportType Property
  MaxRiserHeight Property
  MiddleSupportsNumber Property
  MiddleSupportType Property
  MinRunWidth Property
  MinTreadDepth Property
  NotchExtension Property
  NotchHorizontalGap Property
  NotchThickness Property
  NotchVerticalGap Property
  Parameter Property
  RightLateralOffset Property
  RightSideSupportType Property
  RunType Property
  StairsUndersideSurfaceStyle Enumeration
  StairsWinderStyle Enumeration
  TopographyEditScope Class
  TopographyEditScope Members
  TopographyEditScope Constructor
  TopographyEditScope Methods
  Start Method
  TopographyEditScope Properties
  IsPermitted Property
  TopographySurface Class
  TopographySurface Members
  TopographySurface Methods
  AddPoints Method
  ArePointsDistinct Method
  AsSiteSubRegion Method
  ChangePointElevation Method
  ChangePointsElevation Method
  ContainsPoint Method
  Create Method
  DeletePoints Method
  FindPoints Method
  GetBoundaryPoints Method
  GetHostedSubRegionIds Method
  GetInteriorPoints Method
  GetPoints Method
  IsBoundaryPoint Method
  IsValidRegion Method
  MovePoint Method
  MovePoints Method
  TopographySurface Properties
  AssociatedBuildingPadId Property
  IsAssociatedWithBuildingPad Property
  IsSiteSubRegion Property
  MaterialId Property
  Parameter Property
  TopRail Class
  TopRail Members
  TopRail Methods
  TopRail Properties
  Parameter Property
  TopRailType Class
  TopRailType Members
  TopRailType Methods
  TopRailType Properties
  Parameter Property
  TreadNosingPosition Enumeration
  WinderPathResult Enumeration
  Autodesk.Revit.DB.Electrical Namespace
  CableTray Class
  CableTray Members
  CableTray Methods
  Create Method
  GetShapeType Method
  IsValidCableTrayType Method
  IsValidRungSpace Method
  CableTray Properties
  CurveNormal Property
  Parameter Property
  RungSpace Property
  CableTrayConduitBase Class
  CableTrayConduitBase Members
  CableTrayConduitBase Methods
  IsValidEndPoints Method
  IsValidLevelId Method
  IsWithFitting Method
  CableTrayConduitBase Properties
  Parameter Property
  RunId Property
  CableTrayConduitRunBase Class
  CableTrayConduitRunBase Members
  CableTrayConduitRunBase Methods
  CableTrayConduitRunBase Properties
  Length Property
  Parameter Property
  CableTrayRun Class
  CableTrayRun Members
  CableTrayRun Methods
  CableTrayRun Properties
  Parameter Property
  CableTrayShape Enumeration
  CableTrayType Class
  CableTrayType Members
  CableTrayType Methods
  IsValidBendMultiplier Method
  CableTrayType Properties
  BendMultiplier Property
  IsWithFitting Property
  Parameter Property
  ShapeType Property
  CapitalizationForLoadNames Enumeration
  CircuitType Enumeration
  Conduit Class
  Conduit Members
  Conduit Methods
  Create Method
  IsValidConduitType Method
  Conduit Properties
  Parameter Property
  ConduitRun Class
  ConduitRun Members
  ConduitRun Methods
  ConduitRun Properties
  Parameter Property
  ConduitType Class
  ConduitType Members
  ConduitType Methods
  ConduitType Properties
  IsWithFitting Property
  Parameter Property
  CorrectionFactor Class
  CorrectionFactor Members
  CorrectionFactor Methods
  CorrectionFactor Properties
  Factor Property
  Temperature Property
  CorrectionFactorSet Class
  CorrectionFactorSet Members
  CorrectionFactorSet Constructor
  CorrectionFactorSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  CorrectionFactorSet Properties
  IsEmpty Property
  Size Property
  CorrectionFactorSetIterator Class
  CorrectionFactorSetIterator Members
  CorrectionFactorSetIterator Constructor
  CorrectionFactorSetIterator Methods
  MoveNext Method
  Reset Method
  CorrectionFactorSetIterator Properties
  Current Property
  DistributionSysType Class
  DistributionSysType Members
  DistributionSysType Methods
  DistributionSysType Properties
  ElectricalPhase Property
  ElectricalPhaseConfiguration Property
  IsInUse Property
  NumWires Property
  Parameter Property
  VoltageLineToGround Property
  VoltageLineToLine Property
  DistributionSysTypeSet Class
  DistributionSysTypeSet Members
  DistributionSysTypeSet Constructor
  DistributionSysTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  DistributionSysTypeSet Properties
  IsEmpty Property
  Size Property
  DistributionSysTypeSetIterator Class
  DistributionSysTypeSetIterator Members
  DistributionSysTypeSetIterator Constructor
  DistributionSysTypeSetIterator Methods
  MoveNext Method
  Reset Method
  DistributionSysTypeSetIterator Properties
  Current Property
  ElectricalDemandFactorDefinition Class
  ElectricalDemandFactorDefinition Members
  ElectricalDemandFactorDefinition Constructor
  ElectricalDemandFactorDefinition Methods
  AddValue Method
  ClearValues Method
  Create Method
  GetApplicableDemandFactor Method
  GetValues Method
  GetValuesCount Method
  RemoveValue Method
  SetValues Method
  ElectricalDemandFactorDefinition Properties
  AdditionalLoad Property
  IncludeAdditionalLoad Property
  Parameter Property
  RuleType Property
  ElectricalDemandFactorRule Enumeration
  ElectricalDemandFactorValue Class
  ElectricalDemandFactorValue Members
  ElectricalDemandFactorValue Constructor
  ElectricalDemandFactorValue Constructor
  ElectricalDemandFactorValue Constructor (Double, Double, Double)
  ElectricalDemandFactorValue Methods
  Dispose Method
  SetMaxRangeToUnlimited Method
  ElectricalDemandFactorValue Properties
  Factor Property
  IsValidObject Property
  MaxRange Property
  MinRange Property
  ElectricalEquipment Class
  ElectricalEquipment Members
  ElectricalEquipment Methods
  ElectricalEquipment Properties
  DistributionSystem Property
  ElectricalLoadClassification Class
  ElectricalLoadClassification Members
  ElectricalLoadClassification Methods
  Create Method
  ElectricalLoadClassification Properties
  ActualElectricalLoadLabel Property
  DemandFactorId Property
  LoadSummaryDemandFactorLabel Property
  Motor Property
  PanelConnectedCurrentLabel Property
  PanelConnectedLabel Property
  PanelEstimatedCurrentLabel Property
  PanelEstimatedLabel Property
  Parameter Property
  SpaceLoadClass Property
  ElectricalLoadClassificationData Enumeration
  ElectricalLoadClassificationSpace Enumeration
  ElectricalPhase Enumeration
  ElectricalPhaseConfiguration Enumeration
  ElectricalSetting Class
  ElectricalSetting Members
  ElectricalSetting Methods
  AddDistributionSysType Method
  AddVoltageType Method
  AddWireMaterialType Method
  AddWireType Method
  GetElectricalSettings Method
  GetSpecificFittingAngles Method
  GetSpecificFittingAngleStatus Method
  IsValidSpecificFittingAngle Method
  RemoveDistributionSysType Method
  RemoveVoltageType Method
  RemoveWireMaterialType Method
  RemoveWireType Method
  SetSpecificFittingAngleStatus Method
  ElectricalSetting Properties
  DistributionSysTypes Property
  Parameter Property
  VoltageTypes Property
  WireConduitTypes Property
  WireMaterialTypes Property
  WireTypes Property
  ElectricalSystem Class
  ElectricalSystem Members
  ElectricalSystem Methods
  AddToCircuit Method
  DisconnectPanel Method
  NewWires Method
  Remove Method
  RemoveFromCircuit Method
  SelectPanel Method
  ElectricalSystem Properties
  ApparentCurrent Property
  ApparentCurrentPhaseA Property
  ApparentCurrentPhaseB Property
  ApparentCurrentPhaseC Property
  ApparentLoad Property
  ApparentLoadPhaseA Property
  ApparentLoadPhaseB Property
  ApparentLoadPhaseC Property
  BalancedLoad Property
  CircuitNumber Property
  CircuitType Property
  GroundConductorsNumber Property
  HotConductorsNumber Property
  Length Property
  LoadClassifications Property
  LoadName Property
  Name Property
  NeutralConductorsNumber Property
  PanelName Property
  Parameter Property
  PolesNumber Property
  PowerFactor Property
  PowerFactorState Property
  Rating Property
  RunsNumber Property
  SystemType Property
  TrueCurrent Property
  TrueCurrentPhaseA Property
  TrueCurrentPhaseB Property
  TrueCurrentPhaseC Property
  TrueLoad Property
  TrueLoadPhaseA Property
  TrueLoadPhaseB Property
  TrueLoadPhaseC Property
  Voltage Property
  VoltageDrop Property
  WireSizeString Property
  WireType Property
  ElectricalSystemSet Class
  ElectricalSystemSet Members
  ElectricalSystemSet Constructor
  ElectricalSystemSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ElectricalSystemSet Properties
  IsEmpty Property
  Size Property
  ElectricalSystemSetIterator Class
  ElectricalSystemSetIterator Members
  ElectricalSystemSetIterator Constructor
  ElectricalSystemSetIterator Methods
  MoveNext Method
  Reset Method
  ElectricalSystemSetIterator Properties
  Current Property
  ElectricalSystemType Enumeration
  GroundConductorSize Class
  GroundConductorSize Members
  GroundConductorSize Methods
  GroundConductorSize Properties
  Ampacity Property
  ConductorSize Property
  MaterialBelongTo Property
  GroundConductorSizeSet Class
  GroundConductorSizeSet Members
  GroundConductorSizeSet Constructor
  GroundConductorSizeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  GroundConductorSizeSet Properties
  IsEmpty Property
  Size Property
  GroundConductorSizeSetIterator Class
  GroundConductorSizeSetIterator Members
  GroundConductorSizeSetIterator Constructor
  GroundConductorSizeSetIterator Methods
  MoveNext Method
  Reset Method
  GroundConductorSizeSetIterator Properties
  Current Property
  InsulationType Class
  InsulationType Members
  InsulationType Methods
  InsulationType Properties
  IsInUse Property
  Name Property
  Parameter Property
  InsulationTypeSet Class
  InsulationTypeSet Members
  InsulationTypeSet Constructor
  InsulationTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  InsulationTypeSet Properties
  IsEmpty Property
  Size Property
  InsulationTypeSetIterator Class
  InsulationTypeSetIterator Members
  InsulationTypeSetIterator Constructor
  InsulationTypeSetIterator Methods
  MoveNext Method
  Reset Method
  InsulationTypeSetIterator Properties
  Current Property
  LightingDevice Class
  LightingDevice Members
  LightingDevice Methods
  LightingDevice Properties
  LightingFixture Class
  LightingFixture Members
  LightingFixture Methods
  LightingFixture Properties
  LoadClassification Enumeration
  LoadClassificationType Enumeration
  NeutralMode Enumeration
  PanelConfiguration Enumeration
  PanelScheduleData Class
  PanelScheduleData Members
  PanelScheduleData Methods
  AddLoadClassification Method
  GetLoadClassifications Method
  GetNumberOfCircuitRows Method
  GetSectionData Method
  IsSymmetric Method
  RemoveLoadClassification Method
  SetBorderAroundSchedule Method
  SetBorderAroundSections Method
  SetLoadClassifications Method
  UpdateCircuitTableForInstance Method
  UpdateCircuitTableForTemplate Method
  UpdateIsSectionHidden Method
  UpdateLoadSummary Method
  UpdateVerticalHeadersInSection Method
  PanelScheduleData Properties
  BodyShowsVerticalHeaders Property
  BorderAroundSchedule Property
  BorderAroundSections Property
  IsFooterSectionHidden Property
  IsHeaderSectionHidden Property
  IsPanelSinglePhase Property
  IsSummarySectionHidden Property
  IsThirdPhaseHidden Property
  NumberOfSlots Property
  PanelConfiguration Property
  PhaseLoadType Property
  PhasesAsCurrents Property
  ScheduleType Property
  ShowCircuitNumberOnOneRowForMultiphaseCircuits Property
  ShowMultipleRowsForMultiphaseCircuits Property
  ShowSlotFromDeviceInsteadOfTemplate Property
  SummaryShowsGroups Property
  SummaryShowsOnlyConnectedLoads Property
  SummaryShowsVerticalHeaders Property
  PanelSchedulePhaseLoadType Enumeration
  PanelScheduleSheetInstance Class
  PanelScheduleSheetInstance Members
  PanelScheduleSheetInstance Methods
  Create Method
  GetSchedule Method
  SplitSegment Method
  PanelScheduleSheetInstance Properties
  Origin Property
  Parameter Property
  ScheduleId Property
  PanelScheduleTemplate Class
  PanelScheduleTemplate Members
  PanelScheduleTemplate Methods
  CopyFrom Method
  Create Method
  GetPanelScheduleType Method
  GetSectionData Method
  GetTableData Method
  HasSameType Method
  IsValidPanelConfiguration Method
  IsValidType Method
  IsValidType Method (PanelScheduleType)
  SetTableData Method
  PanelScheduleTemplate Properties
  IsBranchPanelSchedule Property
  IsDataPanelSchedule Property
  IsDefault Property
  IsSwitchboardSchedule Property
  Parameter Property
  PanelScheduleType Enumeration
  PanelScheduleView Class
  PanelScheduleView Members
  PanelScheduleView Methods
  CreateInstanceView Method
  CreateInstanceView Method (Document, ElementId)
  CreateInstanceView Method (Document, ElementId, ElementId)
  GenerateInstanceFromTemplate Method
  GetApparentPhaseValue Method
  GetCircuitByCell Method
  GetCircuitIdByCell Method
  GetCombinedParamValue Method
  GetLoadClassificationConnectedCurrent Method
  GetLoadClassificationConnectedLoad Method
  GetLoadClassificationDemandCurrent Method
  GetLoadClassificationDemandFactor Method
  GetLoadClassificationDemandLoad Method
  GetLoadClassificationId Method
  GetLoadClassificationName Method
  GetLoadClassificationParamValue Method
  GetPanel Method
  GetParamValue Method
  GetSectionData Method
  GetSlotNumberByCell Method
  GetSpareCurrentValue Method
  GetSpareLoadValue Method
  GetTableData Method
  GetTemplate Method
  IsCellInPhaseLoads Method
  IsColumnInLoadSummary Method
  IsPanelScheduleTemplate Method
  IsRowInCircuitTable Method
  IsSlotGrouped Method
  IsSlotLocked Method
  IsSpace Method
  IsSpare Method
  Print Method
  SetParamValue Method
  SetSpareCurrentValue Method
  SetSpareLoadValue Method
  PanelScheduleView Properties
  Parameter Property
  PowerFactorStateType Enumeration
  TemperatureRatingType Class
  TemperatureRatingType Members
  TemperatureRatingType Methods
  AddCorrectionFactor Method
  AddInsulationType Method
  AddWireSize Method
  RemoveCorrectionFactor Method
  RemoveInsulationType Method
  RemoveWireSize Method
  TemperatureRatingType Properties
  CorrectionFactors Property
  InsulationTypes Property
  IsInUse Property
  MaterialType Property
  Name Property
  Parameter Property
  WireSizes Property
  TemperatureRatingTypeSet Class
  TemperatureRatingTypeSet Members
  TemperatureRatingTypeSet Constructor
  TemperatureRatingTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  TemperatureRatingTypeSet Properties
  IsEmpty Property
  Size Property
  TemperatureRatingTypeSetIterator Class
  TemperatureRatingTypeSetIterator Members
  TemperatureRatingTypeSetIterator Constructor
  TemperatureRatingTypeSetIterator Methods
  MoveNext Method
  Reset Method
  TemperatureRatingTypeSetIterator Properties
  Current Property
  VoltageType Class
  VoltageType Members
  VoltageType Methods
  SetVoltageValue Method
  VoltageType Properties
  ActualValue Property
  IsInUse Property
  MaxValue Property
  MinValue Property
  Parameter Property
  VoltageTypeSet Class
  VoltageTypeSet Members
  VoltageTypeSet Constructor
  VoltageTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  VoltageTypeSet Properties
  IsEmpty Property
  Size Property
  VoltageTypeSetIterator Class
  VoltageTypeSetIterator Members
  VoltageTypeSetIterator Constructor
  VoltageTypeSetIterator Methods
  MoveNext Method
  Reset Method
  VoltageTypeSetIterator Properties
  Current Property
  Wire Class
  Wire Members
  Wire Methods
  AppendVertex Method
  AreVertexPointsValid Method
  ConnectTo Method
  Create Method
  GetVertex Method
  InsertVertex Method
  IsVertexPointValid Method
  RemoveVertex Method
  SetVertex Method
  Wire Properties
  GroundConductorNum Property
  HotConductorNum Property
  NeutralConductorNum Property
  NumberOfVertices Property
  Parameter Property
  WiringType Property
  WireConduitType Class
  WireConduitType Members
  WireConduitType Methods
  WireConduitType Properties
  Name Property
  WireConduitTypeSet Class
  WireConduitTypeSet Members
  WireConduitTypeSet Constructor
  WireConduitTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  WireConduitTypeSet Properties
  IsEmpty Property
  Size Property
  WireConduitTypeSetIterator Class
  WireConduitTypeSetIterator Members
  WireConduitTypeSetIterator Constructor
  WireConduitTypeSetIterator Methods
  MoveNext Method
  Reset Method
  WireConduitTypeSetIterator Properties
  Current Property
  WireMaterialType Class
  WireMaterialType Members
  WireMaterialType Methods
  AddGroundConductorSize Method
  AddTemperatureRatingType Method
  RemoveGroundConductorSize Method
  RemoveTemperatureRatingType Method
  WireMaterialType Properties
  GroundConductorSizes Property
  IsInUse Property
  Name Property
  Parameter Property
  TemperatureRatings Property
  WireMaterialTypeSet Class
  WireMaterialTypeSet Members
  WireMaterialTypeSet Constructor
  WireMaterialTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  WireMaterialTypeSet Properties
  IsEmpty Property
  Size Property
  WireMaterialTypeSetIterator Class
  WireMaterialTypeSetIterator Members
  WireMaterialTypeSetIterator Constructor
  WireMaterialTypeSetIterator Methods
  MoveNext Method
  Reset Method
  WireMaterialTypeSetIterator Properties
  Current Property
  WireSet Class
  WireSet Members
  WireSet Constructor
  WireSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  WireSet Properties
  IsEmpty Property
  Size Property
  WireSetIterator Class
  WireSetIterator Members
  WireSetIterator Constructor
  WireSetIterator Methods
  MoveNext Method
  Reset Method
  WireSetIterator Properties
  Current Property
  WireSize Class
  WireSize Members
  WireSize Methods
  WireSize Properties
  Ampacity Property
  Diameter Property
  InUse Property
  Size Property
  WireSizeSet Class
  WireSizeSet Members
  WireSizeSet Constructor
  WireSizeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  WireSizeSet Properties
  IsEmpty Property
  Size Property
  WireSizeSetIterator Class
  WireSizeSetIterator Members
  WireSizeSetIterator Constructor
  WireSizeSetIterator Methods
  MoveNext Method
  Reset Method
  WireSizeSetIterator Properties
  Current Property
  WireType Class
  WireType Members
  WireType Methods
  WireType Properties
  Conduit Property
  Insulation Property
  IsInUse Property
  MaxSize Property
  NeutralMultiplier Property
  NeutralRequired Property
  NeutralSize Property
  Parameter Property
  TemperatureRating Property
  WireMaterial Property
  WireTypeSet Class
  WireTypeSet Members
  WireTypeSet Constructor
  WireTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  WireTypeSet Properties
  IsEmpty Property
  Size Property
  WireTypeSetIterator Class
  WireTypeSetIterator Members
  WireTypeSetIterator Constructor
  WireTypeSetIterator Methods
  MoveNext Method
  Reset Method
  WireTypeSetIterator Properties
  Current Property
  WiringType Enumeration
  Autodesk.Revit.DB.Events Namespace
  ApplicationInitializedEventArgs Class
  ApplicationInitializedEventArgs Members
  ApplicationInitializedEventArgs Methods
  ApplicationInitializedEventArgs Properties
  DocumentChangedEventArgs Class
  DocumentChangedEventArgs Members
  DocumentChangedEventArgs Methods
  GetAddedElementIds Method
  GetAddedElementIds Method
  GetAddedElementIds Method (ElementFilter)
  GetDeletedElementIds Method
  GetDocument Method
  GetModifiedElementIds Method
  GetModifiedElementIds Method
  GetModifiedElementIds Method (ElementFilter)
  GetTransactionNames Method
  DocumentChangedEventArgs Properties
  Operation Property
  DocumentClosedEventArgs Class
  DocumentClosedEventArgs Members
  DocumentClosedEventArgs Methods
  DocumentClosedEventArgs Properties
  DocumentId Property
  DocumentClosingEventArgs Class
  DocumentClosingEventArgs Members
  DocumentClosingEventArgs Methods
  DocumentClosingEventArgs Properties
  DocumentId Property
  DocumentCreatedEventArgs Class
  DocumentCreatedEventArgs Members
  DocumentCreatedEventArgs Methods
  DocumentCreatedEventArgs Properties
  DocumentCreatingEventArgs Class
  DocumentCreatingEventArgs Members
  DocumentCreatingEventArgs Methods
  DocumentCreatingEventArgs Properties
  DocumentType Property
  Template Property
  DocumentOpenedEventArgs Class
  DocumentOpenedEventArgs Members
  DocumentOpenedEventArgs Methods
  DocumentOpenedEventArgs Properties
  DocumentOpeningEventArgs Class
  DocumentOpeningEventArgs Members
  DocumentOpeningEventArgs Methods
  DocumentOpeningEventArgs Properties
  DocumentType Property
  PathName Property
  DocumentPrintedEventArgs Class
  DocumentPrintedEventArgs Members
  DocumentPrintedEventArgs Methods
  GetFailedViewElementIds Method
  GetPrintedViewElementIds Method
  DocumentPrintedEventArgs Properties
  DocumentPrintingEventArgs Class
  DocumentPrintingEventArgs Members
  DocumentPrintingEventArgs Methods
  GetViewElementIds Method
  DocumentPrintingEventArgs Properties
  Settings Property
  DocumentSavedAsEventArgs Class
  DocumentSavedAsEventArgs Members
  DocumentSavedAsEventArgs Methods
  DocumentSavedAsEventArgs Properties
  IsSavingAsMasterFile Property
  OriginalPath Property
  DocumentSavedEventArgs Class
  DocumentSavedEventArgs Members
  DocumentSavedEventArgs Methods
  DocumentSavedEventArgs Properties
  DocumentSavingAsEventArgs Class
  DocumentSavingAsEventArgs Members
  DocumentSavingAsEventArgs Methods
  DocumentSavingAsEventArgs Properties
  IsSavingAsMasterFile Property
  PathName Property
  DocumentSavingEventArgs Class
  DocumentSavingEventArgs Members
  DocumentSavingEventArgs Methods
  DocumentSavingEventArgs Properties
  DocumentSynchronizedWithCentralEventArgs Class
  DocumentSynchronizedWithCentralEventArgs Members
  DocumentSynchronizedWithCentralEventArgs Methods
  DocumentSynchronizedWithCentralEventArgs Properties
  DocumentSynchronizingWithCentralEventArgs Class
  DocumentSynchronizingWithCentralEventArgs Members
  DocumentSynchronizingWithCentralEventArgs Methods
  DocumentSynchronizingWithCentralEventArgs Properties
  Comments Property
  Location Property
  Options Property
  DocumentWorksharingEnabledEventArgs Class
  DocumentWorksharingEnabledEventArgs Members
  DocumentWorksharingEnabledEventArgs Methods
  GetDocument Method
  DocumentWorksharingEnabledEventArgs Properties
  ElementTypeDuplicatedEventArgs Class
  ElementTypeDuplicatedEventArgs Members
  ElementTypeDuplicatedEventArgs Methods
  ElementTypeDuplicatedEventArgs Properties
  NewElementTypeId Property
  NewName Property
  OriginalElementTypeId Property
  ElementTypeDuplicatingEventArgs Class
  ElementTypeDuplicatingEventArgs Members
  ElementTypeDuplicatingEventArgs Methods
  ElementTypeDuplicatingEventArgs Properties
  ElementTypeId Property
  EventStatus Enumeration
  FailuresProcessingEventArgs Class
  FailuresProcessingEventArgs Members
  FailuresProcessingEventArgs Methods
  GetFailuresAccessor Method
  GetProcessingResult Method
  SetProcessingResult Method
  FailuresProcessingEventArgs Properties
  FamilyLoadedIntoDocumentEventArgs Class
  FamilyLoadedIntoDocumentEventArgs Members
  FamilyLoadedIntoDocumentEventArgs Methods
  FamilyLoadedIntoDocumentEventArgs Properties
  FamilyName Property
  FamilyPath Property
  NewFamilyId Property
  OriginalFamilyId Property
  FamilyLoadingIntoDocumentEventArgs Class
  FamilyLoadingIntoDocumentEventArgs Members
  FamilyLoadingIntoDocumentEventArgs Methods
  FamilyLoadingIntoDocumentEventArgs Properties
  FamilyName Property
  FamilyPath Property
  FileExportedEventArgs Class
  FileExportedEventArgs Members
  FileExportedEventArgs Methods
  FileExportedEventArgs Properties
  Format Property
  Path Property
  FileExportingEventArgs Class
  FileExportingEventArgs Members
  FileExportingEventArgs Methods
  FileExportingEventArgs Properties
  Format Property
  Path Property
  FileImportedEventArgs Class
  FileImportedEventArgs Members
  FileImportedEventArgs Methods
  FileImportedEventArgs Properties
  Format Property
  ImportedInstanceId Property
  Path Property
  FileImportingEventArgs Class
  FileImportingEventArgs Members
  FileImportingEventArgs Methods
  FileImportingEventArgs Properties
  Format Property
  Path Property
  IncompatibleOperation Enumeration
  IncompatibleOperationChoice Enumeration
  PostDocEventArgs Class
  PostDocEventArgs Members
  PostDocEventArgs Methods
  PostDocEventArgs Properties
  Document Property
  PostEventArgs Class
  PostEventArgs Members
  PostEventArgs Methods
  PostEventArgs Properties
  Status Property
  PreDocEventArgs Class
  PreDocEventArgs Members
  PreDocEventArgs Methods
  PreDocEventArgs Properties
  Document Property
  PreEventArgs Class
  PreEventArgs Members
  PreEventArgs Methods
  PreEventArgs Properties
  ProgressChangedEventArgs Class
  ProgressChangedEventArgs Members
  ProgressChangedEventArgs Methods
  Cancel Method
  ProgressChangedEventArgs Properties
  Caption Property
  LowerRange Property
  Position Property
  Stage Property
  UpperRange Property
  ProgressStage Enumeration
  RevitAPIEventArgs Class
  RevitAPIEventArgs Members
  RevitAPIEventArgs Methods
  Dispose Method
  IsCancelled Method
  RevitAPIEventArgs Properties
  Cancellable Property
  IsValidObject Property
  RevitAPIEventStatus Enumeration
  RevitAPIPostDocEventArgs Class
  RevitAPIPostDocEventArgs Members
  RevitAPIPostDocEventArgs Methods
  RevitAPIPostDocEventArgs Properties
  Document Property
  RevitAPIPostEventArgs Class
  RevitAPIPostEventArgs Members
  RevitAPIPostEventArgs Methods
  RevitAPIPostEventArgs Properties
  Status Property
  RevitAPIPreDocEventArgs Class
  RevitAPIPreDocEventArgs Members
  RevitAPIPreDocEventArgs Methods
  RevitAPIPreDocEventArgs Properties
  Document Property
  RevitAPIPreEventArgs Class
  RevitAPIPreEventArgs Members
  RevitAPIPreEventArgs Methods
  Cancel Method
  RevitAPIPreEventArgs Properties
  RevitAPISingleEventArgs Class
  RevitAPISingleEventArgs Members
  RevitAPISingleEventArgs Methods
  RevitAPISingleEventArgs Properties
  RevitEventArgs Class
  RevitEventArgs Members
  RevitEventArgs Methods
  RevitEventArgs Properties
  Cancel Property
  Cancellable Property
  UndoOperation Enumeration
  ViewPrintedEventArgs Class
  ViewPrintedEventArgs Members
  ViewPrintedEventArgs Methods
  ViewPrintedEventArgs Properties
  Index Property
  TotalViews Property
  View Property
  ViewPrintingEventArgs Class
  ViewPrintingEventArgs Members
  ViewPrintingEventArgs Methods
  ViewPrintingEventArgs Properties
  Index Property
  Settings Property
  TotalViews Property
  View Property
  Autodesk.Revit.DB.ExtensibleStorage Namespace
  AccessLevel Enumeration
  ContainerType Enumeration
  DataStorage Class
  DataStorage Members
  DataStorage Methods
  Create Method
  DataStorage Properties
  Parameter Property
  Entity Class
  Entity Members
  Entity Constructor
  Entity Constructor
  Entity Constructor (Guid)
  Entity Constructor (Entity)
  Entity Constructor (Schema)
  Entity Methods
  Clear Method
  Clear Method (String)
  Clear Method (Field)
  Dispose Method
  Get Method
  Get(FieldType) Method (String)
  Get(FieldType) Method (Field)
  Get(FieldType) Method (String, DisplayUnitType)
  Get(FieldType) Method (Field, DisplayUnitType)
  IsValid Method
  ReadAccessGranted Method
  RecognizedField Method
  Set Method
  Set(FieldType) Method (String, FieldType)
  Set(FieldType) Method (Field, FieldType)
  Set(FieldType) Method (String, FieldType, DisplayUnitType)
  Set(FieldType) Method (Field, FieldType, DisplayUnitType)
  WriteAccessGranted Method
  Entity Properties
  IsValidObject Property
  Schema Property
  SchemaGUID Property
  ExtensibleStorageFilter Class
  ExtensibleStorageFilter Members
  ExtensibleStorageFilter Constructor
  ExtensibleStorageFilter Methods
  PassesFilter Method
  ExtensibleStorageFilter Properties
  SchemaGuid Property
  Field Class
  Field Members
  Field Methods
  CompatibleDisplayUnitType Method
  Dispose Method
  SubEntityReadAccessGranted Method
  SubEntityWriteAccessGranted Method
  Field Properties
  ContainerType Property
  Documentation Property
  FieldName Property
  IsValidObject Property
  KeyType Property
  Schema Property
  SubSchema Property
  SubSchemaGUID Property
  UnitType Property
  ValueType Property
  FieldBuilder Class
  FieldBuilder Members
  FieldBuilder Constructor
  FieldBuilder Constructor (FieldBuilder)
  FieldBuilder Constructor (Field, SchemaBuilder)
  FieldBuilder Methods
  Dispose Method
  NeedsSubSchemaGUID Method
  NeedsUnits Method
  Ready Method
  SetDocumentation Method
  SetSubSchemaGUID Method
  SetUnitType Method
  FieldBuilder Properties
  IsValidObject Property
  Schema Class
  Schema Members
  Schema Methods
  Dispose Method
  EraseSchemaAndAllEntities Method
  GetField Method
  ListFields Method
  ListSchemas Method
  Lookup Method
  ReadAccessGranted Method
  WriteAccessGranted Method
  Schema Properties
  ApplicationGUID Property
  Documentation Property
  GUID Property
  IsValidObject Property
  ReadAccessLevel Property
  SchemaName Property
  VendorId Property
  WriteAccessLevel Property
  SchemaBuilder Class
  SchemaBuilder Members
  SchemaBuilder Constructor
  SchemaBuilder Methods
  AcceptableName Method
  AddArrayField Method
  AddMapField Method
  AddSimpleField Method
  Dispose Method
  Finish Method
  GUIDIsValid Method
  Ready Method
  SetApplicationGUID Method
  SetDocumentation Method
  SetReadAccessLevel Method
  SetSchemaName Method
  SetVendorId Method
  SetWriteAccessLevel Method
  VendorIdIsValid Method
  SchemaBuilder Properties
  IsValidObject Property
  Autodesk.Revit.DB.ExternalService Namespace
  DisparityResponse Enumeration
  ExecutionPolicy Enumeration
  ExternalService Class
  ExternalService Members
  ExternalService Methods
  AddServer Method
  Dispose Method
  GetDefaultServerId Method
  GetOptions Method
  GetPublicAccessKey Method
  GetRegisteredServerIds Method
  GetServer Method
  IsRegisteredServerId Method
  RemoveServer Method
  ExternalService Properties
  Description Property
  IsSerializable Property
  IsValidObject Property
  Name Property
  NumberOfServers Property
  ServiceId Property
  VendorId Property
  ExternalServiceId Class
  ExternalServiceId Members
  ExternalServiceId Constructor
  ExternalServiceId Methods
  ExternalServiceId Operators
  Equality Operator
  Inequality Operator
  ExternalServiceId Properties
  ExternalServiceOptions Class
  ExternalServiceOptions Members
  ExternalServiceOptions Constructor
  ExternalServiceOptions Methods
  Dispose Method
  ExternalServiceOptions Properties
  IsPublic Property
  IsRecordable Property
  IsSelfsynchronizing Property
  IsValidObject Property
  ExternalServiceRegistry Class
  ExternalServiceRegistry Members
  ExternalServiceRegistry Methods
  ExecuteService Method
  ExecuteService Method (Guid, IExternalData)
  ExecuteService Method (Guid, Document, IExternalData)
  ExecuteService Method (Guid, Guid, IExternalData)
  GetService Method
  GetServices Method
  RegisterService Method
  RegisterService Method (ISingleServerService, ExternalServiceOptions)
  RegisterService Method (IMultiServerService, ExternalServiceOptions, ExecutionPolicy)
  RegisterService Method (ISingleServerService, Guid, ExternalServiceOptions)
  ExternalServiceResult Enumeration
  ExternalServices Class
  ExternalServices.BuiltInExternalServices Class
  ExternalServices.BuiltInExternalServices Members
  ExternalServices.BuiltInExternalServices Properties
  CodeCheckingParameterService Property
  DuctFittingAndAccessoryPressureDropService Property
  DuctFittingAndAccessoryPressureDropUIService Property
  DuctPressureDropService Property
  ExternalResourceService Property
  ExternalResourceUIService Property
  IFCExporterService Property
  IFCImporterService Property
  NavisworksExporterService Property
  PipeFittingAndAccessoryPressureDropService Property
  PipeFittingAndAccessoryPressureDropUIService Property
  PipePlumbingFixtureFlowService Property
  PipePressureDropService Property
  SnappingService Property
  StructuralSectionsService Property
  IExternalData Interface
  IExternalServer Interface
  IExternalServer Members
  IExternalServer Methods
  GetDescription Method
  GetName Method
  GetServerId Method
  GetServiceId Method
  GetVendorId Method
  IExternalService Interface
  IExternalService Members
  IExternalService Methods
  Execute Method
  GetDescription Method
  GetName Method
  GetServiceId Method
  GetVendorId Method
  IsValidServer Method
  OnServersChanged Method
  OnServersDisparity Method
  IMultiServerService Interface
  IMultiServerService Members
  IMultiServerService Methods
  CanExecute Method
  ISingleServerService Interface
  ISingleServerService Members
  ISingleServerService Methods
  MultiServerService Class
  MultiServerService Members
  MultiServerService Methods
  GetActiveServerIds Method
  GetActiveServerIds Method
  GetActiveServerIds Method (Document)
  SetActiveServers Method
  SetActiveServers Method (IList(Guid))
  SetActiveServers Method (IList(Guid), Document)
  MultiServerService Properties
  ExecutionPolicy Property
  ServerChangeCause Enumeration
  SingleServerService Class
  SingleServerService Members
  SingleServerService Methods
  GetActiveServerId Method
  GetActiveServerId Method
  GetActiveServerId Method (Document)
  SetActiveServer Method
  SetActiveServer Method (Guid)
  SetActiveServer Method (Guid, Document)
  UnsetActiveServer Method
  SingleServerService Properties
  Autodesk.Revit.DB.IFC Namespace
  ExporterIFC Class
  ExporterIFC Members
  ExporterIFC Methods
  AddBuildingStorey Method
  ClearFaceWithElementHandleMap Method
  Dispose Method
  FindSpaceBoundingElementHandle Method
  Get2DContextHandle Method
  Get3DContextHandle Method
  GetBuilding Method
  GetDoorWindowOpeningHandle Method
  GetFamilyName Method
  GetFile Method
  GetHostObjects Method
  GetLevelInfo Method
  GetLevelInfos Method
  GetMaterialIdForCurrentExportState Method
  GetOptions Method
  GetOrCreateFillPattern Method
  GetOwnerHistoryHandle Method
  GetProject Method
  GetRelatedElements Method
  GetRelatedProducts Method
  GetSite Method
  PopExportState Method
  PopTransform Method
  PushExportState Method
  PushTransform Method
  RegisterDoorWindowForUncreatedOpening Method
  RegisterFaceWithElementHandle Method
  RegisterShapeForPresentationLayer Method
  RegisterSpaceBoundingElementHandle Method
  RemoveBuildingStorey Method
  Set2DContextHandle Method
  Set3DContextHandle Method
  SetBuilding Method
  SetFile Method
  SetMaterialIdForCurrentExportState Method
  SetOwnerHistoryHandle Method
  SetProject Method
  SetSite Method
  ExporterIFC Properties
  ExportAs2x2 Property
  ExportAs2x3 Property
  ExportBaseQuantities Property
  FileName Property
  FileVersion Property
  IsValidObject Property
  SpaceBoundaryLevel Property
  WallAndColumnSplitting Property
  ExporterIFCRegistry Class
  ExporterIFCRegistry Members
  ExporterIFCRegistry Methods
  Dispose Method
  ExporterIFCRegistry Properties
  IsValidObject Property
  ExporterIFCUtils Class
  ExporterIFCUtils Members
  ExporterIFCUtils Methods
  AddClippingsToBaseExtrusion Method
  AddValueString Method
  AreSolidsEqual Method
  CanExportWallGeometryAsExtrusion Method
  CollectGeometryInfo Method
  CollectGeometryInfo Method (ExporterIFC, IFCGeometryInfo, GeometryObject, XYZ, Boolean)
  CollectGeometryInfo Method (ExporterIFC, IFCGeometryInfo, GeometryObject, XYZ, Boolean, Transform)
  ComputeAreaOfCurveLoops Method
  ComputeRoofProjectedArea Method
  CreateAlternateGUID Method
  CreateGUID Method
  CreateProjectLevelGUID Method
  CreateSubElementGUID Method
  EndExportInternal Method
  ExportExtrudedSlabOpenings Method
  ExportSlabAsExtrusion Method
  GetAttachedColumns Method
  GetConnectedWalls Method
  GetDoor2DArcsFromFamily Method
  GetElevationProfile Method
  GetFamilyName Method
  GetGeometryFromInplaceWall Method
  GetGlobal2DDirectionHandles Method
  GetGlobal2DOriginHandle Method
  GetGlobal3DDirectionHandles Method
  GetGlobal3DOriginHandle Method
  GetIFCClassName Method
  GetIFCClassNameByCategory Method
  GetIFCType Method
  GetInstanceCutoutFromWall Method
  GetLegacyCurtainSubElements Method
  GetLegacyStairOrRampComponents Method
  GetLegacyStairsProperties Method
  GetLevelIdByHeight Method
  GetLoopsFromTopBottomFace Method
  GetMinSymbolHeight Method
  GetMinSymbolWidth Method
  GetNumBuildingStoreys Method
  GetOpeningData Method
  GetOriginalSymbol Method
  GetRebarGeometry Method
  GetRelativeLocalPlacementOffsetTransform Method
  GetRoofComponents Method
  GetRoomBoundaryAsCurveLoopArray Method
  GetTransformForDoorOrWindow Method
  GetUnscaledTransform Method
  GetWallBaseOffset Method
  GetWallHeightDirection Method
  GetWallTrimmedCurve Method
  HasElevationProfile Method
  IsCurveFromOtherElementSketch Method
  IsCurveLoopConvexWithOpenings Method
  IsWallBaseRectangular Method
  IsWallCompletelyClipped Method
  IsWallJoinedToTop Method
  SetGlobal2DDirectionHandles Method
  SetGlobal2DOriginHandle Method
  SetGlobal3DDirectionHandles Method
  SetGlobal3DOriginHandle Method
  SortCurveLoops Method
  TransformAndScalePoint Method
  TransformAndScaleVector Method
  UsesInstanceGeometry Method
  ValidateCurveLoops Method
  IExporterIFC Interface
  IExporterIFC Members
  IExporterIFC Methods
  ExportIFC Method
  IFCAggregate Class
  IFCAggregate Members
  IFCAggregate Methods
  Add Method
  AddAggregate Method
  Delete Method
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetIFCAggregateIterator Method
  IFCAggregate Properties
  Count Property
  IsValidObject Property
  Item Property
  IFCAggregateIterator Class
  IFCAggregateIterator Members
  IFCAggregateIterator Methods
  Dispose Method
  MoveNext Method
  Reset Method
  IFCAggregateIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  IFCAnyHandle Class
  IFCAnyHandle Members
  IFCAnyHandle Methods
  CreateAggregateAttribute Method
  Delete Method
  Dispose Method
  Equals Method
  GetAttribute Method
  GetHashCode Method
  IsSubTypeOf Method
  IsTypeOf Method
  SetAttribute Method
  SetAttribute Method (String, IFCAnyHandle)
  SetAttribute Method (String, IFCData)
  SetAttribute Method (String, Boolean)
  SetAttribute Method (String, ICollection(IFCAnyHandle))
  SetAttribute Method (String, ICollection(Boolean))
  SetAttribute Method (String, ICollection(Double))
  SetAttribute Method (String, ICollection(Int32))
  SetAttribute Method (String, ICollection(String))
  SetAttribute Method (String, IList(IFCAnyHandle))
  SetAttribute Method (String, IList(Boolean))
  SetAttribute Method (String, IList(Double))
  SetAttribute Method (String, IList(Int32))
  SetAttribute Method (String, IList(String))
  SetAttribute Method (String, ISet(IFCAnyHandle))
  SetAttribute Method (String, ISet(Boolean))
  SetAttribute Method (String, ISet(Double))
  SetAttribute Method (String, ISet(Int32))
  SetAttribute Method (String, ISet(String))
  SetAttribute Method (String, Double)
  SetAttribute Method (String, Int32)
  SetAttribute Method (String, String)
  Unset Method
  UnsetAttribute Method
  IFCAnyHandle Operators
  Equality Operator
  Inequality Operator
  IFCAnyHandle Properties
  HasValue Property
  Id Property
  IsValidObject Property
  StepId Property
  TypeName Property
  IFCConnectedWallData Class
  IFCConnectedWallData Members
  IFCConnectedWallData Methods
  Dispose Method
  IFCConnectedWallData Properties
  ElementId Property
  IsValidObject Property
  Location Property
  IFCConnectedWallDataLocation Enumeration
  IFCData Class
  IFCData Members
  IFCData Constructor
  IFCData Methods
  AsAggregate Method
  AsBoolean Method
  AsDouble Method
  AsInstance Method
  AsInteger Method
  AsLogical Method
  AsString Method
  CreateBinary Method
  CreateBoolean Method
  CreateBooleanOfType Method
  CreateDouble Method
  CreateDoubleOfType Method
  CreateEnumeration Method
  CreateIFCAggregate Method
  CreateIFCAnyHandle Method
  CreateInteger Method
  CreateIntegerOfType Method
  CreateLogical Method
  CreateLogicalOfType Method
  CreateString Method
  CreateStringOfType Method
  Dispose Method
  Equals Method
  GetHashCode Method
  GetSimpleType Method
  GetTypeList Method
  HasSimpleType Method
  SetSimpleType Method
  SetTypeList Method
  IFCData Operators
  Equality Operator
  Inequality Operator
  IFCData Properties
  HasValue Property
  IsValidObject Property
  PrimitiveType Property
  IFCDataPrimitiveType Enumeration
  IFCDoorStyleOperation Enumeration
  IFCExtrusionAxes Enumeration
  IFCExtrusionBasis Enumeration
  IFCExtrusionCalculatorOptions Class
  IFCExtrusionCalculatorOptions Members
  IFCExtrusionCalculatorOptions Constructor
  IFCExtrusionCalculatorOptions Methods
  Dispose Method
  IFCExtrusionCalculatorOptions Properties
  CustomAxis Property
  ExtrusionAxes Property
  IsValidObject Property
  Scale Property
  IFCExtrusionCalculatorUtils Class
  IFCExtrusionCalculatorUtils Members
  IFCExtrusionCalculatorUtils Methods
  CalculateExtrusionData Method
  CalculateExtrusionData Method (IFCExtrusionCalculatorOptions, GeometryObject)
  CalculateExtrusionData Method (IFCExtrusionCalculatorOptions, IList(Face))
  IFCExtrusionCreationData Class
  IFCExtrusionCreationData Members
  IFCExtrusionCreationData Constructor
  IFCExtrusionCreationData Methods
  AddOpening Method
  ClearOpenings Method
  Dispose Method
  GetLocalPlacement Method
  GetOpenings Method
  SetLocalPlacement Method
  IFCExtrusionCreationData Properties
  AllowVerticalOffsetOfBReps Property
  AreInnerRegionsOpenings Property
  CustomAxis Property
  ExtrusionDirection Property
  ForceOffset Property
  HasCustomAxis Property
  HasExtrusionDirection Property
  IsValidObject Property
  PossibleExtrusionAxes Property
  ReuseLocalPlacement Property
  ScaledArea Property
  ScaledHeight Property
  ScaledInnerPerimeter Property
  ScaledLength Property
  ScaledOuterPerimeter Property
  ScaledWidth Property
  Slope Property
  IFCExtrusionData Class
  IFCExtrusionData Members
  IFCExtrusionData Constructor
  IFCExtrusionData Methods
  AddLoop Method
  ClearLoops Method
  Dispose Method
  GetLoops Method
  IsValid Method
  RemoveLoopAt Method
  IFCExtrusionData Properties
  ExtrusionBasis Property
  ExtrusionDirection Property
  IsValidObject Property
  ScaledExtrusionLength Property
  IFCFamilyInstanceExtrusionExportResults Class
  IFCFamilyInstanceExtrusionExportResults Members
  IFCFamilyInstanceExtrusionExportResults Methods
  Dispose Method
  GetCutPairOpenings Method
  GetExtrusionHandle Method
  IFCFamilyInstanceExtrusionExportResults Properties
  ExtraOffset Property
  IsValidObject Property
  MaterialId Property
  IFCFile Class
  IFCFile Members
  IFCFile Methods
  Close Method
  Create Method
  CreateCurveBoundedPlane Method
  CreateHeaderInstance Method
  CreateInstance Method
  CreateStyle Method
  CreateStyle Method (ExporterIFC, IFCAnyHandle)
  CreateStyle Method (ExporterIFC, IFCAnyHandle, Color, ElementId)
  Dispose Method
  GetInstanceCount Method
  GetInstances Method
  Read Method
  Read Method (IFCFileReadOptions)
  Read Method (IFCFileReadOptions, Int32, Int32)
  Write Method
  IFCFile Properties
  IsValidObject Property
  IFCFileFormat Enumeration
  IFCFileModelOptions Class
  IFCFileModelOptions Members
  IFCFileModelOptions Constructor
  IFCFileModelOptions Methods
  Dispose Method
  IFCFileModelOptions Properties
  CacheSize Property
  IsValidObject Property
  SchemaFile Property
  SchemaName Property
  UserControlledInverses Property
  IFCFileReadOptions Class
  IFCFileReadOptions Members
  IFCFileReadOptions Constructor
  IFCFileReadOptions Methods
  Dispose Method
  IFCFileReadOptions Properties
  FileName Property
  IsValidObject Property
  XMLConfigFileName Property
  IFCFileWriteOptions Class
  IFCFileWriteOptions Members
  IFCFileWriteOptions Constructor
  IFCFileWriteOptions Methods
  Dispose Method
  IFCFileWriteOptions Properties
  FileFormat Property
  FileName Property
  IsValidObject Property
  XMLConfigFileName Property
  IFCGeometryInfo Class
  IFCGeometryInfo Members
  IFCGeometryInfo Methods
  CreateCurveGeometryInfo Method
  CreateFaceGeometryInfo Method
  CreateFaceGeometryInfo Method (Double)
  CreateFaceGeometryInfo Method (Double, Boolean)
  CreateFaceGeometryInfo Method (ExporterIFC, Plane, XYZ, Double, Boolean)
  CreateSurfaceGeometryInfo Method
  Dispose Method
  GetCurves Method
  GetFaces Method
  GetRepresentations Method
  GetSurfaces Method
  IFCGeometryInfo Properties
  IsValidObject Property
  IFCImportAction Enumeration
  IFCImportIntent Enumeration
  IFCImportOptions Class
  IFCImportOptions Members
  IFCImportOptions Constructor
  IFCImportOptions Methods
  Dispose Method
  GetConversionData Method
  IFCImportOptions Properties
  Action Property
  AutoJoin Property
  CreateLinkInstanceOnly Property
  ForceImport Property
  Intent Property
  IsValidObject Property
  RevitLinkFileName Property
  IFCLegacyStairOrRamp Class
  IFCLegacyStairOrRamp Members
  IFCLegacyStairOrRamp Methods
  Dispose Method
  GetBoundaryLines Method
  GetLandingGeometries Method
  GetNumberOfRisers Method
  GetNumberOfTreads Method
  GetRunGeometries Method
  GetStringerGeometries Method
  GetTreadsLength Method
  GetWalkLines Method
  IFCLegacyStairOrRamp Properties
  IsRamp Property
  IsValidObject Property
  RiserHeight Property
  IFCLevelInfo Class
  IFCLevelInfo Members
  IFCLevelInfo Methods
  Create Method
  Dispose Method
  GetBuildingStorey Method
  GetLocalPlacement Method
  GetRelatedElements Method
  GetRelatedProducts Method
  IFCLevelInfo Properties
  DistanceToNextLevel Property
  Elevation Property
  IsValidObject Property
  IFCLogical Enumeration
  IFCOpeningData Class
  IFCOpeningData Members
  IFCOpeningData Methods
  Dispose Method
  GetExtrusionData Method
  GetOpeningSolids Method
  IFCOpeningData Properties
  IsRecess Property
  IsValidObject Property
  OpeningElementId Property
  IFCProductWrapper Class
  IFCProductWrapper Members
  IFCProductWrapper Methods
  AddAnnotation Method
  AddBuilding Method
  AddElement Method
  AddFinishMaterial Method
  AddSite Method
  AddSpace Method
  ClearFinishMaterials Method
  Create Method
  Create Method (IFCProductWrapper)
  Create Method (ExporterIFC, Boolean)
  Create Method (IFCProductWrapper, Boolean)
  Dispose Method
  FindExtrusionCreationParameters Method
  GetAllObjects Method
  GetAnElement Method
  IFCProductWrapper Properties
  Count Property
  IsValidObject Property
  IFCProjectLevelGUIDType Enumeration
  IFCRange Class
  IFCRange Members
  IFCRange Constructor
  IFCRange Constructor
  IFCRange Constructor (IFCRange)
  IFCRange Constructor (Double, Double)
  IFCRange Methods
  Dispose Method
  IFCRange Properties
  End Property
  IsValidObject Property
  Start Property
  IFCTransaction Class
  IFCTransaction Members
  IFCTransaction Constructor
  IFCTransaction Methods
  Commit Method
  Dispose Method
  RollBack Method
  IFCTransaction Properties
  IsValidObject Property
  IFCTransformSetter Class
  IFCTransformSetter Members
  IFCTransformSetter Methods
  Create Method
  Dispose Method
  Initialize Method
  InitializeFromBoundingBox Method
  IFCTransformSetter Properties
  IsValidObject Property
  IFCTypeInfo Class
  IFCTypeInfo Members
  IFCTypeInfo Constructor
  IFCTypeInfo Methods
  Dispose Method
  Get2DMapHandle Method
  Get3DMapHandle Method
  GetStyle Method
  GetStyleTransform Method
  IsValid Method
  Set2DMapHandle Method
  Set3DMapHandle Method
  SetStyle Method
  SetStyleTransform Method
  IFCTypeInfo Properties
  IsValidObject Property
  MaterialId Property
  ScaledArea Property
  ScaledDepth Property
  ScaledInnerPerimeter Property
  ScaledOuterPerimeter Property
  IFCWindowStyleOperation Enumeration
  IIFCImporterServer Interface
  IIFCImporterServer Members
  IIFCImporterServer Methods
  ImportIFC Method
  ImporterIFC Class
  ImporterIFC Members
  ImporterIFC Methods
  Dispose Method
  GetOptions Method
  ProcessIFCProject Method
  ProcessIFCProject Method (IFCAnyHandle)
  ProcessIFCProject Method (IFCAnyHandle, IDictionary(IFCAnyHandle, ElementId))
  SetFile Method
  ImporterIFC Properties
  Document Property
  FullFileName Property
  IsValidObject Property
  ImporterIFCUtils Class
  ImporterIFCUtils Members
  ImporterIFCUtils Methods
  CreateEmptyFamily Method
  RoofComponents Class
  RoofComponents Members
  RoofComponents Methods
  Dispose Method
  GetAreasOfCurveLoops Method
  GetCurveLoops Method
  GetLoopFaces Method
  GetPlaneDirections Method
  GetPlaneOrigins Method
  RoofComponents Properties
  IsValidObject Property
  ScaledDepth Property
  Autodesk.Revit.DB.Lighting Namespace
  AdvancedLossFactor Class
  AdvancedLossFactor Members
  AdvancedLossFactor Constructor
  AdvancedLossFactor Constructor
  AdvancedLossFactor Constructor (AdvancedLossFactor)
  AdvancedLossFactor Constructor (Double, Double, Double, Double, Double, Double, Double)
  AdvancedLossFactor Methods
  AdvancedLossFactor Properties
  BallastLossFactor Property
  LampLumenDepreciation Property
  LampTiltLossFactor Property
  LuminaireDirtDepreciation Property
  SurfaceDepreciationLossFactor Property
  TemperatureLossFactor Property
  VoltageLossFactor Property
  BasicLossFactor Class
  BasicLossFactor Members
  BasicLossFactor Constructor
  BasicLossFactor Constructor
  BasicLossFactor Constructor (Double)
  BasicLossFactor Constructor (BasicLossFactor)
  BasicLossFactor Methods
  BasicLossFactor Properties
  LossFactor Property
  CircleLightShape Class
  CircleLightShape Members
  CircleLightShape Constructor
  CircleLightShape Constructor
  CircleLightShape Constructor (Double)
  CircleLightShape Constructor (CircleLightShape)
  CircleLightShape Methods
  CircleLightShape Properties
  EmitDiameter Property
  ColorPreset Enumeration
  CustomInitialColor Class
  CustomInitialColor Members
  CustomInitialColor Constructor
  CustomInitialColor Constructor (Double)
  CustomInitialColor Constructor (CustomInitialColor)
  CustomInitialColor Methods
  CustomInitialColor Properties
  Temperature Property
  HemisphericalLightDistribution Class
  HemisphericalLightDistribution Members
  HemisphericalLightDistribution Constructor
  HemisphericalLightDistribution Constructor
  HemisphericalLightDistribution Constructor (HemisphericalLightDistribution)
  HemisphericalLightDistribution Methods
  HemisphericalLightDistribution Properties
  InitialColor Class
  InitialColor Members
  InitialColor Methods
  Clone Method
  Dispose Method
  InitialColor Properties
  IsValidObject Property
  TemperatureValue Property
  InitialFluxIntensity Class
  InitialFluxIntensity Members
  InitialFluxIntensity Constructor
  InitialFluxIntensity Constructor (Double)
  InitialFluxIntensity Constructor (InitialFluxIntensity)
  InitialFluxIntensity Methods
  InitialFluxIntensity Properties
  Flux Property
  InitialIlluminanceIntensity Class
  InitialIlluminanceIntensity Members
  InitialIlluminanceIntensity Constructor
  InitialIlluminanceIntensity Constructor (InitialIlluminanceIntensity)
  InitialIlluminanceIntensity Constructor (Double, Double)
  InitialIlluminanceIntensity Methods
  InitialIlluminanceIntensity Properties
  Distance Property
  Illuminance Property
  InitialIntensity Class
  InitialIntensity Members
  InitialIntensity Methods
  Clone Method
  Dispose Method
  InitialIntensity Properties
  InitialIntensityValue Property
  IsValidObject Property
  InitialLuminousIntensity Class
  InitialLuminousIntensity Members
  InitialLuminousIntensity Constructor
  InitialLuminousIntensity Constructor (Double)
  InitialLuminousIntensity Constructor (InitialLuminousIntensity)
  InitialLuminousIntensity Methods
  InitialLuminousIntensity Properties
  Luminosity Property
  InitialWattageIntensity Class
  InitialWattageIntensity Members
  InitialWattageIntensity Constructor
  InitialWattageIntensity Constructor (InitialWattageIntensity)
  InitialWattageIntensity Constructor (Double, Double)
  InitialWattageIntensity Methods
  InitialWattageIntensity Properties
  Efficacy Property
  Wattage Property
  LightDimmingColor Enumeration
  LightDistribution Class
  LightDistribution Members
  LightDistribution Methods
  Clone Method
  Dispose Method
  LightDistribution Properties
  IsValidObject Property
  LightDistributionStyle Enumeration
  LightFamily Class
  LightFamily Members
  LightFamily Methods
  Dispose Method
  GetLightDistributionStyle Method
  GetLightFamily Method
  GetLightShapeStyle Method
  GetLightSourceTransform Method
  GetLightType Method
  GetLightTypeName Method
  GetNumberOfLightTypes Method
  SetLightDistributionStyle Method
  SetLightShapeStyle Method
  LightFamily Properties
  IsValidObject Property
  LightGroup Class
  LightGroup Members
  LightGroup Methods
  AddLight Method
  Dispose Method
  GetLights Method
  RemoveLight Method
  LightGroup Properties
  Id Property
  IsValidObject Property
  Name Property
  LightGroupManager Class
  LightGroupManager Members
  LightGroupManager Methods
  CreateGroup Method
  DeleteGroup Method
  Dispose Method
  GetGroups Method
  GetLightDimmer Method
  GetLightGroupManager Method
  IsLightGroupOn Method
  IsLightOn Method
  SetLightDimmer Method
  SetLightGroupOn Method
  SetLightOn Method
  LightGroupManager Properties
  IsValidObject Property
  LightShape Class
  LightShape Members
  LightShape Methods
  Clone Method
  Dispose Method
  LightShape Properties
  IsValidObject Property
  LightShapeStyle Enumeration
  LightType Class
  LightType Members
  LightType Methods
  Dispose Method
  GetInitialColor Method
  GetInitialIntensity Method
  GetLightDistribution Method
  GetLightShape Method
  GetLightType Method
  GetLightTypeFromInstance Method
  GetLossFactor Method
  SetInitialColor Method
  SetInitialIntensity Method
  SetLightDistribution Method
  SetLightShape Method
  SetLossFactor Method
  LightType Properties
  ColorFilter Property
  DimmingColor Property
  IsValidObject Property
  LineLightShape Class
  LineLightShape Members
  LineLightShape Constructor
  LineLightShape Constructor
  LineLightShape Constructor (Double)
  LineLightShape Constructor (LineLightShape)
  LineLightShape Methods
  LineLightShape Properties
  EmitLength Property
  LossFactor Class
  LossFactor Members
  LossFactor Methods
  Clone Method
  Dispose Method
  LossFactor Properties
  IsValidObject Property
  LossFactorValue Property
  PhotometricWebLightDistribution Class
  PhotometricWebLightDistribution Members
  PhotometricWebLightDistribution Constructor
  PhotometricWebLightDistribution Constructor (PhotometricWebLightDistribution)
  PhotometricWebLightDistribution Constructor (String, Double)
  PhotometricWebLightDistribution Methods
  PhotometricWebLightDistribution Properties
  PhotometricWebFile Property
  TiltAngle Property
  PointLightShape Class
  PointLightShape Members
  PointLightShape Constructor
  PointLightShape Constructor
  PointLightShape Constructor (PointLightShape)
  PointLightShape Methods
  PointLightShape Properties
  PresetInitialColor Class
  PresetInitialColor Members
  PresetInitialColor Constructor
  PresetInitialColor Constructor (ColorPreset)
  PresetInitialColor Constructor (PresetInitialColor)
  PresetInitialColor Methods
  PresetInitialColor Properties
  Preset Property
  RectangleLightShape Class
  RectangleLightShape Members
  RectangleLightShape Constructor
  RectangleLightShape Constructor
  RectangleLightShape Constructor (RectangleLightShape)
  RectangleLightShape Constructor (Double, Double)
  RectangleLightShape Methods
  RectangleLightShape Properties
  EmitLength Property
  EmitWidth Property
  SphericalLightDistribution Class
  SphericalLightDistribution Members
  SphericalLightDistribution Constructor
  SphericalLightDistribution Constructor
  SphericalLightDistribution Constructor (SphericalLightDistribution)
  SphericalLightDistribution Methods
  SphericalLightDistribution Properties
  SpotLightDistribution Class
  SpotLightDistribution Members
  SpotLightDistribution Constructor
  SpotLightDistribution Constructor
  SpotLightDistribution Constructor (SpotLightDistribution)
  SpotLightDistribution Constructor (Double, Double, Double)
  SpotLightDistribution Methods
  SpotLightDistribution Properties
  SpotBeamAngle Property
  SpotFieldAngle Property
  TiltAngle Property
  Autodesk.Revit.DB.Macros Namespace
  AddInIdAttribute Class
  AddInIdAttribute Members
  AddInIdAttribute Constructor
  AddInIdAttribute Methods
  AddInIdAttribute Properties
  Value Property
  ApplicationEntryPoint Class
  ApplicationEntryPoint Members
  ApplicationEntryPoint Constructor
  ApplicationEntryPoint Methods
  FinishInitializationEO Method
  Initialize Method
  OnShutdownEO Method
  OpenDocumentFile Method
  OpenIFCDocument Method
  ApplicationEntryPoint Properties
  AddinFolder Property
  ApplicationEntryPoint Events
  ApplicationMacroOptions Enumeration
  DocumentEntryPoint Class
  DocumentEntryPoint Members
  DocumentEntryPoint Constructor
  DocumentEntryPoint Methods
  Close Method
  Delete Method
  Export Method
  FinishInitializationEO Method
  GetElement Method
  GetRoomAtPoint Method
  GetSpaceAtPoint Method
  Import Method
  Initialize Method
  Link Method
  LoadFamily Method
  LoadFamilySymbol Method
  OnShutdownEO Method
  Paint Method
  Print Method
  Save Method
  SaveAs Method
  DocumentEntryPoint Properties
  AddinFolder Property
  PlanTopologies Property
  PlanTopology Property
  DocumentEntryPoint Events
  DocumentMacroOptions Enumeration
  IEntryPoint Interface
  IEntryPoint Members
  IEntryPoint Methods
  FinishInitialization Method
  Initialize Method
  OnShutdown Method
  IEntryPoint Properties
  AddinFolder Property
  Macro Class
  Macro Members
  Macro Methods
  Dispose Method
  Execute Method
  Macro Properties
  Description Property
  IsValidObject Property
  MacroModule Property
  Name Property
  MacroEnvironment Enumeration
  MacroLanguageType Enumeration
  MacroLevel Enumeration
  MacroManager Class
  MacroManager Members
  MacroManager Methods
  AddModule Method
  Contains Method
  Dispose Method
  GetApplicationMacroSecurityOptions Method
  GetBasicIEnumerator Method
  GetDocumentMacroSecurityOptions Method
  GetEnumerator Method
  GetMacroManager Method
  GetMacroManager Method (Application)
  GetMacroManager Method (Document)
  GetMacroManagerIterator Method
  RemoveModule Method
  SetApplicationMacroSecurityOptions Method
  SetDocumentMacroSecurityOptions Method
  MacroManager Properties
  Count Property
  Folder Property
  IsEnabled Property
  IsValidObject Property
  MacroLevel Property
  MacroManagerIterator Class
  MacroManagerIterator Members
  MacroManagerIterator Methods
  Dispose Method
  GetCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  MacroManagerIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  MacroModule Class
  MacroModule Members
  MacroModule Methods
  AddMacro Method
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetMacro Method
  GetMacroModuleIterator Method
  RemoveMacro Method
  MacroModule Properties
  Description Property
  Environment Property
  IsValidObject Property
  MacroLanguageType Property
  MacroLevel Property
  MacroManager Property
  ModuleStatus Property
  Name Property
  MacroModuleIterator Class
  MacroModuleIterator Members
  MacroModuleIterator Methods
  Dispose Method
  GetCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  MacroModuleIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  ModuleSettings Class
  ModuleSettings Members
  ModuleSettings Constructor
  ModuleSettings Methods
  Dispose Method
  ModuleSettings Properties
  Description Property
  IsValidObject Property
  MacroLanguageType Property
  Name Property
  ModuleStatus Enumeration
  VendorIdAttribute Class
  VendorIdAttribute Members
  VendorIdAttribute Constructor
  VendorIdAttribute Methods
  VendorIdAttribute Properties
  Value Property
  Autodesk.Revit.DB.Mechanical Namespace
  BoundarySegment Class
  BoundarySegment Members
  BoundarySegment Methods
  BoundarySegment Properties
  Curve Property
  Document Property
  Element Property
  BoundarySegmentArray Class
  BoundarySegmentArray Members
  BoundarySegmentArray Constructor
  BoundarySegmentArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  BoundarySegmentArray Properties
  IsEmpty Property
  Item Property
  Size Property
  BoundarySegmentArrayArray Class
  BoundarySegmentArrayArray Members
  BoundarySegmentArrayArray Constructor
  BoundarySegmentArrayArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  BoundarySegmentArrayArray Properties
  IsEmpty Property
  Item Property
  Size Property
  BoundarySegmentArrayArrayIterator Class
  BoundarySegmentArrayArrayIterator Members
  BoundarySegmentArrayArrayIterator Constructor
  BoundarySegmentArrayArrayIterator Methods
  MoveNext Method
  Reset Method
  BoundarySegmentArrayArrayIterator Properties
  Current Property
  BoundarySegmentArrayIterator Class
  BoundarySegmentArrayIterator Members
  BoundarySegmentArrayIterator Constructor
  BoundarySegmentArrayIterator Methods
  MoveNext Method
  Reset Method
  BoundarySegmentArrayIterator Properties
  Current Property
  ConditionType Enumeration
  Duct Class
  Duct Members
  Duct Methods
  Create Method
  CreatePlaceholder Method
  IsDuctTypeId Method
  IsHvacSystemTypeId Method
  IsLevelId Method
  Duct Properties
  DuctType Property
  IsPlaceholder Property
  Parameter Property
  DuctFittingAndAccessoryConnectorData Class
  DuctFittingAndAccessoryConnectorData Members
  DuctFittingAndAccessoryConnectorData Methods
  Dispose Method
  DuctFittingAndAccessoryConnectorData Properties
  Angle Property
  Coordination Property
  Diameter Property
  Flow Property
  FlowDirection Property
  Height Property
  Index Property
  IsValidObject Property
  LinkIndex Property
  Profile Property
  VelocityPressure Property
  Width Property
  DuctFittingAndAccessoryData Class
  DuctFittingAndAccessoryData Members
  DuctFittingAndAccessoryData Methods
  Dispose Method
  GetAllConnectorData Method
  GetEntity Method
  GetFamilyInstanceId Method
  DuctFittingAndAccessoryData Properties
  AirViscosity Property
  IsValidObject Property
  Origin Property
  PartType Property
  ServerGUID Property
  SystemClassification Property
  DuctFittingAndAccessoryPressureDropData Class
  DuctFittingAndAccessoryPressureDropData Members
  DuctFittingAndAccessoryPressureDropData Methods
  Dispose Method
  GetDuctFittingAndAccessoryData Method
  GetPresureDropItems Method
  SetDefaultEntity Method
  DuctFittingAndAccessoryPressureDropData Properties
  CalculationType Property
  IsValidObject Property
  DuctFittingAndAccessoryPressureDropItem Class
  DuctFittingAndAccessoryPressureDropItem Members
  DuctFittingAndAccessoryPressureDropItem Methods
  Dispose Method
  DuctFittingAndAccessoryPressureDropItem Properties
  BeginConnectorIndex Property
  Coefficient Property
  EndConnectorIndex Property
  IsValidObject Property
  VelocityPressure Property
  DuctFlowConfigurationType Enumeration
  DuctInsulation Class
  DuctInsulation Members
  DuctInsulation Methods
  Create Method
  DuctInsulation Properties
  Parameter Property
  DuctInsulationType Class
  DuctInsulationType Members
  DuctInsulationType Methods
  DuctInsulationType Properties
  Parameter Property
  DuctLining Class
  DuctLining Members
  DuctLining Methods
  Create Method
  DuctLining Properties
  Parameter Property
  DuctLiningType Class
  DuctLiningType Members
  DuctLiningType Methods
  IsValidRoughness Method
  DuctLiningType Properties
  Parameter Property
  Roughness Property
  DuctLossMethodType Enumeration
  DuctPressureDropData Class
  DuctPressureDropData Members
  DuctPressureDropData Methods
  Dispose Method
  DuctPressureDropData Properties
  CategoryId Property
  Coefficient Property
  Density Property
  EquivalentDiameter Property
  Flow Property
  Friction Property
  Height Property
  HydraulicDiameter Property
  IsValidObject Property
  Length Property
  Level Property
  PressureDrop Property
  ReynoldsNumber Property
  Roughness Property
  Shape Property
  Velocity Property
  VelocityPressure Property
  Viscosity Property
  WidthOrDiameter Property
  DuctSettings Class
  DuctSettings Members
  DuctSettings Methods
  GetDuctSettings Method
  GetPressLossCalculationServerInfo Method
  GetSpecificFittingAngles Method
  GetSpecificFittingAngleStatus Method
  IsValidSpecificFittingAngle Method
  SetPressLossCalculationServerInfo Method
  SetSpecificFittingAngleStatus Method
  DuctSettings Properties
  AirDensity Property
  AirViscosity Property
  ConnectorSeparator Property
  FittingAngleUsage Property
  FittingAnnotationSize Property
  OvalDuctSizeSeparator Property
  OvalDuctSizeSuffix Property
  Parameter Property
  RectangularDuctSizeSeparator Property
  RectangularDuctSizeSuffix Property
  RiseDropAnnotationSize Property
  RoundDuctSizePrefix Property
  RoundDuctSizeSuffix Property
  UseAnnotationScaleForSingleLineFittings Property
  DuctShape Enumeration
  DuctSizeIterator Class
  DuctSizeIterator Members
  DuctSizeIterator Methods
  Dispose Method
  GetCurrent Method
  HasCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  DuctSizeIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  DuctSizes Class
  DuctSizes Members
  DuctSizes Methods
  Contains Method
  Dispose Method
  GetBasicIEnumerator Method
  GetDuctSizeIterator Method
  GetEnumerator Method
  DuctSizes Properties
  Count Property
  IsValidObject Property
  DuctSizeSettingIterator Class
  DuctSizeSettingIterator Members
  DuctSizeSettingIterator Methods
  Dispose Method
  HasCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  DuctSizeSettingIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  DuctSizeSettings Class
  DuctSizeSettings Members
  DuctSizeSettings Methods
  AddSize Method
  GetDuctSizeSettingIterator Method
  GetDuctSizeSettings Method
  GetEnumerator Method
  GetSizeCount Method
  RemoveSize Method
  DuctSizeSettings Properties
  Item Property
  Parameter Property
  DuctSystemType Enumeration
  DuctType Class
  DuctType Members
  DuctType Methods
  DuctType Properties
  Parameter Property
  FlexDuct Class
  FlexDuct Members
  FlexDuct Methods
  Create Method
  Create Method (Document, ElementId, ElementId, ElementId, IList(XYZ))
  Create Method (Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList(XYZ))
  IsFlexDuctTypeId Method
  IsHVACSystemTypeId Method
  IsLevelId Method
  FlexDuct Properties
  EndTangent Property
  FlexDuctType Property
  Parameter Property
  Points Property
  StartTangent Property
  FlexDuctType Class
  FlexDuctType Members
  FlexDuctType Methods
  FlexDuctType Properties
  Parameter Property
  IDuctFittingAndAccessoryPressureDropServer Interface
  IDuctFittingAndAccessoryPressureDropServer Members
  IDuctFittingAndAccessoryPressureDropServer Methods
  Calculate Method
  GetDataSchema Method
  IsApplicable Method
  IDuctPressureDropServer Interface
  IDuctPressureDropServer Members
  IDuctPressureDropServer Methods
  Calculate Method
  GetHtmlDescription Method
  GetInformationLink Method
  MechanicalEquipment Class
  MechanicalEquipment Members
  MechanicalEquipment Methods
  MechanicalEquipment Properties
  MechanicalFitting Class
  MechanicalFitting Members
  MechanicalFitting Methods
  MechanicalFitting Properties
  PartType Property
  MechanicalSystem Class
  MechanicalSystem Members
  MechanicalSystem Methods
  Create Method
  Create Method (Document, ElementId)
  Create Method (Document, ElementId, String)
  IsPressureDropServerMissing Method
  Remove Method
  MechanicalSystem Properties
  BaseEquipmentConnector Property
  DuctNetwork Property
  Flow Property
  IsWellConnected Property
  Parameter Property
  StaticPressure Property
  SystemType Property
  MechanicalSystemType Class
  MechanicalSystemType Members
  MechanicalSystemType Methods
  Create Method
  ValidateRiseDropSymbolType Method
  MechanicalSystemType Properties
  Parameter Property
  RiseDropSettings Property
  MechanicalUtils Class
  MechanicalUtils Members
  MechanicalUtils Methods
  ConnectAirTerminalOnDuct Method
  ConnectDuctPlaceholdersAtCross Method
  ConnectDuctPlaceholdersAtCross Method (Document, ElementId, ElementId)
  ConnectDuctPlaceholdersAtCross Method (Document, ElementId, ElementId, ElementId)
  ConnectDuctPlaceholdersAtCross Method (Document, Connector, Connector, Connector, Connector)
  ConnectDuctPlaceholdersAtElbow Method
  ConnectDuctPlaceholdersAtElbow Method (Document, Connector, Connector)
  ConnectDuctPlaceholdersAtElbow Method (Document, ElementId, ElementId)
  ConnectDuctPlaceholdersAtTee Method
  ConnectDuctPlaceholdersAtTee Method (Document, ElementId, ElementId)
  ConnectDuctPlaceholdersAtTee Method (Document, Connector, Connector, Connector)
  ConvertDuctPlaceholders Method
  MEPBuildingConstruction Class
  MEPBuildingConstruction Members
  MEPBuildingConstruction Methods
  GetBuildingConstruction Method
  GetBuildingConstructionOverride Method
  GetConstructions Method
  SetBuildingConstruction Method
  SetBuildingConstructionOverride Method
  MEPBuildingConstruction Properties
  Parameter Property
  MEPBuildingConstructionSet Class
  MEPBuildingConstructionSet Members
  MEPBuildingConstructionSet Constructor
  MEPBuildingConstructionSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  MEPBuildingConstructionSet Properties
  IsEmpty Property
  Size Property
  MEPBuildingConstructionSetIterator Class
  MEPBuildingConstructionSetIterator Members
  MEPBuildingConstructionSetIterator Constructor
  MEPBuildingConstructionSetIterator Methods
  MoveNext Method
  Reset Method
  MEPBuildingConstructionSetIterator Properties
  Current Property
  MEPSection Class
  MEPSection Members
  MEPSection Methods
  Dispose Method
  GetCoefficient Method
  GetElementIds Method
  GetPressureDrop Method
  GetSegmentLength Method
  IsMain Method
  MEPSection Properties
  FixtureUnit Property
  Flow Property
  Friction Property
  FrictionFactor Property
  IsValidObject Property
  Number Property
  ReynoldsNumber Property
  Roughness Property
  TotalCoefficient Property
  TotalCurveLength Property
  TotalPressureLoss Property
  Velocity Property
  VelocityPressure Property
  MEPSpaceConstruction Class
  MEPSpaceConstruction Members
  MEPSpaceConstruction Methods
  DeleteConstruction Method
  DuplicateConstruction Method
  NewConstruction Method
  MEPSpaceConstruction Properties
  CurrentConstruction Property
  SpaceConstructions Property
  OccupancyUnit Enumeration
  ReturnAirflowType Enumeration
  RiseDropSymbol Enumeration
  Space Class
  Space Members
  Space Methods
  IsPointInSpace Method
  Space Properties
  ActualExhaustAirflow Property
  ActualHVACLoad Property
  ActualLightingLoad Property
  ActualOtherLoad Property
  ActualPowerLoad Property
  ActualReturnAirflow Property
  ActualSupplyAirflow Property
  AreaperPerson Property
  AverageEstimatedIllumination Property
  BaseHeatLoadOn Property
  BaseOffset Property
  CalculatedCoolingLoad Property
  CalculatedHeatingLoad Property
  CalculatedSupplyAirflow Property
  CeilingReflectance Property
  ClosedShell Property
  ConditionType Property
  DesignCoolingLoad Property
  DesignExhaustAirflow Property
  DesignHeatingLoad Property
  DesignHVACLoadperArea Property
  DesignLightingLoad Property
  DesignOtherLoadperArea Property
  DesignPowerLoad Property
  DesignReturnAirflow Property
  DesignSupplyAirflow Property
  FloorReflectance Property
  LatentHeatGainperPerson Property
  LightingCalculationWorkplane Property
  LightingLoadUnit Property
  LimitOffset Property
  NumberofPeople Property
  OccupancyUnit Property
  Occupiable Property
  Parameter Property
  Plenum Property
  PowerLoadUnit Property
  ReturnAirflow Property
  Room Property
  SensibleHeatGainperPerson Property
  SpaceCavityRatio Property
  SpaceConstruction Property
  SpaceType Property
  UnboundedHeight Property
  UpperLimit Property
  Volume Property
  WallReflectance Property
  Zone Property
  SpaceFilter Class
  SpaceFilter Members
  SpaceFilter Constructor
  SpaceFilter Methods
  PassesFilter Method
  SpaceFilter Properties
  SpaceSet Class
  SpaceSet Members
  SpaceSet Constructor
  SpaceSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  SpaceSet Properties
  IsEmpty Property
  Size Property
  SpaceSetIterator Class
  SpaceSetIterator Members
  SpaceSetIterator Constructor
  SpaceSetIterator Methods
  MoveNext Method
  Reset Method
  SpaceSetIterator Properties
  Current Property
  SpaceTag Class
  SpaceTag Members
  SpaceTag Methods
  SpaceTag Properties
  Parameter Property
  Space Property
  SpaceTagType Property
  SpaceTagFilter Class
  SpaceTagFilter Members
  SpaceTagFilter Constructor
  SpaceTagFilter Methods
  PassesFilter Method
  SpaceTagFilter Properties
  SpaceTagType Class
  SpaceTagType Members
  SpaceTagType Methods
  SpaceTagType Properties
  Parameter Property
  SpaceTagTypeSet Class
  SpaceTagTypeSet Members
  SpaceTagTypeSet Constructor
  SpaceTagTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  SpaceTagTypeSet Properties
  IsEmpty Property
  Size Property
  SpaceTagTypeSetIterator Class
  SpaceTagTypeSetIterator Members
  SpaceTagTypeSetIterator Constructor
  SpaceTagTypeSetIterator Methods
  MoveNext Method
  Reset Method
  SpaceTagTypeSetIterator Properties
  Current Property
  SpaceType Enumeration
  SystemCalculationLevel Enumeration
  Zone Class
  Zone Members
  Zone Methods
  AddSpaces Method
  RemoveSpaces Method
  Zone Properties
  Area Property
  Boundary Property
  CalculatedCoolingLoad Property
  CalculatedHeatingLoad Property
  CalculatedSupplyAirflow Property
  CoolingAirTemperature Property
  CoolingSetPoint Property
  DehumidificationSetPoint Property
  GrossArea Property
  GrossVolume Property
  HeatingAirTemperature Property
  HeatingSetPoint Property
  HumidificationSetPoint Property
  IsDefaultZone Property
  Name Property
  OutDoorAirPerArea Property
  OutDoorAirPerPerson Property
  OutdoorAirRatePerAirChangesPerHour Property
  Parameter Property
  Perimeter Property
  Phase Property
  ServiceType Property
  Spaces Property
  Volume Property
  Autodesk.Revit.DB.Plumbing Namespace
  FlexPipe Class
  FlexPipe Members
  FlexPipe Methods
  Create Method
  Create Method (Document, ElementId, ElementId, ElementId, IList(XYZ))
  Create Method (Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList(XYZ))
  IsFlexPipeTypeId Method
  IsLevelId Method
  IsPipingSystemTypeId Method
  FlexPipe Properties
  EndTangent Property
  FlexPipeType Property
  FlowState Property
  Parameter Property
  Points Property
  StartTangent Property
  FlexPipeType Class
  FlexPipeType Members
  FlexPipeType Methods
  FlexPipeType Properties
  Parameter Property
  FlowConversionMode Enumeration
  FluidTemperature Class
  FluidTemperature Members
  FluidTemperature Constructor
  FluidTemperature Methods
  Dispose Method
  FluidTemperature Properties
  Density Property
  IsValidObject Property
  Temperature Property
  Viscosity Property
  FluidTemperatureSetIterator Class
  FluidTemperatureSetIterator Members
  FluidTemperatureSetIterator Methods
  Dispose Method
  GetCurrent Method
  IsDone Method
  MoveNext Method
  Reset Method
  FluidTemperatureSetIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  FluidType Class
  FluidType Members
  FluidType Methods
  AddTemperature Method
  ClearAllTemperatures Method
  Create Method
  Create Method (Document, String)
  Create Method (Document, String, FluidType)
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetFluidTemperatureSetIterator Method
  GetFluidType Method
  GetTemperature Method
  IsFluidInUse Method
  RemoveTemperature Method
  FluidType Properties
  Parameter Property
  IPipeFittingAndAccessoryPressureDropServer Interface
  IPipeFittingAndAccessoryPressureDropServer Members
  IPipeFittingAndAccessoryPressureDropServer Methods
  Calculate Method
  GetDataSchema Method
  IsApplicable Method
  IPipePlumbingFixtureFlowServer Interface
  IPipePlumbingFixtureFlowServer Members
  IPipePlumbingFixtureFlowServer Methods
  Calculate Method
  GetHtmlDescription Method
  GetInformationLink Method
  IPipePressureDropServer Interface
  IPipePressureDropServer Members
  IPipePressureDropServer Methods
  Calculate Method
  GetHtmlDescription Method
  GetInformationLink Method
  Pipe Class
  Pipe Members
  Pipe Methods
  Create Method
  Create Method (Document, ElementId, ElementId, Connector, Connector)
  Create Method (Document, ElementId, ElementId, Connector, XYZ)
  Create Method (Document, ElementId, ElementId, ElementId, XYZ, XYZ)
  CreatePlaceholder Method
  IsLevelId Method
  IsPipeTypeId Method
  IsPipingSystemTypeId Method
  SetSystemType Method
  Pipe Properties
  FlowState Property
  IsPlaceholder Property
  Parameter Property
  PipeType Property
  PipeConnectionType Class
  PipeConnectionType Members
  PipeConnectionType Methods
  PipeConnectionType Properties
  Parameter Property
  PipeFittingAndAccessoryConnectorData Class
  PipeFittingAndAccessoryConnectorData Members
  PipeFittingAndAccessoryConnectorData Methods
  Dispose Method
  PipeFittingAndAccessoryConnectorData Properties
  Angle Property
  Coordination Property
  Diameter Property
  Flow Property
  FlowDirection Property
  Height Property
  Index Property
  IsValidObject Property
  LinkIndex Property
  Profile Property
  VelocityPressure Property
  Width Property
  PipeFittingAndAccessoryData Class
  PipeFittingAndAccessoryData Members
  PipeFittingAndAccessoryData Methods
  Dispose Method
  GetAllConnectorData Method
  GetEntity Method
  GetFamilyInstanceId Method
  PipeFittingAndAccessoryData Properties
  BehaviorType Property
  FluidDensity Property
  FluidViscosity Property
  IsValidObject Property
  Origin Property
  PartType Property
  ServerGUID Property
  SystemClassification Property
  PipeFittingAndAccessoryPressureDropData Class
  PipeFittingAndAccessoryPressureDropData Members
  PipeFittingAndAccessoryPressureDropData Methods
  Dispose Method
  GetPipeFittingAndAccessoryData Method
  GetPresureDropItems Method
  SetDefaultEntity Method
  PipeFittingAndAccessoryPressureDropData Properties
  CalculationType Property
  IsValidObject Property
  PipeFittingAndAccessoryPressureDropItem Class
  PipeFittingAndAccessoryPressureDropItem Members
  PipeFittingAndAccessoryPressureDropItem Methods
  Dispose Method
  PipeFittingAndAccessoryPressureDropItem Properties
  BeginConnectorIndex Property
  Coefficient Property
  EndConnectorIndex Property
  IsValidObject Property
  VelocityPressure Property
  PipeFlowConfigurationType Enumeration
  PipeFlowState Enumeration
  PipeInsulation Class
  PipeInsulation Members
  PipeInsulation Methods
  Create Method
  PipeInsulation Properties
  Parameter Property
  PipeInsulationType Class
  PipeInsulationType Members
  PipeInsulationType Methods
  PipeInsulationType Properties
  Parameter Property
  PipeLossMethodType Enumeration
  PipePlumbingFixtureFlowData Class
  PipePlumbingFixtureFlowData Members
  PipePlumbingFixtureFlowData Methods
  Dispose Method
  PipePlumbingFixtureFlowData Properties
  DimensionFlow Property
  FixtureUnits Property
  Flow Property
  FlowConfiguration Property
  FlowConversionMode Property
  IsValidObject Property
  PipePressureDropData Class
  PipePressureDropData Members
  PipePressureDropData Methods
  Dispose Method
  PipePressureDropData Properties
  CategoryId Property
  Coefficient Property
  Density Property
  Flow Property
  FlowState Property
  Friction Property
  FrictionFactor Property
  InsideDiameter Property
  IsValidObject Property
  KLevel Property
  Length Property
  NominalDiameter Property
  OutsideDiameter Property
  PressureDrop Property
  RelativeRoughness Property
  ReynoldsNumber Property
  Roughness Property
  Velocity Property
  VelocityPressure Property
  Viscosity Property
  PipeScheduleType Class
  PipeScheduleType Members
  PipeScheduleType Methods
  PipeScheduleType Properties
  Parameter Property
  PipeSegment Class
  PipeSegment Members
  PipeSegment Methods
  Create Method
  PipeSegment Properties
  Parameter Property
  ScheduleTypeId Property
  PipeSettings Class
  PipeSettings Members
  PipeSettings Methods
  AddPipeSlope Method
  GetFlowConvertionServerInfo Method
  GetPipeSettings Method
  GetPipeSlopes Method
  GetPressLossCalculationServerInfo Method
  GetSpecificFittingAngles Method
  GetSpecificFittingAngleStatus Method
  IsValidSpecificFittingAngle Method
  SetFlowConvertionServerInfo Method
  SetPipeSlopes Method
  SetPressLossCalculationServerInfo Method
  SetSpecificFittingAngleStatus Method
  PipeSettings Properties
  ConnectorSeparator Property
  ConnectorTolerance Property
  FittingAngleUsage Property
  FittingAnnotationSize Property
  Parameter Property
  SizePrefix Property
  SizeSuffix Property
  UseAnnotationScaleForSingleLineFittings Property
  PipeSystemType Enumeration
  PipeType Class
  PipeType Members
  PipeType Methods
  PipeType Properties
  Class Property
  Parameter Property
  PipingSystem Class
  PipingSystem Members
  PipingSystem Methods
  Create Method
  Create Method (Document, ElementId)
  Create Method (Document, ElementId, String)
  IsFlowServerMissing Method
  IsPressureDropServerMissing Method
  Remove Method
  PipingSystem Properties
  BaseEquipmentConnector Property
  FixtureUnits Property
  Flow Property
  IsWellConnected Property
  Parameter Property
  PipingNetwork Property
  StaticPressure Property
  SystemType Property
  PipingSystemType Class
  PipingSystemType Members
  PipingSystemType Methods
  Create Method
  ValidateRiseDropSymbolType Method
  PipingSystemType Properties
  FlowConversionMethod Property
  FluidTemperature Property
  FluidType Property
  Parameter Property
  SingleLineBendDropType Property
  SingleLineBendRiseType Property
  SingleLineJunctionDropType Property
  SingleLineJunctionRiseType Property
  TwoLineDropType Property
  TwoLineRiseType Property
  PlumbingUtils Class
  PlumbingUtils Members
  PlumbingUtils Methods
  ConnectPipePlaceholdersAtCross Method
  ConnectPipePlaceholdersAtCross Method (Document, ElementId, ElementId)
  ConnectPipePlaceholdersAtCross Method (Document, ElementId, ElementId, ElementId)
  ConnectPipePlaceholdersAtCross Method (Document, Connector, Connector, Connector, Connector)
  ConnectPipePlaceholdersAtElbow Method
  ConnectPipePlaceholdersAtElbow Method (Document, Connector, Connector)
  ConnectPipePlaceholdersAtElbow Method (Document, ElementId, ElementId)
  ConnectPipePlaceholdersAtTee Method
  ConnectPipePlaceholdersAtTee Method (Document, ElementId, ElementId)
  ConnectPipePlaceholdersAtTee Method (Document, Connector, Connector, Connector)
  ConvertPipePlaceholders Method
  HasOpenConnector Method
  PlaceCapOnOpenEnds Method
  Autodesk.Revit.DB.PointClouds Namespace
  CloudPoint Structure
  CloudPoint Members
  CloudPoint Constructor
  CloudPoint Fields
  Color Field
  X Field
  Y Field
  Z Field
  CloudPoint Methods
  CloudPoint Type Conversions
  Implicit Conversion (CloudPoint to XYZ)
  IPointCloudAccess Interface
  IPointCloudAccess Members
  IPointCloudAccess Methods
  CreatePointSetIterator Method
  CreatePointSetIterator Method (PointCloudFilter, ElementId)
  CreatePointSetIterator Method (PointCloudFilter, Double, ElementId)
  Free Method
  GetColorEncoding Method
  GetExtent Method
  GetName Method
  GetOffset Method
  GetUnitsToFeetConversionFactor Method
  ReadPoints Method
  IPointCloudEngine Interface
  IPointCloudEngine Members
  IPointCloudEngine Methods
  CreatePointCloudAccess Method
  Free Method
  IPointSetIterator Interface
  IPointSetIterator Members
  IPointSetIterator Methods
  Free Method
  ReadPoints Method
  PointCloudColorEncoding Enumeration
  PointCloudColorSettings Class
  PointCloudColorSettings Members
  PointCloudColorSettings Constructor
  PointCloudColorSettings Constructor
  PointCloudColorSettings Constructor (PointCloudColorMode)
  PointCloudColorSettings Constructor (PointCloudColorSettings)
  PointCloudColorSettings Constructor (Color, Color)
  PointCloudColorSettings Methods
  Assign Method
  Dispose Method
  IsEqual Method
  PointCloudColorSettings Properties
  Color1 Property
  Color2 Property
  IsValidObject Property
  PointCloudEngineRegistry Class
  PointCloudEngineRegistry Members
  PointCloudEngineRegistry Methods
  GetSupportedEngines Method
  IsEngineFileBased Method
  RegisterPointCloudEngine Method
  UnregisterPointCloudEngine Method
  PointCloudFilter Class
  PointCloudFilter Members
  PointCloudFilter Methods
  Clone Method
  Dispose Method
  PrepareForCell Method
  TestCell Method
  TestPoint Method
  PointCloudFilter Properties
  IsValidObject Property
  PointCloudFilterFactory Class
  PointCloudFilterFactory Members
  PointCloudFilterFactory Methods
  CreateMultiPlaneFilter Method
  CreateMultiPlaneFilter Method (IList(Plane))
  CreateMultiPlaneFilter Method (IList(Plane), Int32)
  PointCloudFilterUtils Class
  PointCloudFilterUtils Members
  PointCloudFilterUtils Methods
  GetFilteredOutline Method
  PointCloudOverrides Class
  PointCloudOverrides Members
  PointCloudOverrides Constructor
  PointCloudOverrides Methods
  ArePointCloudOverrideSettingsValid Method
  Assign Method
  Dispose Method
  GetPointCloudOverrideSettings Method
  GetPointCloudOverrideSettings Method (ElementId)
  GetPointCloudOverrideSettings Method (ElementId, String, Document)
  IsEqual Method
  SetPointCloudOverrideSettings Method
  SetPointCloudOverrideSettings Method (ElementId, PointCloudOverrideSettings)
  SetPointCloudOverrideSettings Method (ElementId, PointCloudOverrideSettings, String, Document)
  PointCloudOverrides Properties
  IsValidObject Property
  PointCloudOverrideSettings Class
  PointCloudOverrideSettings Members
  PointCloudOverrideSettings Constructor
  PointCloudOverrideSettings Constructor
  PointCloudOverrideSettings Constructor (PointCloudOverrideSettings)
  PointCloudOverrideSettings Methods
  Assign Method
  Dispose Method
  GetModeOverride Method
  IsEqual Method
  SetModeOverride Method
  PointCloudOverrideSettings Properties
  ColorMode Property
  IsValidObject Property
  Visible Property
  PointCollection Class
  PointCollection Members
  PointCollection Methods
  Dispose Method
  GetBasicIEnumerator Method
  GetEnumerator Method
  GetPointBufferPointer Method
  GetPointIterator Method
  PointCollection Properties
  Count Property
  IsValidObject Property
  PointIterator Class
  PointIterator Members
  PointIterator Methods
  Dispose Method
  Free Method
  IsDone Method
  MoveNext Method
  Reset Method
  PointIterator Properties
  Current Property
  CurrentObject Property
  IsValidObject Property
  Autodesk.Revit.DB.Structure Namespace
  AnalyticalAlignmentMethod Enumeration
  AnalyticalConsistencyChecking Class
  AnalyticalConsistencyChecking Members
  AnalyticalConsistencyChecking Methods
  CheckAnalyticalConsistency Method
  AnalyticalCurveSelector Enumeration
  AnalyticalCurveType Enumeration
  AnalyticalDirection Enumeration
  AnalyticalElementSelector Enumeration
  AnalyticalFixityState Enumeration
  AnalyticalLink Class
  AnalyticalLink Members
  AnalyticalLink Methods
  Create Method
  IsAutoGenerated Method
  IsValidHub Method
  AnalyticalLink Properties
  End Property
  EndHubId Property
  OwnerId Property
  Parameter Property
  Start Property
  StartHubId Property
  AnalyticalLinkType Class
  AnalyticalLinkType Members
  AnalyticalLinkType Methods
  IsValidAnalyticalFixityState Method
  AnalyticalLinkType Properties
  Parameter Property
  RotationX Property
  RotationY Property
  RotationZ Property
  TranslationX Property
  TranslationY Property
  TranslationZ Property
  AnalyticalLoopType Enumeration
  AnalyticalModel Class
  AnalyticalModel Members
  AnalyticalModel Methods
  Approximate Method
  CanApproximate Method
  CanDisableAutoDetect Method
  CanHaveRigidLinks Method
  CanUseHardPoints Method
  CloneAdjustment Method
  Disconnect Method
  Enable Method
  EnableAutoDetect Method
  GetAlignmentMethod Method
  GetAnalyticalModelSketchComponents Method
  GetAnalyticalModelSupports Method
  GetAnalyticalProjectionDatumPlane Method
  GetAnalyticalProjectionType Method
  GetAnalyzeAs Method
  GetApproximationDeviation Method
  GetAutoDetectMatchedElements Method
  GetCurve Method
  GetCurves Method
  GetElementId Method
  GetLocalCoordinateSystem Method
  GetManualAdjustmentMatchedElements Method
  GetOffset Method
  GetPoint Method
  GetReference Method
  GetRigidLink Method
  GetSweptProfile Method
  HasAlignment Method
  HasDeletedLinks Method
  HasRigidLinksWith Method
  HasSweptProfile Method
  IsAnalyzeAsValid Method
  IsApproximated Method
  IsAutoDetectEnabled Method
  IsElementFullySupported Method
  IsEnabled Method
  IsManuallyAdjusted Method
  IsModified Method
  IsSingleCurve Method
  IsSinglePoint Method
  IsSurface Method
  IsValidDirectionForAutoDetect Method
  IsValidDirectionForProjection Method
  IsValidForManualAdjustment Method
  IsValidManualAdjustmentSource Method
  IsValidManualAdjustmentTarget Method
  IsValidProjectionDatumPlane Method
  IsValidProjectionType Method
  IsValidRigidLinksOption Method
  IsValidSelector Method
  IsValidSelectorAndDirection Method
  ManuallyAdjust Method
  ResetLinks Method
  ResetManualAdjustment Method
  SetAlignmentMethod Method
  SetAnalyticalProjectionDatumPlane Method
  SetAnalyticalProjectionType Method
  SetAnalyzeAs Method
  SetApproximationDeviation Method
  SetOffset Method
  SetUsesHardPoints Method
  SupportsManualAdjustment Method
  UsesHardPoints Method
  AnalyticalModel Properties
  Parameter Property
  RigidLinksOption Property
  AnalyticalModelColumn Class
  AnalyticalModelColumn Members
  AnalyticalModelColumn Methods
  GetAlignmentMethod Method
  SetAlignmentMethod Method
  SetProjection Method
  AnalyticalModelColumn Properties
  BaseExtension Property
  BaseExtensionMethod Property
  BaseExtensionPlaneId Property
  Parameter Property
  TopExtension Property
  TopExtensionMethod Property
  TopExtensionPlaneId Property
  AnalyticalModelSelector Class
  AnalyticalModelSelector Members
  AnalyticalModelSelector Constructor
  AnalyticalModelSelector Constructor
  AnalyticalModelSelector Constructor (AnalyticalCurveSelector)
  AnalyticalModelSelector Constructor (Curve)
  AnalyticalModelSelector Constructor (Curve, AnalyticalCurveSelector)
  AnalyticalModelSelector Methods
  Dispose Method
  AnalyticalModelSelector Properties
  CurveSelector Property
  IsValidObject Property
  AnalyticalModelSketchComponent Class
  AnalyticalModelSketchComponent Members
  AnalyticalModelSketchComponent Methods
  Dispose Method
  EnableAutoDetect Method
  GetAnalyticalAlignmentMethod Method
  GetAnalyticalProjectionDatumPlane Method
  GetAnalyticalProjectionType Method
  GetAutoDetectMatchedElements Method
  GetComponentElementId Method
  IsAutoDetectEnabled Method
  IsValidAnalyticalAlignmentMethod Method
  IsValidAnalyticalProjectionType Method
  IsValidDatumPlaneForProjection Method
  SetAnalyticalAlignmentMethod Method
  SetAnalyticalProjectionDatumPlane Method
  SetAnalyticalProjectionType Method
  AnalyticalModelSketchComponent Properties
  IsValidObject Property
  AnalyticalModelStick Class
  AnalyticalModelStick Members
  AnalyticalModelStick Methods
  GetAlignmentMethod Method
  GetAlignmentMethod Method (AnalyticalElementSelector)
  GetProjectionPlaneY Method
  GetProjectionPlaneZ Method
  GetProjectionY Method
  GetProjectionZ Method
  SetAlignmentMethod Method
  SetAlignmentMethod Method (AnalyticalElementSelector, AnalyticalAlignmentMethod)
  SetProjection Method
  SetProjection Method (AnalyticalElementSelector, ElementId, ElementId)
  SetProjection Method (AnalyticalElementSelector, ElementId, StickElementProjectionZ)
  SetProjection Method (AnalyticalElementSelector, StickElementProjectionY, ElementId)
  SetProjection Method (AnalyticalElementSelector, StickElementProjectionY, StickElementProjectionZ)
  AnalyticalModelStick Properties
  Parameter Property
  AnalyticalModelSupport Class
  AnalyticalModelSupport Members
  AnalyticalModelSupport Methods
  Dispose Method
  GetCurve Method
  GetFace Method
  GetPoint Method
  GetPriority Method
  GetSupportingElement Method
  GetSupportType Method
  AnalyticalModelSupport Properties
  IsValidObject Property
  AnalyticalModelSurface Class
  AnalyticalModelSurface Members
  AnalyticalModelSurface Methods
  GetHiddenOpenings Method
  GetLoops Method
  GetOpeningLoops Method
  GetOpenings Method
  GetPlane Method
  HasOpenings Method
  HideOpening Method
  IsOpeningHidden Method
  IsPlanar Method
  IsValidOpeningForHide Method
  SetLoops Method
  ShowOpening Method
  AnalyticalModelSurface Properties
  AlignmentMethod Property
  BottomExtension Property
  BottomExtensionMethod Property
  BottomExtensionPlaneId Property
  HasExtension Property
  Parameter Property
  ProjectionPlaneZ Property
  ProjectionZ Property
  TopExtension Property
  TopExtensionMethod Property
  TopExtensionPlaneId Property
  AnalyticalModelSweptProfile Class
  AnalyticalModelSweptProfile Members
  AnalyticalModelSweptProfile Methods
  Dispose Method
  GetDrivingCurve Method
  GetSweptProfile Method
  AnalyticalModelSweptProfile Properties
  EndSetBack Property
  IsValidObject Property
  StartSetBack Property
  AnalyticalProjectionType Enumeration
  AnalyticalRigidLinksOption Enumeration
  AnalyticalSupportChecking Class
  AnalyticalSupportChecking Members
  AnalyticalSupportChecking Methods
  CheckMemberSupports Method
  AnalyticalSupportPriority Enumeration
  AnalyticalSupportType Enumeration
  AnalyzeAs Enumeration
  AreaLoad Class
  AreaLoad Members
  AreaLoad Methods
  AreaLoad Properties
  Curve Property
  Force Property
  Force1 Property
  Force2 Property
  Force3 Property
  NumCurves Property
  NumLoops Property
  NumRefPoints Property
  Parameter Property
  RefPoint Property
  AreaLoadType Class
  AreaLoadType Members
  AreaLoadType Methods
  AreaLoadType Properties
  Parameter Property
  AreaLoadTypeSet Class
  AreaLoadTypeSet Members
  AreaLoadTypeSet Constructor
  AreaLoadTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  AreaLoadTypeSet Properties
  IsEmpty Property
  Size Property
  AreaLoadTypeSetIterator Class
  AreaLoadTypeSetIterator Members
  AreaLoadTypeSetIterator Constructor
  AreaLoadTypeSetIterator Methods
  MoveNext Method
  Reset Method
  AreaLoadTypeSetIterator Properties
  Current Property
  AreaReinforcement Class
  AreaReinforcement Members
  AreaReinforcement Methods
  Create Method
  Create Method (Document, Element, IList(Curve), XYZ)
  Create Method (Document, Element, XYZ, ElementId, ElementId, ElementId)
  Create Method (Document, Element, IList(Curve), XYZ, ElementId, ElementId, ElementId)
  GetBoundaryCurveIds Method
  GetCurveElementIds Method
  GetHostId Method
  GetRebarInSystemIds Method
  IsSolidInView Method
  IsUnobscuredInView Method
  RemoveAreaReinforcementSystem Method
  SetSolidInView Method
  SetUnobscuredInView Method
  AreaReinforcement Properties
  AdditionalBottomCoverOffset Property
  AdditionalTopCoverOffset Property
  AreaReinforcementType Property
  Direction Property
  Parameter Property
  AreaReinforcementCurve Class
  AreaReinforcementCurve Members
  AreaReinforcementCurve Methods
  AreaReinforcementCurve Properties
  Curve Property
  Parameter Property
  AreaReinforcementType Class
  AreaReinforcementType Members
  AreaReinforcementType Methods
  CreateDefaultAreaReinforcementType Method
  AreaReinforcementType Properties
  Parameter Property
  BoundaryConditions Class
  BoundaryConditions Members
  BoundaryConditions Methods
  associateWithLoad Method
  GetBoundaryConditionsType Method
  GetDegreesOfFreedomCoordinateSystem Method
  GetOrientTo Method
  SetOrientTo Method
  BoundaryConditions Properties
  AssociatedLoad Property
  Curve Property
  HostElement Property
  NumCurves Property
  Parameter Property
  Point Property
  BoundaryConditionsOrientTo Enumeration
  BoundaryConditionsType Enumeration
  BracePlanRepresentation Enumeration
  CodeCheckingParameterServiceData Class
  CodeCheckingParameterServiceData Members
  CodeCheckingParameterServiceData Methods
  Dispose Method
  GetCurrentElements Method
  CodeCheckingParameterServiceData Properties
  Document Property
  IsValidObject Property
  FabricArea Class
  FabricArea Members
  FabricArea Methods
  CopyCurveLoopsInSketch Method
  Create Method
  Create Method (Document, Element, XYZ, ElementId, ElementId)
  Create Method (Document, Element, IList(CurveLoop), XYZ, XYZ)
  Create Method (Document, Element, IList(CurveLoop), XYZ, XYZ, ElementId, ElementId)
  GetBoundaryCurveIds Method
  GetCurveElementIds Method
  GetFabricSheetElementIds Method
  GetReinforcementRoundingManager Method
  GetTotalSheetMass Method
  GetValidViewsForTags Method
  IsCoverOffsetValid Method
  IsValidMajorLapSplice Method
  IsValidMinorLapSplice Method
  RemoveFabricReinforcementSystem Method
  FabricArea Properties
  CoverOffset Property
  Direction Property
  DirectionOrigin Property
  FabricAreaType Property
  FabricLocation Property
  FabricSheetTypeId Property
  HostId Property
  LapSplicePosition Property
  MajorLapSpliceLength Property
  MajorSheetAlignment Property
  MinorLapSpliceLength Property
  MinorSheetAlignment Property
  Parameter Property
  SketchId Property
  TagViewId Property
  FabricAreaType Class
  FabricAreaType Members
  FabricAreaType Methods
  CreateDefaultFabricAreaType Method
  FabricAreaType Properties
  Parameter Property
  FabricHostReference Enumeration
  FabricLapSplicePosition Enumeration
  FabricLocation Enumeration
  FabricReinSpanSymbol Class
  FabricReinSpanSymbol Members
  FabricReinSpanSymbol Methods
  Create Method
  FabricReinSpanSymbol Properties
  Parameter Property
  FabricRoundingManager Class
  FabricRoundingManager Members
  FabricRoundingManager Methods
  FabricRoundingManager Properties
  ApplicableReinforcementRoundingSource Property
  ApplicableTotalLengthRounding Property
  TotalLengthRounding Property
  FabricSheet Class
  FabricSheet Members
  FabricSheet Methods
  Create Method
  GetReinforcementRoundingManager Method
  GetSheetLocation Method
  GetWireCenterlines Method
  GetWireCenterlines Method
  GetWireCenterlines Method (WireDistributionDirection)
  IsCoverOffsetValid Method
  IsSingleFabricSheetWithinHost Method
  PlaceInHost Method
  FabricSheet Properties
  CoverOffset Property
  CutOverallLength Property
  CutOverallWidth Property
  CutSheetMass Property
  FabricAreaOwnerId Property
  FabricHostReference Property
  FabricLocation Property
  HostId Property
  Parameter Property
  FabricSheetAlignment Enumeration
  FabricSheetLayoutPattern Enumeration
  FabricSheetType Class
  FabricSheetType Members
  FabricSheetType Methods
  CreateDefaultFabricSheetType Method
  GetReinforcementRoundingManager Method
  IsValidMajorLapSplice Method
  IsValidMinorLapSplice Method
  SetMajorLayoutAsActualSpacing Method
  SetMajorLayoutAsFixedNumber Method
  SetMajorLayoutAsMaximumSpacing Method
  SetMajorLayoutAsNumberWithSpacing Method
  SetMinorLayoutAsActualSpacing Method
  SetMinorLayoutAsFixedNumber Method
  SetMinorLayoutAsMaximumSpacing Method
  SetMinorLayoutAsNumberWithSpacing Method
  FabricSheetType Properties
  MajorDirectionWireType Property
  MajorEndOverhang Property
  MajorLapSpliceLength Property
  MajorLayoutPattern Property
  MajorNumberOfWires Property
  MajorReinforcementArea Property
  MajorSpacing Property
  MajorStartOverhang Property
  Material Property
  MinorDirectionWireType Property
  MinorEndOverhang Property
  MinorLapSpliceLength Property
  MinorLayoutPattern Property
  MinorNumberOfWires Property
  MinorReinforcementArea Property
  MinorSpacing Property
  MinorStartOverhang Property
  OverallLength Property
  OverallWidth Property
  Parameter Property
  SheetMass Property
  SheetMassUnit Property
  FabricTagComponentReference Enumeration
  FabricWireType Class
  FabricWireType Members
  FabricWireType Methods
  CreateDefaultFabricWireType Method
  FabricWireType Properties
  Parameter Property
  WireDiameter Property
  FamilyStructuralMaterialTypeFilter Class
  FamilyStructuralMaterialTypeFilter Members
  FamilyStructuralMaterialTypeFilter Constructor
  FamilyStructuralMaterialTypeFilter Constructor (StructuralMaterialType)
  FamilyStructuralMaterialTypeFilter Constructor (StructuralMaterialType, Boolean)
  FamilyStructuralMaterialTypeFilter Methods
  PassesFilter Method
  FamilyStructuralMaterialTypeFilter Properties
  StructuralMaterialType Property
  Hub Class
  Hub Members
  Hub Methods
  GetHubConnectorManager Method
  GetOrigin Method
  HasOrigin Method
  Hub Properties
  Parameter Property
  ICodeCheckingParameterServer Interface
  ICodeCheckingParameterServer Members
  ICodeCheckingParameterServer Methods
  PerformCodeChecking Method
  IStructuralSectionsServer Interface
  IStructuralSectionsServer Members
  IStructuralSectionsServer Methods
  StructuralSectionsUpdate Method
  LineLoad Class
  LineLoad Members
  LineLoad Methods
  LineLoad Properties
  EndPoint Property
  Force Property
  Force1 Property
  Force2 Property
  Moment Property
  Moment1 Property
  Moment2 Property
  Parameter Property
  Point Property
  ProjectedLoad Property
  StartPoint Property
  UniformLoad Property
  LineLoadType Class
  LineLoadType Members
  LineLoadType Methods
  LineLoadType Properties
  Parameter Property
  LineLoadTypeSet Class
  LineLoadTypeSet Members
  LineLoadTypeSet Constructor
  LineLoadTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  LineLoadTypeSet Properties
  IsEmpty Property
  Size Property
  LineLoadTypeSetIterator Class
  LineLoadTypeSetIterator Members
  LineLoadTypeSetIterator Constructor
  LineLoadTypeSetIterator Methods
  MoveNext Method
  Reset Method
  LineLoadTypeSetIterator Properties
  Current Property
  LoadBase Class
  LoadBase Members
  LoadBase Methods
  IsOrientToPermitted Method
  LoadBase Properties
  HostElement Property
  HostElementId Property
  LoadCaseName Property
  LoadCategoryName Property
  LoadNatureName Property
  OrientTo Property
  Parameter Property
  WorkPlaneId Property
  LoadCase Class
  LoadCase Members
  LoadCase Methods
  LoadCase Properties
  Parameter Property
  LoadCaseArray Class
  LoadCaseArray Members
  LoadCaseArray Constructor
  LoadCaseArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  LoadCaseArray Properties
  IsEmpty Property
  Item Property
  Size Property
  LoadCaseArrayIterator Class
  LoadCaseArrayIterator Members
  LoadCaseArrayIterator Constructor
  LoadCaseArrayIterator Methods
  MoveNext Method
  Reset Method
  LoadCaseArrayIterator Properties
  Current Property
  LoadCaseSet Class
  LoadCaseSet Members
  LoadCaseSet Constructor
  LoadCaseSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  LoadCaseSet Properties
  IsEmpty Property
  Size Property
  LoadCaseSetIterator Class
  LoadCaseSetIterator Members
  LoadCaseSetIterator Constructor
  LoadCaseSetIterator Methods
  MoveNext Method
  Reset Method
  LoadCaseSetIterator Properties
  Current Property
  LoadCombination Class
  LoadCombination Members
  LoadCombination Methods
  LoadCombination Properties
  CombinationCaseName Property
  CombinationNatureName Property
  CombinationState Property
  CombinationStateIndex Property
  CombinationType Property
  CombinationTypeIndex Property
  Factor Property
  Name Property
  NumberOfComponents Property
  NumberOfUsages Property
  Parameter Property
  UsageName Property
  LoadCombinationArray Class
  LoadCombinationArray Members
  LoadCombinationArray Constructor
  LoadCombinationArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  LoadCombinationArray Properties
  IsEmpty Property
  Item Property
  Size Property
  LoadCombinationArrayIterator Class
  LoadCombinationArrayIterator Members
  LoadCombinationArrayIterator Constructor
  LoadCombinationArrayIterator Methods
  MoveNext Method
  Reset Method
  LoadCombinationArrayIterator Properties
  Current Property
  LoadNature Class
  LoadNature Members
  LoadNature Methods
  LoadNature Properties
  Parameter Property
  LoadOrientTo Enumeration
  LoadType Enumeration
  LoadTypeBase Class
  LoadTypeBase Members
  LoadTypeBase Methods
  LoadTypeBase Properties
  Parameter Property
  LoadTypeBaseSet Class
  LoadTypeBaseSet Members
  LoadTypeBaseSet Constructor
  LoadTypeBaseSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  LoadTypeBaseSet Properties
  IsEmpty Property
  Size Property
  LoadTypeBaseSetIterator Class
  LoadTypeBaseSetIterator Members
  LoadTypeBaseSetIterator Constructor
  LoadTypeBaseSetIterator Methods
  MoveNext Method
  Reset Method
  LoadTypeBaseSetIterator Properties
  Current Property
  LoadUsage Class
  LoadUsage Members
  LoadUsage Methods
  LoadUsage Properties
  Parameter Property
  LoadUsageArray Class
  LoadUsageArray Members
  LoadUsageArray Constructor
  LoadUsageArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  LoadUsageArray Properties
  IsEmpty Property
  Item Property
  Size Property
  LoadUsageArrayIterator Class
  LoadUsageArrayIterator Members
  LoadUsageArrayIterator Constructor
  LoadUsageArrayIterator Methods
  MoveNext Method
  Reset Method
  LoadUsageArrayIterator Properties
  Current Property
  MultiplanarOption Enumeration
  PathReinforcement Class
  PathReinforcement Members
  PathReinforcement Methods
  Create Method
  Create Method (Document, Element, IList(Curve), Boolean)
  Create Method (Document, Element, IList(Curve), Boolean, ElementId, ElementId, ElementId, ElementId)
  GetCurveElementIds Method
  GetHostId Method
  GetRebarInSystemIds Method
  IsSolidInView Method
  IsUnobscuredInView Method
  RemovePathReinforcementSystem Method
  SetSolidInView Method
  SetUnobscuredInView Method
  PathReinforcement Properties
  AdditionalOffset Property
  Parameter Property
  PathReinforcementType Property
  PathReinforcementType Class
  PathReinforcementType Members
  PathReinforcementType Methods
  CreateDefaultPathReinforcementType Method
  PathReinforcementType Properties
  Parameter Property
  PathReinSpanSymbol Class
  PathReinSpanSymbol Members
  PathReinSpanSymbol Methods
  Create Method
  PathReinSpanSymbol Properties
  Parameter Property
  PointLoad Class
  PointLoad Members
  PointLoad Methods
  PointLoad Properties
  Force Property
  Moment Property
  Parameter Property
  Point Property
  PointLoadType Class
  PointLoadType Members
  PointLoadType Methods
  PointLoadType Properties
  Parameter Property
  PointLoadTypeSet Class
  PointLoadTypeSet Members
  PointLoadTypeSet Constructor
  PointLoadTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  PointLoadTypeSet Properties
  IsEmpty Property
  Size Property
  PointLoadTypeSetIterator Class
  PointLoadTypeSetIterator Members
  PointLoadTypeSetIterator Constructor
  PointLoadTypeSetIterator Methods
  MoveNext Method
  Reset Method
  PointLoadTypeSetIterator Properties
  Current Property
  PositionOnCurve Enumeration
  Rebar Class
  Rebar Members
  Rebar Methods
  CanApplyPresentationMode Method
  CanUseHookType Method
  ClearPresentationMode Method
  ComputeDrivingCurves Method
  ConstraintsCanBeEdited Method
  ContainsValidArcRadiiForStyleAndBarType Method
  CreateFromCurves Method
  CreateFromCurvesAndShape Method
  CreateFromRebarShape Method
  DoesBarExistAtPosition Method
  FindMatchingPredefinedPresentationMode Method
  GetBarPositionTransform Method
  GetBendData Method
  GetCenterlineCurves Method
  GetCenterlineCurves Method (Boolean, Boolean, Boolean)
  GetCenterlineCurves Method (Boolean, Boolean, Boolean, MultiplanarOption)
  GetDistributionPath Method
  GetHookOrientation Method
  GetHookTypeId Method
  GetHostId Method
  GetPresentationMode Method
  GetRebarConstraintsManager Method
  GetReinforcementRoundingManager Method
  HasPresentationOverrides Method
  HookAngleMatchesRebarShapeDefinition Method
  IsBarHidden Method
  IsRebarInSection Method
  IsSolidInView Method
  IsUnobscuredInView Method
  RebarShapeMatchesCurvesAndHooks Method
  ScaleToBox Method
  ScaleToBoxFor3D Method
  SetBarHiddenStatus Method
  SetHookOrientation Method
  SetHookTypeId Method
  SetHostId Method
  SetLayoutAsFixedNumber Method
  SetLayoutAsMaximumSpacing Method
  SetLayoutAsMinimumClearSpacing Method
  SetLayoutAsNumberWithSpacing Method
  SetLayoutAsSingle Method
  SetPresentationMode Method
  SetSolidInView Method
  SetUnobscuredInView Method
  Rebar Properties
  ArrayLength Property
  BarsOnNormalSide Property
  BaseFinishingTurns Property
  Height Property
  IncludeFirstBar Property
  IncludeLastBar Property
  LayoutRule Property
  MaxSpacing Property
  MultiplanarDepth Property
  Normal Property
  NumberOfBarPositions Property
  Parameter Property
  Pitch Property
  Quantity Property
  RebarShapeId Property
  ScheduleMark Property
  TopFinishingTurns Property
  TotalLength Property
  Volume Property
  RebarBarType Class
  RebarBarType Members
  RebarBarType Methods
  Create Method
  CreateDefaultRebarBarType Method
  GetAutoCalcHookLengths Method
  GetHookLength Method
  GetHookOffsetLength Method
  GetHookPermission Method
  GetHookTangentLength Method
  GetReinforcementRoundingManager Method
  SetAutoCalcHookLengths Method
  SetHookLength Method
  SetHookOffsetLength Method
  SetHookPermission Method
  SetHookTangentLength Method
  RebarBarType Properties
  BarDiameter Property
  DeformationType Property
  MaximumBendRadius Property
  Parameter Property
  StandardBendDiameter Property
  StandardHookBendDiameter Property
  StirrupTieBendDiameter Property
  RebarBarTypeSet Class
  RebarBarTypeSet Members
  RebarBarTypeSet Constructor
  RebarBarTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  RebarBarTypeSet Properties
  IsEmpty Property
  Size Property
  RebarBarTypeSetIterator Class
  RebarBarTypeSetIterator Members
  RebarBarTypeSetIterator Constructor
  RebarBarTypeSetIterator Methods
  MoveNext Method
  Reset Method
  RebarBarTypeSetIterator Properties
  Current Property
  RebarBendData Class
  RebarBendData Members
  RebarBendData Constructor
  RebarBendData Constructor
  RebarBendData Constructor (RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation)
  RebarBendData Methods
  Dispose Method
  RebarBendData Properties
  BarDiameter Property
  BendRadius Property
  HookAngle0 Property
  HookAngle1 Property
  HookBendRadius Property
  HookLength0 Property
  HookLength1 Property
  HookOrient0 Property
  HookOrient1 Property
  IsValidObject Property
  RebarConstrainedHandle Class
  RebarConstrainedHandle Members
  RebarConstrainedHandle Methods
  Dispose Method
  GetEdgeNumber Method
  GetHandleType Method
  IsEdgeHandle Method
  IsValid Method
  RebarConstrainedHandle Properties
  IsValidObject Property
  RebarConstraint Class
  RebarConstraint Members
  RebarConstraint Methods
  Dispose Method
  GetConstraintType Method
  GetDistanceToTargetHostFace Method
  GetRebarConstraintTargetHostFaceType Method
  GetTargetElement Method
  GetTargetHostFaceReference Method
  GetTargetRebarAngleOnBarOrHookBend Method
  GetTargetRebarBendNumber Method
  GetTargetRebarConstraintType Method
  GetTargetRebarEdgeNumber Method
  GetTargetRebarHookBarEnd Method
  HasAnEdgeNumber Method
  IsEqual Method
  IsFixedDistanceToHostFace Method
  IsToCover Method
  IsToHostFaceOrCover Method
  IsToOtherRebar Method
  IsValid Method
  SetDistanceToTargetHostFace Method
  TargetIsBarBend Method
  TargetIsHookBend Method
  TargetRebarConstraintTypeIsEdge Method
  RebarConstraint Properties
  IsValidObject Property
  RebarConstraintsManager Class
  RebarConstraintsManager Members
  RebarConstraintsManager Methods
  ClearHandleConstraintPairHighlighting Method
  Dispose Method
  GetAllConstrainedHandles Method
  GetConstraintCandidatesForHandle Method
  GetCurrentConstraintOnHandle Method
  GetPreferredConstraintOnHandle Method
  HasValidRebar Method
  HighlightHandleConstraintPairInAllViews Method
  RemovePreferredConstraintFromHandle Method
  SetPreferredConstraintForHandle Method
  RebarConstraintsManager Properties
  IsValidObject Property
  RebarConstraintTargetHostFaceType Enumeration
  RebarConstraintType Enumeration
  RebarCoverType Class
  RebarCoverType Members
  RebarCoverType Methods
  Create Method
  RebarCoverType Properties
  CoverDistance Property
  Parameter Property
  RebarCoverTypeSet Class
  RebarCoverTypeSet Members
  RebarCoverTypeSet Constructor
  RebarCoverTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  RebarCoverTypeSet Properties
  IsEmpty Property
  Size Property
  RebarCoverTypeSetIterator Class
  RebarCoverTypeSetIterator Members
  RebarCoverTypeSetIterator Constructor
  RebarCoverTypeSetIterator Methods
  MoveNext Method
  Reset Method
  RebarCoverTypeSetIterator Properties
  Current Property
  RebarDeformationType Enumeration
  RebarHandleType Enumeration
  RebarHookOrientation Enumeration
  RebarHookType Class
  RebarHookType Members
  RebarHookType Methods
  Create Method
  CreateDefaultRebarHookType Method
  GetDefaultHookExtension Method
  GetDefaultHookLength Method
  GetHookExtensionLength Method
  IsOffsetLengthRequired Method
  RebarHookType Properties
  HookAngle Property
  Parameter Property
  StraightLineMultiplier Property
  Style Property
  RebarHookTypeSet Class
  RebarHookTypeSet Members
  RebarHookTypeSet Constructor
  RebarHookTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  RebarHookTypeSet Properties
  IsEmpty Property
  Size Property
  RebarHookTypeSetIterator Class
  RebarHookTypeSetIterator Members
  RebarHookTypeSetIterator Constructor
  RebarHookTypeSetIterator Methods
  MoveNext Method
  Reset Method
  RebarHookTypeSetIterator Properties
  Current Property
  RebarHostCategory Enumeration
  RebarHostData Class
  RebarHostData Members
  RebarHostData Methods
  Dispose Method
  GetAreaReinforcementsInHost Method
  GetCommonCoverType Method
  GetCoverType Method
  GetExposedFaces Method
  GetFabricAreasInHost Method
  GetFabricSheetsInHost Method
  GetPathReinforcementsInHost Method
  GetRebarHostData Method
  GetRebarsInHost Method
  IsFaceExposed Method
  IsValidHost Method
  IsValidHost Method
  IsValidHost Method (Element)
  SetCommonCoverType Method
  SetCoverType Method
  RebarHostData Properties
  IsValidObject Property
  RebarInSystem Class
  RebarInSystem Members
  RebarInSystem Methods
  CanApplyPresentationMode Method
  ClearPresentationMode Method
  DoesBarExistAtPosition Method
  FindMatchingPredefinedPresentationMode Method
  GetBarPositionTransform Method
  GetBendData Method
  GetCenterlineCurves Method
  GetDistributionPath Method
  GetHookTypeId Method
  GetHostId Method
  GetPresentationMode Method
  GetReinforcementRoundingManager Method
  HasPresentationOverrides Method
  IsBarHidden Method
  IsRebarInSection Method
  IsSolidInView Method
  IsUnobscuredInView Method
  SetBarHiddenStatus Method
  SetPresentationMode Method
  SetSolidInView Method
  SetUnobscuredInView Method
  RebarInSystem Properties
  ArrayLength Property
  BarsOnNormalSide Property
  LayoutRule Property
  MaxSpacing Property
  Normal Property
  NumberOfBarPositions Property
  Parameter Property
  Quantity Property
  RebarShapeId Property
  ScheduleMark Property
  SystemId Property
  TotalLength Property
  Volume Property
  RebarLayoutRule Enumeration
  RebarPresentationMode Enumeration
  RebarRoundingManager Class
  RebarRoundingManager Members
  RebarRoundingManager Methods
  RebarRoundingManager Properties
  ApplicableReinforcementRoundingSource Property
  ApplicableSegmentLengthRounding Property
  ApplicableTotalLengthRounding Property
  SegmentLengthRounding Property
  TotalLengthRounding Property
  RebarShape Class
  RebarShape Members
  RebarShape Methods
  Create Method
  GetAllowed Method
  GetCurvesForBrowser Method
  GetDefaultHookAngle Method
  GetDefaultHookOrientation Method
  GetMultiplanarDefinition Method
  GetRebarShapeDefinition Method
  IsSameShapeIgnoringHooks Method
  SetAllowed Method
  RebarShape Properties
  HigherEnd Property
  Parameter Property
  RebarStyle Property
  ShapeFamilyId Property
  SimpleArc Property
  SimpleLine Property
  StirrupTieAttachment Property
  RebarShapeArcReferenceType Enumeration
  RebarShapeBendAngle Enumeration
  RebarShapeConstraint Class
  RebarShapeConstraint Members
  RebarShapeConstraint Methods
  Dispose Method
  GetParamId Method
  RebarShapeConstraint Properties
  IsValidObject Property
  RebarShapeConstraint180DegreeBendArcLength Class
  RebarShapeConstraint180DegreeBendArcLength Members
  RebarShapeConstraint180DegreeBendArcLength Constructor
  RebarShapeConstraint180DegreeBendArcLength Methods
  RebarShapeConstraint180DegreeBendArcLength Properties
  RebarShapeConstraint180DegreeBendRadius Class
  RebarShapeConstraint180DegreeBendRadius Members
  RebarShapeConstraint180DegreeBendRadius Constructor
  RebarShapeConstraint180DegreeBendRadius Methods
  RebarShapeConstraint180DegreeBendRadius Properties
  ArcReferenceType Property
  RebarShapeConstraint180DegreeDefaultBend Class
  RebarShapeConstraint180DegreeDefaultBend Members
  RebarShapeConstraint180DegreeDefaultBend Constructor
  RebarShapeConstraint180DegreeDefaultBend Methods
  RebarShapeConstraint180DegreeDefaultBend Properties
  RebarShapeConstraintAngleFromFixedDir Class
  RebarShapeConstraintAngleFromFixedDir Members
  RebarShapeConstraintAngleFromFixedDir Constructor
  RebarShapeConstraintAngleFromFixedDir Methods
  RebarShapeConstraintAngleFromFixedDir Properties
  Direction Property
  Sign Property
  RebarShapeConstraintArcLength Class
  RebarShapeConstraintArcLength Members
  RebarShapeConstraintArcLength Constructor
  RebarShapeConstraintArcLength Methods
  RebarShapeConstraintArcLength Properties
  RebarShapeConstraintChordLength Class
  RebarShapeConstraintChordLength Members
  RebarShapeConstraintChordLength Constructor
  RebarShapeConstraintChordLength Methods
  RebarShapeConstraintChordLength Properties
  RebarShapeConstraintCircumference Class
  RebarShapeConstraintCircumference Members
  RebarShapeConstraintCircumference Constructor
  RebarShapeConstraintCircumference Methods
  RebarShapeConstraintCircumference Properties
  ArcReferenceType Property
  RebarShapeConstraintDiameter Class
  RebarShapeConstraintDiameter Members
  RebarShapeConstraintDiameter Constructor
  RebarShapeConstraintDiameter Methods
  RebarShapeConstraintDiameter Properties
  ArcReferenceType Property
  RebarShapeConstraintFixedSegmentDir Class
  RebarShapeConstraintFixedSegmentDir Members
  RebarShapeConstraintFixedSegmentDir Constructor
  RebarShapeConstraintFixedSegmentDir Methods
  RebarShapeConstraintFixedSegmentDir Properties
  Direction Property
  RebarShapeConstraintProjectedSegmentLength Class
  RebarShapeConstraintProjectedSegmentLength Members
  RebarShapeConstraintProjectedSegmentLength Constructor
  RebarShapeConstraintProjectedSegmentLength Methods
  GetSegmentEndReferenceType Method
  RebarShapeConstraintProjectedSegmentLength Properties
  Direction Property
  TripleProductSign Property
  RebarShapeConstraintRadius Class
  RebarShapeConstraintRadius Members
  RebarShapeConstraintRadius Constructor
  RebarShapeConstraintRadius Methods
  RebarShapeConstraintRadius Properties
  ArcReferenceType Property
  RebarShapeConstraintSagittaLength Class
  RebarShapeConstraintSagittaLength Members
  RebarShapeConstraintSagittaLength Constructor
  RebarShapeConstraintSagittaLength Methods
  RebarShapeConstraintSagittaLength Properties
  RebarShapeConstraintSegmentLength Class
  RebarShapeConstraintSegmentLength Members
  RebarShapeConstraintSegmentLength Constructor
  RebarShapeConstraintSegmentLength Methods
  GetSegmentEndReferenceType Method
  RebarShapeConstraintSegmentLength Properties
  RebarShapeDefinition Class
  RebarShapeDefinition Members
  RebarShapeDefinition Methods
  AddFormulaParameter Method
  AddParameter Method
  CheckDefaultParameterValues Method
  Dispose Method
  GetParameterDefaultValue Method
  GetParameterFormula Method
  GetParameters Method
  HasParameter Method
  RemoveParameter Method
  SetParameterDefaultValue Method
  SetParameterFormula Method
  RebarShapeDefinition Properties
  Complete Property
  IsPlanar Property
  IsValidObject Property
  RebarShapeDefinitionByArc Class
  RebarShapeDefinitionByArc Members
  RebarShapeDefinitionByArc Constructor
  RebarShapeDefinitionByArc Constructor (Document, RebarShapeDefinitionByArcType)
  RebarShapeDefinitionByArc Constructor (Document, Double, Double, Int32, Int32)
  RebarShapeDefinitionByArc Methods
  AddConstraintArcLength Method
  AddConstraintChordLength Method
  AddConstraintCircumference Method
  AddConstraintDiameter Method
  AddConstraintRadius Method
  AddConstraintSagittaLength Method
  GetConstraints Method
  SetArcTypeSpiral Method
  SetConstraints Method
  RebarShapeDefinitionByArc Properties
  Type Property
  RebarShapeDefinitionByArcType Enumeration
  RebarShapeDefinitionBySegments Class
  RebarShapeDefinitionBySegments Members
  RebarShapeDefinitionBySegments Constructor
  RebarShapeDefinitionBySegments Methods
  AddBendDefaultRadius Method
  AddBendVariableRadius Method
  AddConstraintParallelToSegment Method
  AddConstraintToSegment Method
  AddListeningDimensionBendToBend Method
  AddListeningDimensionSegmentToBend Method
  AddListeningDimensionSegmentToSegment Method
  GetSegment Method
  GetVertex Method
  RemoveParameterFromSegment Method
  SetSegmentAs180DegreeBend Method
  SetSegmentAs180DegreeBend Method (Int32)
  SetSegmentAs180DegreeBend Method (Int32, ElementId, Boolean)
  SetSegmentFixedDirection Method
  SetSegmentVariableDirection Method
  RebarShapeDefinitionBySegments Properties
  MajorSegmentIndex Property
  NumberOfSegments Property
  NumberOfVertices Property
  RebarShapeMultiplanarDefinition Class
  RebarShapeMultiplanarDefinition Members
  RebarShapeMultiplanarDefinition Constructor
  RebarShapeMultiplanarDefinition Methods
  Dispose Method
  SetPresenceOfSegments Method
  RebarShapeMultiplanarDefinition Properties
  DepthParamId Property
  IsDuplicateShapePresent Property
  IsEndConnectorPresent Property
  IsStartConnectorPresent Property
  IsValidObject Property
  OutOfPlaneBendDiameter Property
  RebarShapeParameters Class
  RebarShapeParameters Members
  RebarShapeParameters Methods
  Dispose Method
  GetAllRebarShapeParameters Method
  GetElementIdForExternalDefinition Method
  GetExternalDefinitionForElementId Method
  GetOrCreateElementIdForExternalDefinition Method
  IsValidExternalDefinition Method
  RebarShapeParameters Properties
  IsValidObject Property
  RebarShapeSegment Class
  RebarShapeSegment Members
  RebarShapeSegment Methods
  Dispose Method
  GetConstraints Method
  SetConstraints Method
  RebarShapeSegment Properties
  IsValidObject Property
  RebarShapeSegmentEndReferenceType Enumeration
  RebarShapeSet Class
  RebarShapeSet Members
  RebarShapeSet Constructor
  RebarShapeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  RebarShapeSet Properties
  IsEmpty Property
  Size Property
  RebarShapeSetIterator Class
  RebarShapeSetIterator Members
  RebarShapeSetIterator Constructor
  RebarShapeSetIterator Methods
  MoveNext Method
  Reset Method
  RebarShapeSetIterator Properties
  Current Property
  RebarShapeVertex Class
  RebarShapeVertex Members
  RebarShapeVertex Methods
  Dispose Method
  GetConstraints Method
  SetConstraints Method
  RebarShapeVertex Properties
  BendAngle Property
  IsValidObject Property
  Turn Property
  RebarShapeVertexTurn Enumeration
  RebarStyle Enumeration
  RebarSystemSpanSymbol Class
  RebarSystemSpanSymbol Members
  RebarSystemSpanSymbol Methods
  Create Method
  RebarSystemSpanSymbol Properties
  Parameter Property
  ReinforcementRoundingManager Class
  ReinforcementRoundingManager Members
  ReinforcementRoundingManager Methods
  Dispose Method
  ReinforcementRoundingManager Properties
  Element Property
  IsActiveOnElement Property
  IsValidObject Property
  LengthDisplayUnit Property
  ReinforcementRoundingSource Enumeration
  ReinforcementSettings Class
  ReinforcementSettings Members
  ReinforcementSettings Methods
  DocumentContainsNoAreaOrPathReinforcement Method
  DocumentContainsNoRebar Method
  GetFabricRoundingManager Method
  GetRebarRoundingManager Method
  GetReinforcementSettings Method
  IsEqual Method
  ReinforcementSettings Properties
  HostStructuralRebar Property
  Parameter Property
  RebarPresentationInSection Property
  RebarPresentationInView Property
  RebarShapeDefinesHooks Property
  SlabFoundationType Enumeration
  StickElementExtension Enumeration
  StickElementProjectionY Enumeration
  StickElementProjectionZ Enumeration
  StirrupTieAttachmentType Enumeration
  StructuralConnectionApplyTo Enumeration
  StructuralConnectionType Class
  StructuralConnectionType Members
  StructuralConnectionType Methods
  Create Method
  GetAllStructuralConnectionTypeIds Method
  GetFamilySymbolId Method
  SetFamilySymbolId Method
  ValidFamilySymbolId Method
  StructuralConnectionType Properties
  ApplyTo Property
  Parameter Property
  StructuralFramingUtils Class
  StructuralFramingUtils Members
  StructuralFramingUtils Methods
  AllowJoinAtEnd Method
  CanSetEndReference Method
  DisallowJoinAtEnd Method
  GetEndReference Method
  IsEndReferenceValid Method
  IsJoinAllowedAtEnd Method
  RemoveEndReference Method
  SetEndReference Method
  StructuralInstanceUsage Enumeration
  StructuralInstanceUsageFilter Class
  StructuralInstanceUsageFilter Members
  StructuralInstanceUsageFilter Constructor
  StructuralInstanceUsageFilter Constructor (StructuralInstanceUsage)
  StructuralInstanceUsageFilter Constructor (StructuralInstanceUsage, Boolean)
  StructuralInstanceUsageFilter Methods
  PassesFilter Method
  StructuralInstanceUsageFilter Properties
  StructuralUsage Property
  StructuralMaterialType Enumeration
  StructuralMaterialTypeFilter Class
  StructuralMaterialTypeFilter Members
  StructuralMaterialTypeFilter Constructor
  StructuralMaterialTypeFilter Constructor (StructuralMaterialType)
  StructuralMaterialTypeFilter Constructor (StructuralMaterialType, Boolean)
  StructuralMaterialTypeFilter Methods
  PassesFilter Method
  StructuralMaterialTypeFilter Properties
  StructuralMaterialType Property
  StructuralSectionsServiceData Class
  StructuralSectionsServiceData Members
  StructuralSectionsServiceData Constructor
  StructuralSectionsServiceData Methods
  Dispose Method
  GetCurrentElements Method
  StructuralSectionsServiceData Properties
  Document Property
  IsValidObject Property
  StructuralSettings Class
  StructuralSettings Members
  StructuralSettings Methods
  GetStructuralSettings Method
  StructuralSettings Properties
  AnalyticalLinkAutofixTolerance Property
  AnalyticalModelAutoCheckConsistency Property
  AnalyticalModelAutoCheckMemberSupports Property
  AnalyticalModelCheckAdjustment Property
  AnalyticalModelCheckBeamSlabDistance Property
  AnalyticalModelCheckCircularReferences Property
  AnalyticalModelCheckDiscrepancy Property
  AnalyticalModelCheckInstability Property
  AnalyticalModelCheckSupportDistance Property
  AnalyticalModelDiscrepancyTolerance Property
  AnalyticalModelHorizontalAutofixTolerance Property
  AnalyticalModelSupportDistanceTolerance Property
  AnalyticalModelVerticalAutofixTolerance Property
  BoundaryConditionAreaAndLineSymbolSpacing Property
  BoundaryConditionFamilySymbolFixed Property
  BoundaryConditionFamilySymbolPinned Property
  BoundaryConditionFamilySymbolRoller Property
  BoundaryConditionFamilySymbolUserDefined Property
  BraceAboveSymbol Property
  BraceBelowSymbol Property
  BraceParallelLineOffset Property
  CheckAnalyticalModelAsset Property
  DifferentiateAnalyticalEnds Property
  KickerBraceSymbol Property
  Parameter Property
  ShowBraceAbove Property
  ShowBraceBelow Property
  SymbolicCutbackForBeamAndTruss Property
  SymbolicCutbackForBrace Property
  SymbolicCutbackForColumn Property
  StructuralType Enumeration
  StructuralWallUsage Enumeration
  StructuralWallUsageFilter Class
  StructuralWallUsageFilter Members
  StructuralWallUsageFilter Constructor
  StructuralWallUsageFilter Constructor (StructuralWallUsage)
  StructuralWallUsageFilter Constructor (StructuralWallUsage, Boolean)
  StructuralWallUsageFilter Methods
  PassesFilter Method
  StructuralWallUsageFilter Properties
  StructuralWallUsage Property
  SurfaceElementExtension Enumeration
  SurfaceElementProjectionZ Enumeration
  TargetRebarConstraintType Enumeration
  TranslationRotationValue Enumeration
  Truss Class
  Truss Members
  Truss Methods
  AttachChord Method
  Create Method
  DetachChord Method
  DropTruss Method
  GetTrussMemberInfo Method
  RemoveProfile Method
  SetProfile Method
  TogglePinMember Method
  Truss Properties
  Curves Property
  Members Property
  Parameter Property
  TrussType Property
  TrussChordLocation Enumeration
  TrussCurveType Enumeration
  TrussMemberInfo Class
  TrussMemberInfo Members
  TrussMemberInfo Constructor
  TrussMemberInfo Methods
  TrussMemberInfo Properties
  hostTrussId Property
  lockedToTruss Property
  memberTypeKey Property
  TrussMemberType Enumeration
  TrussType Class
  TrussType Members
  TrussType Methods
  TrussType Properties
  Parameter Property
  TrussTypeSet Class
  TrussTypeSet Members
  TrussTypeSet Constructor
  TrussTypeSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  TrussTypeSet Properties
  IsEmpty Property
  Size Property
  TrussTypeSetIterator Class
  TrussTypeSetIterator Members
  TrussTypeSetIterator Constructor
  TrussTypeSetIterator Methods
  MoveNext Method
  Reset Method
  TrussTypeSetIterator Properties
  Current Property
  WireDistributionDirection Enumeration
  YJustification Enumeration
  YZJustificationOption Enumeration
  ZJustification Enumeration
  Autodesk.Revit.DB.Structure.StructuralSections Namespace
  StructuralSection Class
  StructuralSection Members
  StructuralSection Methods
  Dispose Method
  StructuralSection Properties
  IsValidObject Property
  StructuralSectionShape Property
  StructuralSectionShapeName Property
  StructuralSectionCParallelFlange Class
  StructuralSectionCParallelFlange Members
  StructuralSectionCParallelFlange Methods
  StructuralSectionCParallelFlange Properties
  StructuralSectionCSlopedFlange Class
  StructuralSectionCSlopedFlange Members
  StructuralSectionCSlopedFlange Methods
  StructuralSectionCSlopedFlange Properties
  FlangeFillet Property
  StructuralSectionHotRolled Class
  StructuralSectionHotRolled Members
  StructuralSectionHotRolled Methods
  StructuralSectionHotRolled Properties
  FlangeThickness Property
  WebFillet Property
  WebThickness Property
  StructuralSectionIParallelFlange Class
  StructuralSectionIParallelFlange Members
  StructuralSectionIParallelFlange Methods
  StructuralSectionIParallelFlange Properties
  StructuralSectionISlopedFlange Class
  StructuralSectionISlopedFlange Members
  StructuralSectionISlopedFlange Methods
  StructuralSectionISlopedFlange Properties
  FlangeFillet Property
  StructuralSectionISplitParallelFlange Class
  StructuralSectionISplitParallelFlange Members
  StructuralSectionISplitParallelFlange Methods
  StructuralSectionISplitParallelFlange Properties
  StructuralSectionISplitSlopedFlange Class
  StructuralSectionISplitSlopedFlange Members
  StructuralSectionISplitSlopedFlange Methods
  StructuralSectionISplitSlopedFlange Properties
  FlangeFillet Property
  StructuralSectionIWelded Class
  StructuralSectionIWelded Members
  StructuralSectionIWelded Methods
  StructuralSectionIWelded Properties
  BottomFlangeThickness Property
  BottomFlangeWidth Property
  TopFlangeThickness Property
  TopFlangeWidth Property
  WebHeight Property
  WebThickness Property
  StructuralSectionIWideFlange Class
  StructuralSectionIWideFlange Members
  StructuralSectionIWideFlange Methods
  StructuralSectionIWideFlange Properties
  StructuralSectionLAngle Class
  StructuralSectionLAngle Members
  StructuralSectionLAngle Methods
  StructuralSectionLAngle Properties
  FlangeFillet Property
  StructuralSectionPipeStandard Class
  StructuralSectionPipeStandard Members
  StructuralSectionPipeStandard Constructor
  StructuralSectionPipeStandard Methods
  StructuralSectionPipeStandard Properties
  WallDesignThickness Property
  WallNominalThickness Property
  StructuralSectionRectangleHSS Class
  StructuralSectionRectangleHSS Members
  StructuralSectionRectangleHSS Methods
  StructuralSectionRectangleHSS Properties
  InnerFillet Property
  OuterFillet Property
  WallDesignThickness Property
  WallNominalThickness Property
  StructuralSectionRectangleParameterized Class
  StructuralSectionRectangleParameterized Members
  StructuralSectionRectangleParameterized Methods
  StructuralSectionRectangleParameterized Properties
  StructuralSectionRectangular Class
  StructuralSectionRectangular Members
  StructuralSectionRectangular Methods
  StructuralSectionRectangular Properties
  CentroidHorizontal Property
  CentroidVertical Property
  ElasticModulusStrongAxis Property
  ElasticModulusWeakAxis Property
  Height Property
  MomentOfInertiaStrongAxis Property
  MomentOfInertiaWeakAxis Property
  NominalWeight Property
  Perimeter Property
  PlasticModulusStrongAxis Property
  PlasticModulusWeakAxis Property
  PrincipalAxesAngle Property
  SectionArea Property
  ShearAreaStrongAxis Property
  ShearAreaWeakAxis Property
  TorsionalModulus Property
  TorsionalMomentOfInertia Property
  WarpingConstant Property
  Width Property
  StructuralSectionRectangularBar Class
  StructuralSectionRectangularBar Members
  StructuralSectionRectangularBar Methods
  StructuralSectionRectangularBar Properties
  StructuralSectionRound Class
  StructuralSectionRound Members
  StructuralSectionRound Methods
  StructuralSectionRound Properties
  CentroidHorizontal Property
  CentroidVertical Property
  Diameter Property
  ElasticModulusStrongAxis Property
  ElasticModulusWeakAxis Property
  MomentOfInertiaStrongAxis Property
  MomentOfInertiaWeakAxis Property
  NominalWeight Property
  Perimeter Property
  PlasticModulusStrongAxis Property
  PlasticModulusWeakAxis Property
  PrincipalAxesAngle Property
  SectionArea Property
  ShearAreaStrongAxis Property
  ShearAreaWeakAxis Property
  TorsionalModulus Property
  TorsionalMomentOfInertia Property
  WarpingConstant Property
  StructuralSectionRoundBar Class
  StructuralSectionRoundBar Members
  StructuralSectionRoundBar Methods
  StructuralSectionRoundBar Properties
  StructuralSectionRoundHSS Class
  StructuralSectionRoundHSS Members
  StructuralSectionRoundHSS Constructor
  StructuralSectionRoundHSS Methods
  StructuralSectionRoundHSS Properties
  WallDesignThickness Property
  WallNominalThickness Property
  StructuralSectionShape Enumeration
  StructuralSectionStructuralTees Class
  StructuralSectionStructuralTees Members
  StructuralSectionStructuralTees Methods
  StructuralSectionStructuralTees Properties
  FlangeFillet Property
  Autodesk.Revit.Exceptions Namespace
  ApplicationException Class
  ApplicationException Members
  ApplicationException Methods
  GetObjectData Method
  ApplicationException Properties
  FunctionId Property
  ArgumentException Class
  ArgumentException Members
  ArgumentException Methods
  GetObjectData Method
  ArgumentException Properties
  Message Property
  ParamName Property
  ArgumentNullException Class
  ArgumentNullException Members
  ArgumentNullException Methods
  GetObjectData Method
  ArgumentNullException Properties
  ArgumentOutOfRangeException Class
  ArgumentOutOfRangeException Members
  ArgumentOutOfRangeException Methods
  GetObjectData Method
  ArgumentOutOfRangeException Properties
  ArgumentsInconsistentException Class
  ArgumentsInconsistentException Members
  ArgumentsInconsistentException Methods
  GetObjectData Method
  ArgumentsInconsistentException Properties
  AutoJoinFailedException Class
  AutoJoinFailedException Members
  AutoJoinFailedException Methods
  GetObjectData Method
  AutoJoinFailedException Properties
  CannotOpenBothCentralAndLocalException Class
  CannotOpenBothCentralAndLocalException Members
  CannotOpenBothCentralAndLocalException Methods
  GetObjectData Method
  CannotOpenBothCentralAndLocalException Properties
  CentralFileCommunicationException Class
  CentralFileCommunicationException Members
  CentralFileCommunicationException Methods
  GetObjectData Method
  CentralFileCommunicationException Properties
  CentralModelAccessDeniedException Class
  CentralModelAccessDeniedException Members
  CentralModelAccessDeniedException Methods
  GetObjectData Method
  CentralModelAccessDeniedException Properties
  CentralModelAlreadyExistsException Class
  CentralModelAlreadyExistsException Members
  CentralModelAlreadyExistsException Methods
  GetObjectData Method
  CentralModelAlreadyExistsException Properties
  CentralModelContentionException Class
  CentralModelContentionException Members
  CentralModelContentionException Methods
  GetObjectData Method
  CentralModelContentionException Properties
  CentralModelException Class
  CentralModelException Members
  CentralModelException Methods
  GetObjectData Method
  CentralModelException Properties
  CorruptModelException Class
  CorruptModelException Members
  CorruptModelException Methods
  GetObjectData Method
  CorruptModelException Properties
  DirectoryNotFoundException Class
  DirectoryNotFoundException Members
  DirectoryNotFoundException Methods
  GetObjectData Method
  DirectoryNotFoundException Properties
  DisabledDisciplineException Class
  DisabledDisciplineException Members
  DisabledDisciplineException Methods
  GetObjectData Method
  DisabledDisciplineException Properties
  ExternalApplicationException Class
  ExternalApplicationException Members
  ExternalApplicationException Methods
  GetObjectData Method
  ExternalApplicationException Properties
  FamilyContextException Class
  FamilyContextException Members
  FamilyContextException Methods
  GetObjectData Method
  FamilyContextException Properties
  FileAccessException Class
  FileAccessException Members
  FileAccessException Methods
  GetObjectData Method
  FileAccessException Properties
  FileArgumentAlreadyExistsException Class
  FileArgumentAlreadyExistsException Members
  FileArgumentAlreadyExistsException Methods
  GetObjectData Method
  FileArgumentAlreadyExistsException Properties
  FileArgumentNotFoundException Class
  FileArgumentNotFoundException Members
  FileArgumentNotFoundException Methods
  GetObjectData Method
  FileArgumentNotFoundException Properties
  FileNotFoundException Class
  FileNotFoundException Members
  FileNotFoundException Methods
  GetObjectData Method
  FileNotFoundException Properties
  ForbiddenForDynamicUpdateException Class
  ForbiddenForDynamicUpdateException Members
  ForbiddenForDynamicUpdateException Methods
  GetObjectData Method
  ForbiddenForDynamicUpdateException Properties
  FunctionId Class
  FunctionId Members
  FunctionId Methods
  GetObjectData Method
  FunctionId Properties
  File Property
  Function Property
  Line Property
  InapplicableDataException Class
  InapplicableDataException Members
  InapplicableDataException Methods
  GetObjectData Method
  InapplicableDataException Properties
  InsufficientResourcesException Class
  InsufficientResourcesException Members
  InsufficientResourcesException Methods
  GetObjectData Method
  InsufficientResourcesException Properties
  InternalException Class
  InternalException Members
  InternalException Methods
  GetObjectData Method
  InternalException Properties
  InvalidDataStreamException Class
  InvalidDataStreamException Members
  InvalidDataStreamException Methods
  GetObjectData Method
  InvalidDataStreamException Properties
  InvalidObjectException Class
  InvalidObjectException Members
  InvalidObjectException Methods
  GetObjectData Method
  InvalidObjectException Properties
  InvalidOperationException Class
  InvalidOperationException Members
  InvalidOperationException Methods
  GetObjectData Method
  InvalidOperationException Properties
  InvalidPathArgumentException Class
  InvalidPathArgumentException Members
  InvalidPathArgumentException Methods
  GetObjectData Method
  InvalidPathArgumentException Properties
  IOException Class
  IOException Members
  IOException Methods
  GetObjectData Method
  IOException Properties
  ModificationForbiddenException Class
  ModificationForbiddenException Members
  ModificationForbiddenException Methods
  GetObjectData Method
  ModificationForbiddenException Properties
  ModificationOutsideTransactionException Class
  ModificationOutsideTransactionException Members
  ModificationOutsideTransactionException Methods
  GetObjectData Method
  ModificationOutsideTransactionException Properties
  NotTransmittedModelException Class
  NotTransmittedModelException Members
  NotTransmittedModelException Methods
  GetObjectData Method
  NotTransmittedModelException Properties
  ObjectAccessException Class
  ObjectAccessException Members
  ObjectAccessException Methods
  GetObjectData Method
  ObjectAccessException Properties
  OperationCanceledException Class
  OperationCanceledException Members
  OperationCanceledException Methods
  GetObjectData Method
  OperationCanceledException Properties
  OptionalFunctionalityNotAvailableException Class
  OptionalFunctionalityNotAvailableException Members
  OptionalFunctionalityNotAvailableException Methods
  GetObjectData Method
  OptionalFunctionalityNotAvailableException Properties
  OutdatedDirectlyOpenedCentralException Class
  OutdatedDirectlyOpenedCentralException Members
  OutdatedDirectlyOpenedCentralException Methods
  GetObjectData Method
  OutdatedDirectlyOpenedCentralException Properties
  RegenerationFailedException Class
  RegenerationFailedException Members
  RegenerationFailedException Methods
  GetObjectData Method
  RegenerationFailedException Properties
  RevitServerCommunicationException Class
  RevitServerCommunicationException Members
  RevitServerCommunicationException Methods
  GetObjectData Method
  RevitServerCommunicationException Properties
  RevitServerException Class
  RevitServerException Members
  RevitServerException Methods
  GetObjectData Method
  RevitServerException Properties
  RevitServerInternalException Class
  RevitServerInternalException Members
  RevitServerInternalException Methods
  GetObjectData Method
  RevitServerInternalException Properties
  RevitServerUnauthenticatedUserException Class
  RevitServerUnauthenticatedUserException Members
  RevitServerUnauthenticatedUserException Methods
  GetObjectData Method
  RevitServerUnauthenticatedUserException Properties
  RevitServerUnauthorizedException Class
  RevitServerUnauthorizedException Members
  RevitServerUnauthorizedException Methods
  GetObjectData Method
  RevitServerUnauthorizedException Properties
  TransmittedModelException Class
  TransmittedModelException Members
  TransmittedModelException Methods
  GetObjectData Method
  TransmittedModelException Properties
  WrongUserException Class
  WrongUserException Members
  WrongUserException Methods
  GetObjectData Method
  WrongUserException Properties
  Autodesk.Revit.UI Namespace
  AddInCommandBinding Class
  AddInCommandBinding Members
  AddInCommandBinding Methods
  AddInCommandBinding Properties
  RevitCommandId Property
  AddInCommandBinding Events
  BeforeExecuted Event
  CanExecute Event
  Executed Event
  ButtonData Class
  ButtonData Members
  ButtonData Methods
  ButtonData Properties
  Image Property
  LargeImage Property
  Text Property
  ComboBox Class
  ComboBox Members
  ComboBox Methods
  AddItem Method
  AddItems Method
  AddSeparator Method
  GetItems Method
  ComboBox Properties
  Current Property
  Image Property
  ComboBox Events
  CurrentChanged Event
  DropDownClosed Event
  DropDownOpened Event
  ComboBoxData Class
  ComboBoxData Members
  ComboBoxData Constructor
  ComboBoxData Methods
  ComboBoxData Properties
  Image Property
  ComboBoxMember Class
  ComboBoxMember Members
  ComboBoxMember Methods
  ComboBoxMember Properties
  GroupName Property
  Image Property
  ComboBoxMemberData Class
  ComboBoxMemberData Members
  ComboBoxMemberData Constructor
  ComboBoxMemberData Methods
  ComboBoxMemberData Properties
  GroupName Property
  Image Property
  Text Property
  ContextualHelp Class
  ContextualHelp Members
  ContextualHelp Constructor
  ContextualHelp Methods
  Launch Method
  ContextualHelp Properties
  HelpPath Property
  HelpTopicUrl Property
  HelpType Property
  ContextualHelpType Enumeration
  DockablePane Class
  DockablePane Members
  DockablePane Constructor
  DockablePane Constructor (DockablePane)
  DockablePane Constructor (DockablePaneId)
  DockablePane Methods
  Dispose Method
  GetTitle Method
  Hide Method
  IsShown Method
  PaneExists Method
  PaneIsBuiltIn Method
  PaneIsRegistered Method
  Show Method
  DockablePane Properties
  Id Property
  IsValidObject Property
  DockablePaneId Class
  DockablePaneId Members
  DockablePaneId Constructor
  DockablePaneId Methods
  DockablePaneId Operators
  Equality Operator
  Inequality Operator
  DockablePaneId Properties
  DockablePaneProviderData Class
  DockablePaneProviderData Members
  DockablePaneProviderData Constructor
  DockablePaneProviderData Methods
  DockablePaneProviderData Properties
  FrameworkElement Property
  InitialState Property
  DockablePanes Class
  DockablePanes.BuiltInDockablePanes Class
  DockablePanes.BuiltInDockablePanes Members
  DockablePanes.BuiltInDockablePanes Properties
  ElementView Property
  FamilyBrowser Property
  HostByLinkNavigator Property
  ProjectBrowser Property
  PropertiesPalette Property
  RebarBrowser Property
  SystemNavigator Property
  ViewBrowser Property
  DockablePaneState Class
  DockablePaneState Members
  DockablePaneState Constructor
  DockablePaneState Constructor
  DockablePaneState Constructor (DockablePaneState)
  DockablePaneState Methods
  Dispose Method
  SetFloatingRectangle Method
  DockablePaneState Properties
  DockPosition Property
  FloatingRectangle Property
  IsValidObject Property
  TabBehind Property
  DockPosition Enumeration
  ExternalApplicationArray Class
  ExternalApplicationArray Members
  ExternalApplicationArray Constructor
  ExternalApplicationArray Methods
  Append Method
  Clear Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  ExternalApplicationArray Properties
  IsEmpty Property
  Item Property
  Size Property
  ExternalApplicationArrayIterator Class
  ExternalApplicationArrayIterator Members
  ExternalApplicationArrayIterator Constructor
  ExternalApplicationArrayIterator Methods
  MoveNext Method
  Reset Method
  ExternalApplicationArrayIterator Properties
  Current Property
  ExternalCommandData Class
  ExternalCommandData Members
  ExternalCommandData Methods
  ExternalCommandData Properties
  Application Property
  JournalData Property
  View Property
  ExternalEvent Class
  ExternalEvent Members
  ExternalEvent Methods
  Create Method
  CreateJournalable Method
  Dispose Method
  Raise Method
  ExternalEvent Properties
  IsPending Property
  ExternalEventRequest Enumeration
  FilterDialog Class
  FilterDialog Members
  FilterDialog Constructor
  FilterDialog Constructor (Document, ElementId)
  FilterDialog Constructor (Document, String)
  FilterDialog Methods
  Dispose Method
  Show Method
  FilterDialog Properties
  FilterToSelect Property
  IsValidObject Property
  NewFilterId Property
  NewFilterName Property
  IControllableDropHandler Interface
  IControllableDropHandler Members
  IControllableDropHandler Methods
  CanExecute Method
  IDockablePaneProvider Interface
  IDockablePaneProvider Members
  IDockablePaneProvider Methods
  SetupDockablePane Method
  IDropHandler Interface
  IDropHandler Members
  IDropHandler Methods
  Execute Method
  IExternalApplication Interface
  IExternalApplication Members
  IExternalApplication Methods
  OnShutdown Method
  OnStartup Method
  IExternalCommand Interface
  IExternalCommand Members
  IExternalCommand Methods
  Execute Method
  IExternalCommandAvailability Interface
  IExternalCommandAvailability Members
  IExternalCommandAvailability Methods
  IsCommandAvailable Method
  IExternalEventHandler Interface
  IExternalEventHandler Members
  IExternalEventHandler Methods
  Execute Method
  GetName Method
  IExternalResourceUIServer Interface
  IExternalResourceUIServer Members
  IExternalResourceUIServer Methods
  GetDBServerId Method
  HandleBrowseResult Method
  HandleLoadResourceResults Method
  PostableCommand Enumeration
  PreviewControl Class
  PreviewControl Members
  PreviewControl Constructor
  PreviewControl Methods
  AddHandler Method
  ApplyAnimationClock Method
  BeginAnimation Method
  BeginStoryboard Method
  BringIntoView Method
  ClearValue Method
  Dispose Method
  SetBinding Method
  SetValue Method
  TransformToAncestor Method
  PreviewControl Properties
  ScrollbarVisibility Property
  UIView Property
  ViewId Property
  PreviewControl Events
  PromptForFamilyInstancePlacementOptions Class
  PromptForFamilyInstancePlacementOptions Members
  PromptForFamilyInstancePlacementOptions Constructor
  PromptForFamilyInstancePlacementOptions Constructor
  PromptForFamilyInstancePlacementOptions Constructor (PromptForFamilyInstancePlacementOptions)
  PromptForFamilyInstancePlacementOptions Methods
  Dispose Method
  PromptForFamilyInstancePlacementOptions Properties
  IsValidObject Property
  PlaceAirTerminalOnDuct Property
  PulldownButton Class
  PulldownButton Members
  PulldownButton Methods
  AddPushButton Method
  AddSeparator Method
  GetItems Method
  PulldownButton Properties
  PulldownButtonData Class
  PulldownButtonData Members
  PulldownButtonData Constructor
  PulldownButtonData Methods
  PulldownButtonData Properties
  PushButton Class
  PushButton Members
  PushButton Methods
  PushButton Properties
  AssemblyName Property
  AvailabilityClassName Property
  ClassName Property
  PushButtonData Class
  PushButtonData Members
  PushButtonData Constructor
  PushButtonData Methods
  PushButtonData Properties
  AssemblyName Property
  AvailabilityClassName Property
  ClassName Property
  RadioButtonGroup Class
  RadioButtonGroup Members
  RadioButtonGroup Methods
  AddItem Method
  AddItems Method
  GetItems Method
  RadioButtonGroup Properties
  Current Property
  RadioButtonGroupData Class
  RadioButtonGroupData Members
  RadioButtonGroupData Constructor
  RadioButtonGroupData Methods
  RadioButtonGroupData Properties
  Rectangle Class
  Rectangle Members
  Rectangle Constructor
  Rectangle Constructor
  Rectangle Constructor (Rectangle)
  Rectangle Constructor (Int32, Int32, Int32, Int32)
  Rectangle Methods
  Dispose Method
  IsNormalized Method
  Rectangle Properties
  Bottom Property
  IsValidObject Property
  Left Property
  Right Property
  Top Property
  Result Enumeration
  RevitCommandId Class
  RevitCommandId Members
  RevitCommandId Methods
  LookupCommandId Method
  LookupPostableCommandId Method
  RevitCommandId Properties
  CanHaveBinding Property
  HasBinding Property
  Id Property
  Name Property
  RevitLinkUIUtils Class
  RevitLinkUIUtils Members
  RevitLinkUIUtils Methods
  ReportLinkLoadResults Method
  RibbonButton Class
  RibbonButton Members
  RibbonButton Methods
  RibbonButton Properties
  Image Property
  IsEnabledByContext Property
  LargeImage Property
  RibbonItem Class
  RibbonItem Members
  RibbonItem Methods
  Equals Method
  GetContextualHelp Method
  SetContextualHelp Method
  RibbonItem Properties
  Enabled Property
  ItemText Property
  ItemType Property
  LongDescription Property
  Name Property
  ToolTip Property
  ToolTipImage Property
  Visible Property
  RibbonItemData Class
  RibbonItemData Members
  RibbonItemData Methods
  GetContextualHelp Method
  SetContextualHelp Method
  RibbonItemData Properties
  LongDescription Property
  Name Property
  ToolTip Property
  ToolTipImage Property
  RibbonItemType Enumeration
  RibbonPanel Class
  RibbonPanel Members
  RibbonPanel Methods
  AddItem Method
  AddSeparator Method
  AddSlideOut Method
  AddStackedItems Method
  AddStackedItems Method (RibbonItemData, RibbonItemData)
  AddStackedItems Method (RibbonItemData, RibbonItemData, RibbonItemData)
  Equals Method
  GetItems Method
  RibbonPanel Properties
  Enabled Property
  Name Property
  Title Property
  Visible Property
  ScrollbarVisibility Enumeration
  SplitButton Class
  SplitButton Members
  SplitButton Methods
  SplitButton Properties
  CurrentButton Property
  IsSynchronizedWithCurrentItem Property
  SplitButtonData Class
  SplitButtonData Members
  SplitButtonData Constructor
  SplitButtonData Methods
  SplitButtonData Properties
  Tab Enumeration
  TabbedDialogAction Delegate
  TabbedDialogExtension Class
  TabbedDialogExtension Members
  TabbedDialogExtension Constructor
  TabbedDialogExtension Methods
  GetContextualHelp Method
  SetContextualHelp Method
  TabbedDialogExtension Properties
  Control Property
  OnCancelAction Property
  OnOKAction Property
  OnRestoreDefaultsAction Property
  TaskDialog Class
  TaskDialog Members
  TaskDialog Constructor
  TaskDialog Methods
  AddCommandLink Method
  AddCommandLink Method (TaskDialogCommandLinkId, String)
  AddCommandLink Method (TaskDialogCommandLinkId, String, String)
  Show Method
  Show Method
  Show Method (String, String)
  Show Method (String, String, TaskDialogCommonButtons)
  Show Method (String, String, TaskDialogCommonButtons, TaskDialogResult)
  WasVerificationChecked Method
  TaskDialog Properties
  AllowCancellation Property
  CommonButtons Property
  DefaultButton Property
  ExpandedContent Property
  FooterText Property
  Id Property
  MainContent Property
  MainIcon Property
  MainInstruction Property
  Title Property
  TitleAutoPrefix Property
  VerificationText Property
  TaskDialogCommandLinkId Enumeration
  TaskDialogCommonButtons Enumeration
  TaskDialogIcon Enumeration
  TaskDialogResult Enumeration
  TextBox Class
  TextBox Members
  TextBox Methods
  TextBox Properties
  Image Property
  PromptText Property
  SelectTextOnFocus Property
  ShowImageAsButton Property
  Value Property
  Width Property
  TextBox Events
  EnterPressed Event
  TextBoxData Class
  TextBoxData Members
  TextBoxData Constructor
  TextBoxData Methods
  TextBoxData Properties
  Image Property
  ToggleButton Class
  ToggleButton Members
  ToggleButton Methods
  ToggleButton Properties
  ToggleButtonData Class
  ToggleButtonData Members
  ToggleButtonData Constructor
  ToggleButtonData Constructor (String, String)
  ToggleButtonData Constructor (String, String, String, String)
  ToggleButtonData Methods
  ToggleButtonData Properties
  UIApplication Class
  UIApplication Members
  UIApplication Constructor
  UIApplication Methods
  CanPostCommand Method
  CreateAddInCommandBinding Method
  CreateRibbonPanel Method
  CreateRibbonPanel Method (String)
  CreateRibbonPanel Method (String, String)
  CreateRibbonPanel Method (Tab, String)
  CreateRibbonTab Method
  Dispose Method
  DoDragDrop Method
  DoDragDrop Method (ICollection(String))
  DoDragDrop Method (Object, IDropHandler)
  GetDockablePane Method
  GetRibbonPanels Method
  GetRibbonPanels Method
  GetRibbonPanels Method (String)
  GetRibbonPanels Method (Tab)
  LoadAddIn Method
  LoadPackageContents Method
  OpenAndActivateDocument Method
  OpenAndActivateDocument Method (String)
  OpenAndActivateDocument Method (ModelPath, OpenOptions, Boolean)
  PostCommand Method
  RegisterDockablePane Method
  RemoveAddInCommandBinding Method
  UIApplication Properties
  ActiveAddInId Property
  ActiveUIDocument Property
  Application Property
  DrawingAreaExtents Property
  IsValidObject Property
  LoadedApplications Property
  MainWindowExtents Property
  UIApplication Events
  ApplicationClosing Event
  DialogBoxShowing Event
  DisplayingOptionsDialog Event
  DockableFrameFocusChanged Event
  DockableFrameVisibilityChanged Event
  Idling Event
  ViewActivated Event
  ViewActivating Event
  UIControlledApplication Class
  UIControlledApplication Members
  UIControlledApplication Methods
  CreateAddInCommandBinding Method
  CreateRibbonPanel Method
  CreateRibbonPanel Method (String)
  CreateRibbonPanel Method (String, String)
  CreateRibbonPanel Method (Tab, String)
  CreateRibbonTab Method
  GetDockablePane Method
  GetRibbonPanels Method
  GetRibbonPanels Method
  GetRibbonPanels Method (String)
  GetRibbonPanels Method (Tab)
  LoadAddIn Method
  LoadPackageContents Method
  RegisterDockablePane Method
  RemoveAddInCommandBinding Method
  UIControlledApplication Properties
  ActiveAddInId Property
  ControlledApplication Property
  IsLateAddinLoading Property
  LoadedApplications Property
  UIControlledApplication Events
  ApplicationClosing Event
  DialogBoxShowing Event
  DisplayingOptionsDialog Event
  DockableFrameFocusChanged Event
  DockableFrameVisibilityChanged Event
  Idling Event
  ViewActivated Event
  ViewActivating Event
  UIDocument Class
  UIDocument Members
  UIDocument Constructor
  UIDocument Methods
  CanPlaceElementType Method
  Dispose Method
  GetOpenUIViews Method
  GetRevitUIFamilyLoadOptions Method
  PostRequestForElementTypePlacement Method
  PromptForFamilyInstancePlacement Method
  PromptForFamilyInstancePlacement Method (FamilySymbol)
  PromptForFamilyInstancePlacement Method (FamilySymbol, PromptForFamilyInstancePlacementOptions)
  PromptToMatchElementType Method
  PromptToPlaceElementTypeOnLegendView Method
  PromptToPlaceViewOnSheet Method
  RefreshActiveView Method
  RequestViewChange Method
  SaveAndClose Method
  SaveAs Method
  ShowElements Method
  ShowElements Method (Element)
  ShowElements Method (ElementId)
  ShowElements Method (ICollection(ElementId))
  ShowElements Method (ElementSet)
  UIDocument Properties
  ActiveGraphicalView Property
  ActiveView Property
  Application Property
  Document Property
  IsValidObject Property
  Selection Property
  UITheme Enumeration
  UIThemeManager Class
  UIThemeManager Members
  UIThemeManager Methods
  GetThemeName Method
  UIThemeManager Properties
  CurrentTheme Property
  DefaultTheme Property
  UIView Class
  UIView Members
  UIView Methods
  Close Method
  Dispose Method
  GetWindowRectangle Method
  GetZoomCorners Method
  Zoom Method
  ZoomAndCenterRectangle Method
  ZoomSheetSize Method
  ZoomToFit Method
  UIView Properties
  ViewId Property
  Autodesk.Revit.UI.Events Namespace
  ApplicationClosingEventArgs Class
  ApplicationClosingEventArgs Members
  ApplicationClosingEventArgs Methods
  ApplicationClosingEventArgs Properties
  BeforeExecutedEventArgs Class
  BeforeExecutedEventArgs Members
  BeforeExecutedEventArgs Methods
  BeforeExecutedEventArgs Properties
  CanExecuteEventArgs Class
  CanExecuteEventArgs Members
  CanExecuteEventArgs Methods
  GetSelectedCategoryIds Method
  CanExecuteEventArgs Properties
  CanExecute Property
  ComboBoxCurrentChangedEventArgs Class
  ComboBoxCurrentChangedEventArgs Members
  ComboBoxCurrentChangedEventArgs Methods
  ComboBoxCurrentChangedEventArgs Properties
  NewValue Property
  OldValue Property
  ComboBoxDropDownClosedEventArgs Class
  ComboBoxDropDownClosedEventArgs Members
  ComboBoxDropDownClosedEventArgs Constructor
  ComboBoxDropDownClosedEventArgs Methods
  ComboBoxDropDownClosedEventArgs Properties
  ComboBoxDropDownOpenedEventArgs Class
  ComboBoxDropDownOpenedEventArgs Members
  ComboBoxDropDownOpenedEventArgs Constructor
  ComboBoxDropDownOpenedEventArgs Methods
  ComboBoxDropDownOpenedEventArgs Properties
  CommandEventArgs Class
  CommandEventArgs Members
  CommandEventArgs Methods
  CommandEventArgs Properties
  ActiveDocument Property
  CommandId Property
  DialogBoxData Class
  DialogBoxData Members
  DialogBoxData Methods
  OverrideResult Method
  DialogBoxData Properties
  HelpId Property
  DialogBoxShowingEventArgs Class
  DialogBoxShowingEventArgs Members
  DialogBoxShowingEventArgs Methods
  OverrideResult Method
  DialogBoxShowingEventArgs Properties
  HelpId Property
  DisplayingOptionsDialogEventArgs Class
  DisplayingOptionsDialogEventArgs Members
  DisplayingOptionsDialogEventArgs Methods
  AddTab Method
  DisplayingOptionsDialogEventArgs Properties
  PagesCount Property
  DockableFrameFocusChangedEventArgs Class
  DockableFrameFocusChangedEventArgs Members
  DockableFrameFocusChangedEventArgs Methods
  DockableFrameFocusChangedEventArgs Properties
  FocusGained Property
  PaneId Property
  DockableFrameVisibilityChangedEventArgs Class
  DockableFrameVisibilityChangedEventArgs Members
  DockableFrameVisibilityChangedEventArgs Methods
  DockableFrameVisibilityChangedEventArgs Properties
  DockableFrameShown Property
  PaneId Property
  ExecutedEventArgs Class
  ExecutedEventArgs Members
  ExecutedEventArgs Methods
  ExecutedEventArgs Properties
  IdlingEventArgs Class
  IdlingEventArgs Members
  IdlingEventArgs Methods
  SetRaiseWithoutDelay Method
  IdlingEventArgs Properties
  MessageBoxData Class
  MessageBoxData Members
  MessageBoxData Methods
  MessageBoxData Properties
  DialogType Property
  Message Property
  MessageBoxShowingEventArgs Class
  MessageBoxShowingEventArgs Members
  MessageBoxShowingEventArgs Methods
  MessageBoxShowingEventArgs Properties
  DialogType Property
  Message Property
  RibbonItemEventArgs Class
  RibbonItemEventArgs Members
  RibbonItemEventArgs Constructor
  RibbonItemEventArgs Methods
  RibbonItemEventArgs Properties
  Application Property
  TaskDialogShowingEventArgs Class
  TaskDialogShowingEventArgs Members
  TaskDialogShowingEventArgs Methods
  TaskDialogShowingEventArgs Properties
  DialogId Property
  Message Property
  TextBoxEnterPressedEventArgs Class
  TextBoxEnterPressedEventArgs Members
  TextBoxEnterPressedEventArgs Constructor
  TextBoxEnterPressedEventArgs Methods
  TextBoxEnterPressedEventArgs Properties
  ViewActivatedEventArgs Class
  ViewActivatedEventArgs Members
  ViewActivatedEventArgs Methods
  ViewActivatedEventArgs Properties
  CurrentActiveView Property
  PreviousActiveView Property
  ViewActivatingEventArgs Class
  ViewActivatingEventArgs Members
  ViewActivatingEventArgs Methods
  ViewActivatingEventArgs Properties
  CurrentActiveView Property
  NewActiveView Property
  Autodesk.Revit.UI.Macros Namespace
  ApplicationEntryPoint Class
  ApplicationEntryPoint Members
  ApplicationEntryPoint Constructor
  ApplicationEntryPoint Methods
  CreateRibbonPanel Method
  CreateRibbonPanel Method (String)
  CreateRibbonPanel Method (String, String)
  CreateRibbonPanel Method (Tab, String)
  CreateRibbonTab Method
  FinishInitializationEO Method
  GetRibbonPanels Method
  GetRibbonPanels Method
  GetRibbonPanels Method (String)
  GetRibbonPanels Method (Tab)
  Initialize Method
  OnShutdownEO Method
  OpenAndActivateDocument Method
  ApplicationEntryPoint Properties
  AddinFolder Property
  ApplicationEntryPoint Events
  DocumentEntryPoint Class
  DocumentEntryPoint Members
  DocumentEntryPoint Constructor
  DocumentEntryPoint Methods
  FinishInitializationEO Method
  Initialize Method
  OnShutdownEO Method
  PromptForFamilyInstancePlacement Method
  ShowElements Method
  DocumentEntryPoint Properties
  AddinFolder Property
  UIDocumentMacroOptions Enumeration
  UIMacroManager Class
  UIMacroManager Members
  UIMacroManager Methods
  AddModule Method
  Dispose Method
  EditMacro Method
  EditModule Method
  GetMacroManager Method
  GetMacroManager Method (UIApplication)
  GetMacroManager Method (UIDocument)
  GetUIDocumentMacroSecurityOptions Method
  RemoveModule Method
  SetUIDocumentMacroSecurityOptions Method
  StepInto Method
  UIMacroManager Properties
  IsValidObject Property
  MacroManager Property
  Autodesk.Revit.UI.Mechanical Namespace
  DuctFittingAndAccessoryPressureDropUIData Class
  DuctFittingAndAccessoryPressureDropUIData Members
  DuctFittingAndAccessoryPressureDropUIData Methods
  Dispose Method
  GetUIDataItems Method
  GetUnits Method
  DuctFittingAndAccessoryPressureDropUIData Properties
  IsValidObject Property
  DuctFittingAndAccessoryPressureDropUIDataItem Class
  DuctFittingAndAccessoryPressureDropUIDataItem Members
  DuctFittingAndAccessoryPressureDropUIDataItem Methods
  Dispose Method
  GetDuctFittingAndAccessoryData Method
  GetEntity Method
  SetEntity Method
  DuctFittingAndAccessoryPressureDropUIDataItem Properties
  IsValidObject Property
  IDuctFittingAndAccessoryPressureDropUIServer Interface
  IDuctFittingAndAccessoryPressureDropUIServer Members
  IDuctFittingAndAccessoryPressureDropUIServer Methods
  GetDBServerId Method
  ShowSettings Method
  Autodesk.Revit.UI.Plumbing Namespace
  IPipeFittingAndAccessoryPressureDropUIServer Interface
  IPipeFittingAndAccessoryPressureDropUIServer Members
  IPipeFittingAndAccessoryPressureDropUIServer Methods
  GetDBServerId Method
  ShowSettings Method
  PipeFittingAndAccessoryPressureDropUIData Class
  PipeFittingAndAccessoryPressureDropUIData Members
  PipeFittingAndAccessoryPressureDropUIData Methods
  Dispose Method
  GetUIDataItems Method
  GetUnits Method
  PipeFittingAndAccessoryPressureDropUIData Properties
  IsValidObject Property
  PipeFittingAndAccessoryPressureDropUIDataItem Class
  PipeFittingAndAccessoryPressureDropUIDataItem Members
  PipeFittingAndAccessoryPressureDropUIDataItem Methods
  Dispose Method
  GetEntity Method
  GetPipeFittingAndAccessoryData Method
  SetEntity Method
  PipeFittingAndAccessoryPressureDropUIDataItem Properties
  IsValidObject Property
  Autodesk.Revit.UI.Selection Namespace
  ISelectionFilter Interface
  ISelectionFilter Members
  ISelectionFilter Methods
  AllowElement Method
  AllowReference Method
  ObjectSnapTypes Enumeration
  ObjectType Enumeration
  PickBoxStyle Enumeration
  PickedBox Class
  PickedBox Members
  PickedBox Methods
  PickedBox Properties
  Max Property
  Min Property
  SelectableInViewFilter Class
  SelectableInViewFilter Members
  SelectableInViewFilter Constructor
  SelectableInViewFilter Constructor (Document, ElementId)
  SelectableInViewFilter Constructor (Document, ElementId, Boolean)
  SelectableInViewFilter Methods
  PassesFilter Method
  SelectableInViewFilter Properties
  Selection Class
  Selection Members
  Selection Methods
  Dispose Method
  GetElementIds Method
  PickBox Method
  PickBox Method (PickBoxStyle)
  PickBox Method (PickBoxStyle, String)
  PickElementsByRectangle Method
  PickElementsByRectangle Method
  PickElementsByRectangle Method (String)
  PickElementsByRectangle Method (ISelectionFilter)
  PickElementsByRectangle Method (ISelectionFilter, String)
  PickObject Method
  PickObject Method (ObjectType)
  PickObject Method (ObjectType, ISelectionFilter)
  PickObject Method (ObjectType, String)
  PickObject Method (ObjectType, ISelectionFilter, String)
  PickObjects Method
  PickObjects Method (ObjectType)
  PickObjects Method (ObjectType, ISelectionFilter)
  PickObjects Method (ObjectType, String)
  PickObjects Method (ObjectType, ISelectionFilter, String)
  PickObjects Method (ObjectType, ISelectionFilter, String, IList(Reference))
  PickPoint Method
  PickPoint Method
  PickPoint Method (String)
  PickPoint Method (ObjectSnapTypes)
  PickPoint Method (ObjectSnapTypes, String)
  SetElementIds Method
  Selection Properties
  Elements Property
  IsValidObject Property
  SelElementSet Class
  SelElementSet Members
  SelElementSet Methods
  Add Method
  Clear Method
  Create Method
  Erase Method
  Remove Method
  SelElementSet Properties
  Autodesk.Revit.Utility Namespace
  Asset Class
  Asset Members
  Asset Methods
  GetConnectedProperty Method
  Asset Properties
  AssetType Property
  Item Property
  LibraryName Property
  Title Property
  AssetProperties Class
  AssetProperties Members
  AssetProperties Methods
  GetConnectedProperty Method
  AssetProperties Properties
  Item Property
  Item Property (Int32)
  Item Property (String)
  Size Property
  AssetProperty Class
  AssetProperty Members
  AssetProperty Methods
  Dispose Method
  GetAllConnectedProperties Method
  GetConnectedPropertiesNames Method
  GetConnectedProperty Method
  GetConnectedProperty Method (Int32)
  GetConnectedProperty Method (String)
  GetTypeName Method
  AssetProperty Properties
  IsReadOnly Property
  IsValidObject Property
  Name Property
  NumberOfConnectedProperties Property
  Type Property
  AssetPropertyBoolean Class
  AssetPropertyBoolean Members
  AssetPropertyBoolean Methods
  GetConnectedProperty Method
  AssetPropertyBoolean Properties
  Value Property
  AssetPropertyDistance Class
  AssetPropertyDistance Members
  AssetPropertyDistance Methods
  GetConnectedProperty Method
  AssetPropertyDistance Properties
  DisplayUnitType Property
  Value Property
  AssetPropertyDouble Class
  AssetPropertyDouble Members
  AssetPropertyDouble Methods
  GetConnectedProperty Method
  AssetPropertyDouble Properties
  Value Property
  AssetPropertyDoubleArray2d Class
  AssetPropertyDoubleArray2d Members
  AssetPropertyDoubleArray2d Methods
  GetConnectedProperty Method
  AssetPropertyDoubleArray2d Properties
  Value Property
  AssetPropertyDoubleArray3d Class
  AssetPropertyDoubleArray3d Members
  AssetPropertyDoubleArray3d Methods
  GetConnectedProperty Method
  AssetPropertyDoubleArray3d Properties
  Value Property
  AssetPropertyDoubleArray4d Class
  AssetPropertyDoubleArray4d Members
  AssetPropertyDoubleArray4d Methods
  GetConnectedProperty Method
  AssetPropertyDoubleArray4d Properties
  Value Property
  AssetPropertyDoubleMatrix44 Class
  AssetPropertyDoubleMatrix44 Members
  AssetPropertyDoubleMatrix44 Methods
  GetConnectedProperty Method
  AssetPropertyDoubleMatrix44 Properties
  Value Property
  AssetPropertyEnum Class
  AssetPropertyEnum Members
  AssetPropertyEnum Methods
  GetConnectedProperty Method
  AssetPropertyEnum Properties
  Value Property
  AssetPropertyFloat Class
  AssetPropertyFloat Members
  AssetPropertyFloat Methods
  GetConnectedProperty Method
  AssetPropertyFloat Properties
  Value Property
  AssetPropertyFloatArray Class
  AssetPropertyFloatArray Members
  AssetPropertyFloatArray Methods
  GetConnectedProperty Method
  GetValue Method
  AssetPropertyFloatArray Properties
  AssetPropertyInt64 Class
  AssetPropertyInt64 Members
  AssetPropertyInt64 Methods
  GetConnectedProperty Method
  AssetPropertyInt64 Properties
  Value Property
  AssetPropertyInteger Class
  AssetPropertyInteger Members
  AssetPropertyInteger Methods
  GetConnectedProperty Method
  AssetPropertyInteger Properties
  Value Property
  AssetPropertyList Class
  AssetPropertyList Members
  AssetPropertyList Methods
  GetConnectedProperty Method
  GetValue Method
  AssetPropertyList Properties
  AssetPropertyReference Class
  AssetPropertyReference Members
  AssetPropertyReference Methods
  GetConnectedProperty Method
  AssetPropertyReference Properties
  AssetPropertyString Class
  AssetPropertyString Members
  AssetPropertyString Methods
  GetConnectedProperty Method
  AssetPropertyString Properties
  Value Property
  AssetPropertyTime Class
  AssetPropertyTime Members
  AssetPropertyTime Methods
  GetConnectedProperty Method
  AssetPropertyTime Properties
  Value Property
  AssetPropertyType Enumeration
  AssetPropertyUInt64 Class
  AssetPropertyUInt64 Members
  AssetPropertyUInt64 Methods
  GetConnectedProperty Method
  AssetPropertyUInt64 Properties
  Value Property
  AssetSet Class
  AssetSet Members
  AssetSet Constructor
  AssetSet Methods
  Clear Method
  Contains Method
  Erase Method
  ForwardIterator Method
  GetEnumerator Method
  Insert Method
  ReverseIterator Method
  AssetSet Properties
  IsEmpty Property
  Size Property
  AssetSetIterator Class
  AssetSetIterator Members
  AssetSetIterator Constructor
  AssetSetIterator Methods
  MoveNext Method
  Reset Method
  AssetSetIterator Properties
  Current Property
  AssetType Enumeration